{
  "url": "https://www.imdb.com/title/tt0349205/",
  "timestamp": "2025-06-18 14:22:19.901079",
  "summary": {
    "content_name": "Doce en casa",
    "platform": "imdb",
    "total_reviews_analyzed": 46,
    "average_confidence": 0.565,
    "average_sentiment_score": -0.391,
    "average_predicted_rating": 2.2,
    "sentiment_distribution": {
      "negative": 24,
      "positive": 8,
      "neutral": 14
    },
    "most_common_emotion": "neutral",
    "top_keywords": [
      "comedy",
      "movie",
      "martin plays",
      "family film",
      "discrepancies screenplay",
      "unfortunately remake",
      "screenplay",
      "cast unfortunately",
      "martin fans",
      "steve martin"
    ],
    "top_3_liked": [
      "Performances: Spirited and fun cast.",
      "Family Dynamics: Heart-warming and relatable moments.",
      "Humor: Some funny and enjoyable moments."
    ],
    "top_3_disliked": [
      "Lack of Original Charm: Missing irreverence and likability of the original.",
      "Plot Holes: Inconsistencies and weak script.",
      "Pacing Issues: Some pacing problems and discrepancies in screenplay."
    ],
    "textrank_summary": "I did like this movie in general. There are some funny moments and the performances are spirited from the entire cast. Unfortunately, although as a remake it is acceptable it does have its weak spots. I didn't feel as though it had the charm of the original, by that I mean that doesn't quite have the irreverence and likability that made the original so endearing. There are some pacing problems and major discrepancies in the screenplay, plus the direction wasn't as strong as it could have been. On the whole though, it is not too bad. There is some nice scenery and camera work. The performances from the cast are fun; Steve Martin does very well in the title role, and the ensemble of children have strong chemistry. And despite the weak script, there are some funny moments, like the mince-in-the-trousers part. And there are some heart-warming parts like the ending. Overall, flawed but acceptable. 6/10 Bethany Cox . The film deals about a happy family , the father (Steve Martin) is a notorious coach and the mother (Bonnie Hunt) is a writer and with twelve sons (Tom Welling, Piper Perabo, Hilary Duff..) . He receives a new offer as a trainer of a famous football team . She obtains her dream for the publishing the book titled : ¨Cheaper by the dozen¨. With the new job , they must change from a small city to the big town . Steve Martin ought to keep the familiar order involving in his own home while at the same time training the team .\nThe picture is pretty entertaining and amusing , the film contains bemusing scenes and continuous laughters and various chuckles with lots of fun . It's a new version of the classic film with similar title featured by Clifton Webb and Myrna Loy adding episodes from ¨Home Alone¨ as when Ashton Kutcher (uncredited) , being the Pier Perabo's boyfriend , suffers numerous jokes and misfortunes in charge of the brothers , likeness to thieves from former film . The picture belongs to numerous family sub-genre whose maxim representation is ¨Yours , mine and ours¨ with Henry Fonda and Lucille Ball and recently remade with Dennis Quaid and Rene Russo . Steve Martin , as always , plays as excessive manner , making an authentic recital , if you like Martin's crazy interpretation , you'll enjoy this one . Besides , there appears as sons , known and young actors as Tom Welling (Smallville) , Hilary Duff (LizzyMcGuire) , Piper Perabo (Bar Coyote) and Ashton Kutcher(Guess) . The motion picture was well realized by Shawn Levy and with the same equipment was shot the second part . The flick will appeal to familiar films enthusiasts and Steve Martin fans. . As a child, I read and loved the book, \"Cheaper by the dozen\", so I rented the movie expecting an on-screen adaptation of the book.  I think the only similarities are the title, and the fact that they have 12 kids.  The movie does the book a huge injustice.\nExpectations aside, the movie had some plot holes, but I would have appreciated this kind of film if I was a parent looking for a family film. It reminded me of the old Disney classics my family rented when I was growing up.  I'm sure that kids would love the mess and destruction that seemed to be the focal point of the movie.  They tried to cram too many sub-plots into it when they could have focused strictly on the family dynamics and had a great movie.\nI'm just glad I rented it and didn't spend $$ at the theater. . There is some resemblance to the original movie in this film (as well as some elements borrowed from the sequel \"Belles on their Toes\").  The writers did include various ideas such as the move for the father's job, the family council, the father being offered the opportunity of his dreams, the father being a somewhat eccentric and unusual character, the mother being the calm one, etc. It also borrows just as much from sixties family comedies such as \"Yours, Mine, and Ours\" (i.e. the son that feels left out in the family group, the older brother who give \"cool\" advice to the younger ones, the kids trying to \"sabotage\" various events, etc.).  \nThis version lacks something that the original one had.  The original moved along with the pace of the changes in the family's life as normal life does. It also seemed to capture better the idea of trying to raise such a large group of children and the sacrifices and choices one has to make.  There is also some semblance of what it is like to be a child in this family by keeping that focus on only one of the children, while still giving us glimpses of what the other ones are like.\nThe film, however, seemed to be more of a showcase for the comedic talents of Steven Martin than anything else.  It also didn't move along in the same way that the original making the story somewhat unsatisfying.   \nFrank Gilbreth never lost the idea that his family was the most important thing where as Steve Martin's character has to be brought back into the fold. It is understandable that he would want something for himself, but to get him to the point where he sees his children as a burden and a liability is a problem.  Thankfully in the end he comes back to being a part of his family, but the fact that he had to be causes the story to loose some of its charm.  \nThe thing that made Frank and Ernestine Gilbreth want to write about their family was the joy that they knew in living in it despite the trials and tribulations. In this version of their story the joy seems to be lost and has to be recaptured.  The director and writer are lucky enough that at least a little bit does. . N/A . Cheaper by the Dozen is a good movie with a well written storyline and a talented cast.The movie is nothing hilarious or outstanding,but is certainly very fun and enjoyable,it's a good family film that contains enough jokes for both children and adults.Steve Martin is without a doubt the movies highlight and the person that holds it together from being a complete mess,although the entire child cast are actually quite good and are all of very high standards for their age.Cheaper by the Dozen is nothing fantastic,but it's still a fun ride and I would recommend it to anyone looking for a good family film. \nWhile his wife is gone to New York,Tom Baker (Steve Martin) must take care of their twelve children all on his own. \nBest Performance: Steve Martin Worst Performance: Steven Anthony Lawrence . N/A . Tom (Steve Martin) and Kate Baker (Bonnie Hunt) had big career dreams and big family dreams. The family wins out and they leave the big city. The kids don't stop coming until number 12. The oldest being played by Piper Perabo, Tom Welling, and Hilary Duff. There are also twins, lookalike girls, sad little boy, other girl, cute boy, chunkier boy, and smaller cute boy. Tom is a high school football coach who gets a chance at a bigger job. The family is forced to move to the city for his job where Nora (Piper Perabo) lives with her boyfriend Hank (Ashton Kutcher). With less time with the big job, Tom has to deal with everything else after Kate gets a book tour to NYC.\nLet's be obvious. There are too many kids. It becomes chaos not just in the house but in the story. It's just a series of wacky slapstick. It's general harmless family fun. If you don't have enough fun, the characters will keep smashing things up until you laugh. It's a lot pratfall fluff and not a lot of seriousness. There are some good silly fun pushing Kutcher around. Steve Martin and Bonnie Hunt are definitely game for all the craziness. . N/A . I think children will like this more than the adults, it's a bit bland . N/A . Tom Baker is a football coach who receives a call from his college friend,Shake,to be a new coach for Shake's team. But,he must move back to Chicago.His family(the wife Kate,and twelve children)have to make a decision:will they move to the Chicago.Their children don't want to move,because they don't want to leave their friends and school.But Tom doesn't want to leave his new job,and then they move.The children aren't happy to see a big town.They think that they don't fit in 'big' town. If you want to know what happens then,watch the movie. This is a simple,family comedy movie.It isn't bad,but also it isn't very good .But it's better then 2nd part. . N/A . N/A . N/A . N/A . A fun family film, but nothing too special. It does work as effective birth control for big families, though. :) . N/A . One of my favorite comedy movies is Cheaper by the Dozen. It seems like a very entertaining, meaningful, warm family movie to me. There are cute, mischievous characters. I can say that I enjoyed watching each one with a smile. It is probably difficult to make a movie where children are at the forefront, but it can be said that it does justice to it. I think it is one of the productions that should be watched by those who want to have fun and laugh a lot. They definitely won't regret it. It's not great, but it does its job, that is, it makes you laugh. The sequel was a disappointment in my opinion and did not interest me. . N/A . A fairly amusing family comedy, with almost no relation to the book or the earlier film with this title. Steve Martin plays the father of the group of 12 kids who uproots them all to move to the big city where a football coaching job awaits.. suddenly the mom (an amusingly bemused Bonnie Hunt) gets called away on a book tour and dad has to raise all the kids himself. Interesting casting has Piper Perabo (star of the gloriously underrated \"Coyote Ugly\") as the oldest daughter, Hillary Duff as the teenage daughter, Tom Welling (of TV's \"Smallville\") as the oldest son and Ashton Kutcher taking an unbilled role as Piper's live-in boyfriend.. and poking fun at himself in the process. The rest of the kids are mostly of the unknown but cute variety,... and the kids get most of the laughs with their various schemes and screw ups along with Martin's reactions to it all. The ending drags a bit as things start to get serious and the family is on the verge of falling apart, but as long as it sticks  to the pratfalls the film can be very amusing. GRADE: B . Rent this film or watch it at cinema theater seems not the worst mistake you do(especially,if you're intend to entertain you child).You pick one of the funniest comedy family ever made.That's okay!In here,i'm just only want to give a comment about the Casting,Directing and anything else.Maybe,there wasn't bad cast in this film.Steve martin:great,Bonnie Hunt:Attractive,Tom Welling:Cool(Beside he's so sexy!),Hillary Duff:Not bad and the kids:Nice and cutes!But,Maybe,because the script wasn't good enough and them it made them looks tacky or just not as good as usual!Directing also not the greatest one but it quite interesting.So,Just watch it!You'll laugh and enjoy it.Keep my Words! . \"Cheaper By the Dozen\" would have at least been an amusing film if it hadn't already been made about a hundred times before. In the early stages of production I was actually misled into thinking it was a direct adaptation of the book, and was excited to see how they'd pull that off. Little did I know the title is all the film has in common with its source.\nSteve Martin plays Tom Baker, an average Joe with twelve kids who drive him insane. When he decides to chase after the money and head out to the big city, his kids throw a fuss and protest by performing \"hilarious\" physical comedy that will \"have you in stitches.\" I suppose we're meant to sympathize with the little brats. The problem is that it's hard to find sympathy for the spawn of Satan. I felt like slapping the kids and throwing them out the window of a thousand-foot skyscraper.\nAshton Kutcher makes a \"delightful\" cameo. Just what we need - another ugly mug from MTV grinning at the camera.\nWhat happened to Steve Martin? Why on earth did he feel the need to star in this film? Was it just the money? Was it the prospect of pretending to have Bonnie Hunt as a wife? Or was it trying to appeal to the masses again and using children's familiarity with Hilary Duff to reintroduce himself into the family market and therefore appeal to his own children? Is he really that pathetic? Please, Steve...come back...we miss you. Stop doing this. Do you really want to end up like Eddie Murphy? Oh, wait. Too late. . I did like this movie in general. There are some funny moments and the performances are spirited from the entire cast. Unfortunately, although as a remake it is acceptable it does have its weak spots. I didn't feel as though it had the charm of the original, by that I mean that doesn't quite have the irreverence and likability that made the original so endearing. There are some pacing problems and major discrepancies in the screenplay, plus the direction wasn't as strong as it could have been. On the whole though, it is not too bad. There is some nice scenery and camera work. The performances from the cast are fun; Steve Martin does very well in the title role, and the ensemble of children have strong chemistry. And despite the weak script, there are some funny moments, like the mince-in-the-trousers part. And there are some heart-warming parts like the ending. Overall, flawed but acceptable. 6/10 Bethany Cox . The film deals about a happy family , the father (Steve Martin) is a notorious coach and the mother (Bonnie Hunt) is a writer and with twelve sons (Tom Welling, Piper Perabo, Hilary Duff..) . He receives a new offer as a trainer of a famous football team . She obtains her dream for the publishing the book titled : ¨Cheaper by the dozen¨. With the new job , they must change from a small city to the big town . Steve Martin ought to keep the familiar order involving in his own home while at the same time training the team .\nThe picture is pretty entertaining and amusing , the film contains bemusing scenes and continuous laughters and various chuckles with lots of fun . It's a new version of the classic film with similar title featured by Clifton Webb and Myrna Loy adding episodes from ¨Home Alone¨ as when Ashton Kutcher (uncredited) , being the Pier Perabo's boyfriend , suffers numerous jokes and misfortunes in charge of the brothers , likeness to thieves from former film . The picture belongs to numerous family sub-genre whose maxim representation is ¨Yours , mine and ours¨ with Henry Fonda and Lucille Ball and recently remade with Dennis Quaid and Rene Russo . Steve Martin , as always , plays as excessive manner , making an authentic recital , if you like Martin's crazy interpretation , you'll enjoy this one . Besides , there appears as sons , known and young actors as Tom Welling (Smallville) , Hilary Duff (LizzyMcGuire) , Piper Perabo (Bar Coyote) and Ashton Kutcher(Guess) . The motion picture was well realized by Shawn Levy and with the same equipment was shot the second part . The flick will appeal to familiar films enthusiasts and Steve Martin fans. . As a child, I read and loved the book, \"Cheaper by the dozen\", so I rented the movie expecting an on-screen adaptation of the book.  I think the only similarities are the title, and the fact that they have 12 kids.  The movie does the book a huge injustice.\nExpectations aside, the movie had some plot holes, but I would have appreciated this kind of film if I was a parent looking for a family film. It reminded me of the old Disney classics my family rented when I was growing up.  I'm sure that kids would love the mess and destruction that seemed to be the focal point of the movie.  They tried to cram too many sub-plots into it when they could have focused strictly on the family dynamics and had a great movie.\nI'm just glad I rented it and didn't spend $$ at the theater. . There is some resemblance to the original movie in this film (as well as some elements borrowed from the sequel \"Belles on their Toes\").  The writers did include various ideas such as the move for the father's job, the family council, the father being offered the opportunity of his dreams, the father being a somewhat eccentric and unusual character, the mother being the calm one, etc. It also borrows just as much from sixties family comedies such as \"Yours, Mine, and Ours\" (i.e. the son that feels left out in the family group, the older brother who give \"cool\" advice to the younger ones, the kids trying to \"sabotage\" various events, etc.).  \nThis version lacks something that the original one had.  The original moved along with the pace of the changes in the family's life as normal life does. It also seemed to capture better the idea of trying to raise such a large group of children and the sacrifices and choices one has to make.  There is also some semblance of what it is like to be a child in this family by keeping that focus on only one of the children, while still giving us glimpses of what the other ones are like.\nThe film, however, seemed to be more of a showcase for the comedic talents of Steven Martin than anything else.  It also didn't move along in the same way that the original making the story somewhat unsatisfying.   \nFrank Gilbreth never lost the idea that his family was the most important thing where as Steve Martin's character has to be brought back into the fold. It is understandable that he would want something for himself, but to get him to the point where he sees his children as a burden and a liability is a problem.  Thankfully in the end he comes back to being a part of his family, but the fact that he had to be causes the story to loose some of its charm.  \nThe thing that made Frank and Ernestine Gilbreth want to write about their family was the joy that they knew in living in it despite the trials and tribulations. In this version of their story the joy seems to be lost and has to be recaptured.  The director and writer are lucky enough that at least a little bit does. . N/A . Cheaper by the Dozen is a good movie with a well written storyline and a talented cast.The movie is nothing hilarious or outstanding,but is certainly very fun and enjoyable,it's a good family film that contains enough jokes for both children and adults.Steve Martin is without a doubt the movies highlight and the person that holds it together from being a complete mess,although the entire child cast are actually quite good and are all of very high standards for their age.Cheaper by the Dozen is nothing fantastic,but it's still a fun ride and I would recommend it to anyone looking for a good family film. \nWhile his wife is gone to New York,Tom Baker (Steve Martin) must take care of their twelve children all on his own. \nBest Performance: Steve Martin Worst Performance: Steven Anthony Lawrence . N/A . Tom (Steve Martin) and Kate Baker (Bonnie Hunt) had big career dreams and big family dreams. The family wins out and they leave the big city. The kids don't stop coming until number 12. The oldest being played by Piper Perabo, Tom Welling, and Hilary Duff. There are also twins, lookalike girls, sad little boy, other girl, cute boy, chunkier boy, and smaller cute boy. Tom is a high school football coach who gets a chance at a bigger job. The family is forced to move to the city for his job where Nora (Piper Perabo) lives with her boyfriend Hank (Ashton Kutcher). With less time with the big job, Tom has to deal with everything else after Kate gets a book tour to NYC.\nLet's be obvious. There are too many kids. It becomes chaos not just in the house but in the story. It's just a series of wacky slapstick. It's general harmless family fun. If you don't have enough fun, the characters will keep smashing things up until you laugh. It's a lot pratfall fluff and not a lot of seriousness. There are some good silly fun pushing Kutcher around. Steve Martin and Bonnie Hunt are definitely game for all the craziness. . N/A . I think children will like this more than the adults, it's a bit bland . N/A . Tom Baker is a football coach who receives a call from his college friend,Shake,to be a new coach for Shake's team. But,he must move back to Chicago.His family(the wife Kate,and twelve children)have to make a decision:will they move to the Chicago.Their children don't want to move,because they don't want to leave their friends and school.But Tom doesn't want to leave his new job,and then they move.The children aren't happy to see a big town.They think that they don't fit in 'big' town. If you want to know what happens then,watch the movie. This is a simple,family comedy movie.It isn't bad,but also it isn't very good .But it's better then 2nd part. . N/A . N/A . N/A . N/A . A fun family film, but nothing too special. It does work as effective birth control for big families, though. :) . N/A . One of my favorite comedy movies is Cheaper by the Dozen. It seems like a very entertaining, meaningful, warm family movie to me. There are cute, mischievous characters. I can say that I enjoyed watching each one with a smile. It is probably difficult to make a movie where children are at the forefront, but it can be said that it does justice to it. I think it is one of the productions that should be watched by those who want to have fun and laugh a lot. They definitely won't regret it. It's not great, but it does its job, that is, it makes you laugh. The sequel was a disappointment in my opinion and did not interest me. . N/A . A fairly amusing family comedy, with almost no relation to the book or the earlier film with this title. Steve Martin plays the father of the group of 12 kids who uproots them all to move to the big city where a football coaching job awaits.. suddenly the mom (an amusingly bemused Bonnie Hunt) gets called away on a book tour and dad has to raise all the kids himself. Interesting casting has Piper Perabo (star of the gloriously underrated \"Coyote Ugly\") as the oldest daughter, Hillary Duff as the teenage daughter, Tom Welling (of TV's \"Smallville\") as the oldest son and Ashton Kutcher taking an unbilled role as Piper's live-in boyfriend.. and poking fun at himself in the process. The rest of the kids are mostly of the unknown but cute variety,... and the kids get most of the laughs with their various schemes and screw ups along with Martin's reactions to it all. The ending drags a bit as things start to get serious and the family is on the verge of falling apart, but as long as it sticks  to the pratfalls the film can be very amusing. GRADE: B . Rent this film or watch it at cinema theater seems not the worst mistake you do(especially,if you're intend to entertain you child).You pick one of the funniest comedy family ever made.That's okay!In here,i'm just only want to give a comment about the Casting,Directing and anything else.Maybe,there wasn't bad cast in this film.Steve martin:great,Bonnie Hunt:Attractive,Tom Welling:Cool(Beside he's so sexy!),Hillary Duff:Not bad and the kids:Nice and cutes!But,Maybe,because the script wasn't good enough and them it made them looks tacky or just not as good as usual!Directing also not the greatest one but it quite interesting.So,Just watch it!You'll laugh and enjoy it.Keep my Words! . \"Cheaper By the Dozen\" would have at least been an amusing film if it hadn't already been made about a hundred times before. In the early stages of production I was actually misled into thinking it was a direct adaptation of the book, and was excited to see how they'd pull that off. Little did I know the title is all the film has in common with its source.\nSteve Martin plays Tom Baker, an average Joe with twelve kids who drive him insane. When he decides to chase after the money and head out to the big city, his kids throw a fuss and protest by performing \"hilarious\" physical comedy that will \"have you in stitches.\" I suppose we're meant to sympathize with the little brats. The problem is that it's hard to find sympathy for the spawn of Satan. I felt like slapping the kids and throwing them out the window of a thousand-foot skyscraper.\nAshton Kutcher makes a \"delightful\" cameo. Just what we need - another ugly mug from MTV grinning at the camera.\nWhat happened to Steve Martin? Why on earth did he feel the need to star in this film? Was it just the money? Was it the prospect of pretending to have Bonnie Hunt as a wife? Or was it trying to appeal to the masses again and using children's familiarity with Hilary Duff to reintroduce himself into the family market and therefore appeal to his own children? Is he really that pathetic? Please, Steve...come back...we miss you. Stop doing this. Do you really want to end up like Eddie Murphy? Oh, wait. Too late."
  },
  "reviews": [
    {
      "text": "I did like this movie in general. There are some funny moments and the performances are spirited from the entire cast. Unfortunately, although as a remake it is acceptable it does have its weak spots. I didn't feel as though it had the charm of the original, by that I mean that doesn't quite have the irreverence and likability that made the original so endearing. There are some pacing problems and major discrepancies in the screenplay, plus the direction wasn't as strong as it could have been. On the whole though, it is not too bad. There is some nice scenery and camera work. The performances from the cast are fun; Steve Martin does very well in the title role, and the ensemble of children have strong chemistry. And despite the weak script, there are some funny moments, like the mince-in-the-trousers part. And there are some heart-warming parts like the ending. Overall, flawed but acceptable. 6/10 Bethany Cox",
      "language": "en",
      "sentiment": {
        "label": "neutral",
        "score": 0.0,
        "confidence": 0.0,
        "polarity": 0.0
      },
      "keywords": [
        "discrepancies screenplay",
        "unfortunately remake",
        "screenplay",
        "cast unfortunately",
        "movie"
      ],
      "emotions": {
        "top_emotion": "joy",
        "all_emotions": {
          "joy": 0.8701339364051819,
          "neutral": 0.07661741971969604,
          "sadness": 0.02205095998942852,
          "disgust": 0.016582559794187546,
          "surprise": 0.010428082197904587,
          "anger": 0.002974513918161392,
          "fear": 0.0012125830398872495
        }
      },
      "predicted_rating": 3,
      "analysis_success": true,
      "review_id": 1,
      "original_title": "Acceptable remake but not as good as the original",
      "original_rating": "6",
      "date": ""
    },
    {
      "text": "The film deals about a happy family , the father (Steve Martin) is a notorious coach and the mother (Bonnie Hunt) is a writer and with twelve sons (Tom Welling, Piper Perabo, Hilary Duff..) . He receives a new offer as a trainer of a famous football team . She obtains her dream for the publishing the book titled : ¨Cheaper by the dozen¨. With the new job , they must change from a small city to the big town . Steve Martin ought to keep the familiar order involving in his own home while at the same time training the team .\nThe picture is pretty entertaining and amusing , the film contains bemusing scenes and continuous laughters and various chuckles with lots of fun . It's a new version of the classic film with similar title featured by Clifton Webb and Myrna Loy adding episodes from ¨Home Alone¨ as when Ashton Kutcher (uncredited) , being the Pier Perabo's boyfriend , suffers numerous jokes and misfortunes in charge of the brothers , likeness to thieves from former film . The picture belongs to numerous family sub-genre whose maxim representation is ¨Yours , mine and ours¨ with Henry Fonda and Lucille Ball and recently remade with Dennis Quaid and Rene Russo . Steve Martin , as always , plays as excessive manner , making an authentic recital , if you like Martin's crazy interpretation , you'll enjoy this one . Besides , there appears as sons , known and young actors as Tom Welling (Smallville) , Hilary Duff (LizzyMcGuire) , Piper Perabo (Bar Coyote) and Ashton Kutcher(Guess) . The motion picture was well realized by Shawn Levy and with the same equipment was shot the second part . The flick will appeal to familiar films enthusiasts and Steve Martin fans.",
      "language": "en",
      "sentiment": {
        "label": "positive",
        "score": 0.5,
        "confidence": 0.5,
        "polarity": 0.5
      },
      "keywords": [
        "martin fans",
        "martin plays",
        "steve martin",
        "like martin",
        "martin crazy"
      ],
      "emotions": {
        "top_emotion": "joy",
        "all_emotions": {
          "joy": 0.9314103722572327,
          "neutral": 0.04903591051697731,
          "surprise": 0.005747675430029631,
          "sadness": 0.005538349971175194,
          "disgust": 0.0044832536950707436,
          "anger": 0.003213077550753951,
          "fear": 0.0005712415440939367
        }
      },
      "predicted_rating": 4,
      "analysis_success": true,
      "review_id": 2,
      "original_title": "Steve Martin's  entertaining  vehicle  with young people and agreeable actors",
      "original_rating": "6",
      "date": ""
    },
    {
      "text": "As a child, I read and loved the book, \"Cheaper by the dozen\", so I rented the movie expecting an on-screen adaptation of the book.  I think the only similarities are the title, and the fact that they have 12 kids.  The movie does the book a huge injustice.\nExpectations aside, the movie had some plot holes, but I would have appreciated this kind of film if I was a parent looking for a family film. It reminded me of the old Disney classics my family rented when I was growing up.  I'm sure that kids would love the mess and destruction that seemed to be the focal point of the movie.  They tried to cram too many sub-plots into it when they could have focused strictly on the family dynamics and had a great movie.\nI'm just glad I rented it and didn't spend $$ at the theater.",
      "language": "en",
      "sentiment": {
        "label": "negative",
        "score": -0.5,
        "confidence": 0.5,
        "polarity": -0.5
      },
      "keywords": [
        "kids movie",
        "rented movie",
        "movie plot",
        "great movie",
        "movie expecting"
      ],
      "emotions": {
        "top_emotion": "joy",
        "all_emotions": {
          "joy": 0.7847031950950623,
          "neutral": 0.128934845328331,
          "sadness": 0.04018868878483772,
          "disgust": 0.02047635428607464,
          "anger": 0.014980521984398365,
          "surprise": 0.009956312365829945,
          "fear": 0.0007600241806358099
        }
      },
      "predicted_rating": 2,
      "analysis_success": true,
      "review_id": 3,
      "original_title": "Disasters by the dozen",
      "original_rating": "5",
      "date": ""
    },
    {
      "text": "There is some resemblance to the original movie in this film (as well as some elements borrowed from the sequel \"Belles on their Toes\").  The writers did include various ideas such as the move for the father's job, the family council, the father being offered the opportunity of his dreams, the father being a somewhat eccentric and unusual character, the mother being the calm one, etc. It also borrows just as much from sixties family comedies such as \"Yours, Mine, and Ours\" (i.e. the son that feels left out in the family group, the older brother who give \"cool\" advice to the younger ones, the kids trying to \"sabotage\" various events, etc.).  \nThis version lacks something that the original one had.  The original moved along with the pace of the changes in the family's life as normal life does. It also seemed to capture better the idea of trying to raise such a large group of children and the sacrifices and choices one has to make.  There is also some semblance of what it is like to be a child in this family by keeping that focus on only one of the children, while still giving us glimpses of what the other ones are like.\nThe film, however, seemed to be more of a showcase for the comedic talents of Steven Martin than anything else.  It also didn't move along in the same way that the original making the story somewhat unsatisfying.   \nFrank Gilbreth never lost the idea that his family was the most important thing where as Steve Martin's character has to be brought back into the fold. It is understandable that he would want something for himself, but to get him to the point where he sees his children as a burden and a liability is a problem.  Thankfully in the end he comes back to being a part of his family, but the fact that he had to be causes the story to loose some of its charm.  \nThe thing that made Frank and Ernestine Gilbreth want to write about their family was the joy that they knew in living in it despite the trials and tribulations. In this version of their story the joy seems to be lost and has to be recaptured.  The director and writer are lucky enough that at least a little bit does.",
      "language": "en",
      "sentiment": {
        "label": "neutral",
        "score": 0.0,
        "confidence": 0.0,
        "polarity": 0.0
      },
      "keywords": [
        "original movie",
        "movie film",
        "comedies son",
        "family comedies",
        "movie"
      ],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.7404179573059082,
          "sadness": 0.12053241580724716,
          "joy": 0.05964226648211479,
          "disgust": 0.05656597390770912,
          "anger": 0.00934883113950491,
          "fear": 0.00868008378893137,
          "surprise": 0.004812462255358696
        }
      },
      "predicted_rating": 3,
      "analysis_success": true,
      "review_id": 4,
      "original_title": "Only something like the original",
      "original_rating": "N/A",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 5,
      "original_title": "Cheaper but Entertaining Update.",
      "original_rating": "6",
      "date": ""
    },
    {
      "text": "Cheaper by the Dozen is a good movie with a well written storyline and a talented cast.The movie is nothing hilarious or outstanding,but is certainly very fun and enjoyable,it's a good family film that contains enough jokes for both children and adults.Steve Martin is without a doubt the movies highlight and the person that holds it together from being a complete mess,although the entire child cast are actually quite good and are all of very high standards for their age.Cheaper by the Dozen is nothing fantastic,but it's still a fun ride and I would recommend it to anyone looking for a good family film. \nWhile his wife is gone to New York,Tom Baker (Steve Martin) must take care of their twelve children all on his own. \nBest Performance: Steve Martin Worst Performance: Steven Anthony Lawrence",
      "language": "en",
      "sentiment": {
        "label": "positive",
        "score": 0.5,
        "confidence": 0.5,
        "polarity": 0.5
      },
      "keywords": [
        "good movie",
        "movie hilarious",
        "cheaper dozen",
        "family film",
        "doubt movies"
      ],
      "emotions": {
        "top_emotion": "joy",
        "all_emotions": {
          "joy": 0.9801180362701416,
          "neutral": 0.008547118864953518,
          "sadness": 0.003483773907646537,
          "anger": 0.0027178646996617317,
          "disgust": 0.0024585917126387358,
          "surprise": 0.0015669127460569143,
          "fear": 0.001107601448893547
        }
      },
      "predicted_rating": 4,
      "analysis_success": true,
      "review_id": 6,
      "original_title": "Not a Hilarious Comedy,but a Fun Family Movie,",
      "original_rating": "7",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 7,
      "original_title": "And the moral is........",
      "original_rating": "1",
      "date": ""
    },
    {
      "text": "Tom (Steve Martin) and Kate Baker (Bonnie Hunt) had big career dreams and big family dreams. The family wins out and they leave the big city. The kids don't stop coming until number 12. The oldest being played by Piper Perabo, Tom Welling, and Hilary Duff. There are also twins, lookalike girls, sad little boy, other girl, cute boy, chunkier boy, and smaller cute boy. Tom is a high school football coach who gets a chance at a bigger job. The family is forced to move to the city for his job where Nora (Piper Perabo) lives with her boyfriend Hank (Ashton Kutcher). With less time with the big job, Tom has to deal with everything else after Kate gets a book tour to NYC.\nLet's be obvious. There are too many kids. It becomes chaos not just in the house but in the story. It's just a series of wacky slapstick. It's general harmless family fun. If you don't have enough fun, the characters will keep smashing things up until you laugh. It's a lot pratfall fluff and not a lot of seriousness. There are some good silly fun pushing Kutcher around. Steve Martin and Bonnie Hunt are definitely game for all the craziness.",
      "language": "en",
      "sentiment": {
        "label": "neutral",
        "score": 0.0,
        "confidence": 0.0,
        "polarity": 0.0
      },
      "keywords": [
        "oldest played",
        "12 oldest",
        "boy tom",
        "oldest",
        "city kids"
      ],
      "emotions": {
        "top_emotion": "sadness",
        "all_emotions": {
          "sadness": 0.4412406086921692,
          "neutral": 0.2773890793323517,
          "joy": 0.18816350400447845,
          "surprise": 0.0745353251695633,
          "disgust": 0.009468977339565754,
          "anger": 0.007163118105381727,
          "fear": 0.0020394304301589727
        }
      },
      "predicted_rating": 3,
      "analysis_success": true,
      "review_id": 8,
      "original_title": "fine slapstick family movie",
      "original_rating": "6",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 9,
      "original_title": "Deeply Flawed  The message seems to be: \"Give up; accept second best\"",
      "original_rating": "4",
      "date": ""
    },
    {
      "text": "I think children will like this more than the adults, it's a bit bland",
      "language": "en",
      "sentiment": {
        "label": "neutral",
        "score": 0.0,
        "confidence": 0.0,
        "polarity": 0.0
      },
      "keywords": [
        "children like",
        "think children",
        "children",
        "like adults",
        "adults bit"
      ],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.381677508354187,
          "sadness": 0.32034382224082947,
          "disgust": 0.21767251193523407,
          "joy": 0.05608206242322922,
          "surprise": 0.012631174176931381,
          "anger": 0.007238146383315325,
          "fear": 0.004354775883257389
        }
      },
      "predicted_rating": 3,
      "analysis_success": true,
      "review_id": 10,
      "original_title": "Children will love it",
      "original_rating": "6",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 11,
      "original_title": "you call this a family film??",
      "original_rating": "4",
      "date": ""
    },
    {
      "error": "The expanded size of the tensor (586) must match the existing size (514) at non-singleton dimension 1.  Target sizes: [1, 586].  Tensor sizes: [1, 514]",
      "analysis_success": false,
      "review_id": 12,
      "original_title": "Not as good as the original, but still very good",
      "original_rating": "9",
      "date": ""
    },
    {
      "text": "Tom Baker is a football coach who receives a call from his college friend,Shake,to be a new coach for Shake's team. But,he must move back to Chicago.His family(the wife Kate,and twelve children)have to make a decision:will they move to the Chicago.Their children don't want to move,because they don't want to leave their friends and school.But Tom doesn't want to leave his new job,and then they move.The children aren't happy to see a big town.They think that they don't fit in 'big' town. If you want to know what happens then,watch the movie. This is a simple,family comedy movie.It isn't bad,but also it isn't very good .But it's better then 2nd part.",
      "language": "en",
      "sentiment": {
        "label": "neutral",
        "score": 0.0,
        "confidence": 0.0,
        "polarity": 0.0
      },
      "keywords": [
        "tom baker",
        "coach shake",
        "coach",
        "baker",
        "baker football"
      ],
      "emotions": {
        "top_emotion": "sadness",
        "all_emotions": {
          "sadness": 0.9646832942962646,
          "surprise": 0.009642891585826874,
          "neutral": 0.009373519569635391,
          "joy": 0.008300978690385818,
          "anger": 0.005410608369857073,
          "disgust": 0.0014627370983362198,
          "fear": 0.0011259015882387757
        }
      },
      "predicted_rating": 3,
      "analysis_success": true,
      "review_id": 13,
      "original_title": "Cheaper by the devils",
      "original_rating": "7",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 14,
      "original_title": "Children Of The Damned",
      "original_rating": "1",
      "date": ""
    },
    {
      "error": "The expanded size of the tensor (884) must match the existing size (514) at non-singleton dimension 1.  Target sizes: [1, 884].  Tensor sizes: [1, 514]",
      "analysis_success": false,
      "review_id": 15,
      "original_title": "'Name Only' Remake of 1950 Classic is Warm, Funny Film...",
      "original_rating": "N/A",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 16,
      "original_title": "Nice film for the whole family to enjoy",
      "original_rating": "7",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 17,
      "original_title": "It's Fun To Watch, But It's Not Martin's Shining Film(SPOILERS)",
      "original_rating": "6",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 18,
      "original_title": "Surely the best advertisement for contraception ever devised.",
      "original_rating": "1",
      "date": ""
    },
    {
      "text": "A fun family film, but nothing too special. It does work as effective birth control for big families, though. :)",
      "language": "en",
      "sentiment": {
        "label": "neutral",
        "score": 0.0,
        "confidence": 0.0,
        "polarity": 0.0
      },
      "keywords": [
        "family film",
        "effective birth",
        "birth control",
        "fun family",
        "film special"
      ],
      "emotions": {
        "top_emotion": "joy",
        "all_emotions": {
          "joy": 0.9455556869506836,
          "neutral": 0.029423944652080536,
          "sadness": 0.008330291137099266,
          "disgust": 0.00803949125111103,
          "surprise": 0.006104415748268366,
          "anger": 0.0017466932768002152,
          "fear": 0.0007994524203240871
        }
      },
      "predicted_rating": 3,
      "analysis_success": true,
      "review_id": 19,
      "original_title": "Effective birth control",
      "original_rating": "6",
      "date": ""
    },
    {
      "text": "N/A",
      "language": "tl",
      "sentiment": {
        "label": "negative",
        "score": -1.0,
        "confidence": 1.0,
        "polarity": -1.0
      },
      "keywords": [],
      "emotions": {
        "top_emotion": "neutral",
        "all_emotions": {
          "neutral": 0.8335199356079102,
          "sadness": 0.053624968975782394,
          "disgust": 0.05288037657737732,
          "surprise": 0.025854982435703278,
          "anger": 0.018495921045541763,
          "fear": 0.00877479836344719,
          "joy": 0.00684904120862484
        }
      },
      "predicted_rating": 1,
      "analysis_success": true,
      "review_id": 20,
      "original_title": "Boring and Cliché",
      "original_rating": "1",
      "date": ""
    }
  ]
}