[
  {
    "title": "",
    "text": "!",
    "date": "2025-06-11T17:01:18",
    "rating": 5
  },
  {
    "title": "",
    "text": "This game is dead... full of bots.. unfair penalties.... matchmaking its terrible... and you cannot say anything to a russian troll because you get muted for life.... \n\nI am out...",
    "date": "2025-06-07T12:30:26",
    "rating": 1
  },
  {
    "title": "",
    "text": "Pretty good game.",
    "date": "2025-06-06T18:52:51",
    "rating": 5
  },
  {
    "title": "",
    "text": "love it",
    "date": "2025-05-27T20:13:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "It is the best game if you want a engaging fun challenging experience.",
    "date": "2025-05-21T06:16:58",
    "rating": 5
  },
  {
    "title": "",
    "text": "its good",
    "date": "2025-05-14T10:46:21",
    "rating": 5
  },
  {
    "title": "",
    "text": "Communication score is a joke. Zero words, always play assigned role to my best. Communication score keeps dropping without exploiting anything and doing decent in every game. Shitty, easily exploitable system made for lambs of modern era",
    "date": "2025-05-13T13:21:19",
    "rating": 1
  },
  {
    "title": "",
    "text": "very addictive play with caution your life my fall apart, you've been warned",
    "date": "2025-04-07T06:57:16",
    "rating": 1
  },
  {
    "title": "",
    "text": "Piece of Utter Trash I do not know how anyone enjoys this. I would rather be buried alive.",
    "date": "2025-04-06T22:53:33",
    "rating": 1
  },
  {
    "title": "",
    "text": "Ainda vou precisar de algumas horas a mais para poder avaliar corretamente...",
    "date": "2025-04-06T18:28:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "to many updates",
    "date": "2025-03-26T01:50:03",
    "rating": 5
  },
  {
    "title": "",
    "text": "A perfect game to \"come back to\". When every other game gets boring. You can allways come back for a round of Dota 2.",
    "date": "2025-03-17T13:48:40",
    "rating": 5
  },
  {
    "title": "",
    "text": "помойка",
    "date": "2025-03-14T18:54:50",
    "rating": 1
  },
  {
    "title": "",
    "text": "10 social credit scores out of 10\n10 new shtty maps out of 10\n10 dota to league of legends conversions out of 10\n10 -40% concurrent players in the past year after \"the patch\" out of 10",
    "date": "2025-03-12T20:51:23",
    "rating": 1
  },
  {
    "title": "",
    "text": "good",
    "date": "2025-03-11T03:41:26",
    "rating": 5
  },
  {
    "title": "",
    "text": "This is the game that i will probably play till my time on this earth expires",
    "date": "2025-03-08T04:10:46",
    "rating": 5
  },
  {
    "title": "",
    "text": "Shit",
    "date": "2025-03-01T15:45:30",
    "rating": 1
  },
  {
    "title": "",
    "text": "unbalanced\n\nPlay this game only if you hate yourself otherwise play League of Legends.",
    "date": "2025-03-01T00:10:34",
    "rating": 1
  },
  {
    "title": "",
    "text": "toxic, auto losses because trolls exist",
    "date": "2025-02-28T00:59:13",
    "rating": 1
  },
  {
    "title": "",
    "text": "FREE GAME",
    "date": "2025-02-25T11:54:55",
    "rating": 5
  },
  {
    "title": "",
    "text": "They try to make it more stupid and more stupid, now rivers, after that ocean.",
    "date": "2025-02-23T22:28:25",
    "rating": 1
  },
  {
    "title": "",
    "text": "love it\r\n",
    "date": "2025-02-20T03:19:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "I hear this game is played by nothing but nerds.\n\new.",
    "date": "2025-02-14T14:00:40",
    "rating": 1
  },
  {
    "title": "",
    "text": ">",
    "date": "2025-02-08T20:29:08",
    "rating": 5
  },
  {
    "title": "",
    "text": "Really a time killer thing, very dangerous",
    "date": "2025-02-07T23:22:07",
    "rating": 5
  },
  {
    "title": "",
    "text": "Good game.",
    "date": "2025-02-03T23:18:46",
    "rating": 5
  },
  {
    "title": "",
    "text": "love this game!!",
    "date": "2025-01-27T03:15:55",
    "rating": 5
  },
  {
    "title": "",
    "text": "Piece of trash game, horrible Toxic community \r\nNoobs every day \r\nworthless calipration",
    "date": "2025-01-23T06:24:20",
    "rating": 1
  },
  {
    "title": "",
    "text": "Heed with caution. Once you start there is no going back.",
    "date": "2024-12-31T17:55:04",
    "rating": 5
  },
  {
    "title": "",
    "text": "Not looking for a job, a chore or a masters degree. I want a hobby, a game, some fun. \r\n\r\nFine so some I'm sure but for me not interesting in dedicating an insane amount of time to a single game to keep current.\r\n\r\nIn spite of its playable rating for Steam deck, I'm not sure how. Not only does it seem to randomly change when it accepts face button inputs, the track pad doesnt work for the mouse as so many other similar interfaces would and you are contantly switching to touch screen but even that does not work intuitively as a mouse replacement in game.",
    "date": "2024-12-24T14:42:48",
    "rating": 1
  },
  {
    "title": "",
    "text": "WORST GAME EVER!",
    "date": "2024-12-16T17:47:49",
    "rating": 1
  },
  {
    "title": "",
    "text": "best of best!",
    "date": "2024-12-05T14:40:22",
    "rating": 5
  },
  {
    "title": "",
    "text": "Road to 1 mmr XD",
    "date": "2024-12-03T15:22:35",
    "rating": 5
  },
  {
    "title": "",
    "text": "Best game you suck at",
    "date": "2024-12-03T10:18:37",
    "rating": 5
  },
  {
    "title": "",
    "text": "ADSA",
    "date": "2024-12-02T20:06:49",
    "rating": 5
  },
  {
    "title": "",
    "text": "Wars Amazing. \nGG!",
    "date": "2024-12-01T00:54:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "i recently started playing the dota2 again.\nit is very fun. learning curve is steep, but not impossible. i'd say give the game a try if you left.\n",
    "date": "2024-11-28T19:18:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "more fun then LOL",
    "date": "2024-11-27T23:34:31",
    "rating": 5
  },
  {
    "title": "",
    "text": "Dota 2. Enough Said.",
    "date": "2024-11-23T14:47:14",
    "rating": 5
  },
  {
    "title": "",
    "text": "Don't do it",
    "date": "2024-11-20T10:53:42",
    "rating": 1
  },
  {
    "title": "",
    "text": "good",
    "date": "2024-11-12T19:34:19",
    "rating": 5
  },
  {
    "title": "",
    "text": "parasha\r\n",
    "date": "2024-11-10T07:10:58",
    "rating": 1
  },
  {
    "title": "",
    "text": "beste!",
    "date": "2024-10-26T10:17:31",
    "rating": 5
  },
  {
    "title": "",
    "text": "Frustrating, chaotic and causes all manner of distress.\r\nBretty goob",
    "date": "2024-10-01T08:25:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "I'd say it's pretty good",
    "date": "2024-09-21T04:05:15",
    "rating": 5
  },
  {
    "title": "",
    "text": "dotr",
    "date": "2024-09-10T01:46:54",
    "rating": 5
  },
  {
    "title": "",
    "text": "I love all cultures and respect all people",
    "date": "2024-09-07T04:27:48",
    "rating": 5
  },
  {
    "title": "",
    "text": "ty",
    "date": "2024-08-20T16:29:50",
    "rating": 5
  },
  {
    "title": "",
    "text": "Get in here!",
    "date": "2024-07-19T12:10:08",
    "rating": 5
  },
  {
    "title": "",
    "text": "Made me racist",
    "date": "2024-07-18T13:04:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "Classic\r\n",
    "date": "2024-07-14T21:21:05",
    "rating": 5
  },
  {
    "title": "",
    "text": "trash",
    "date": "2024-07-12T02:12:06",
    "rating": 5
  },
  {
    "title": "",
    "text": "Yes",
    "date": "2024-07-03T01:54:24",
    "rating": 5
  },
  {
    "title": "",
    "text": "Fun Game",
    "date": "2024-06-23T21:30:50",
    "rating": 5
  },
  {
    "title": "",
    "text": "10/10",
    "date": "2024-06-16T15:19:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "I use to play this game religiously for years.  I just recently stated playing again after a couple years gone.  I got punished for leaving a a game that was a stomp.  They put me in a low priority que.  I waited over 1 HOUR, and still no games.  That is not how you treat costumers you wanna keep.  No game should have wait times of even 10-15 min, let alone over an hour.  I will deleteing for good.  Good-bye!",
    "date": "2024-06-11T22:18:24",
    "rating": 1
  },
  {
    "title": "",
    "text": "I hate this game as much as it hates me",
    "date": "2024-06-05T20:16:18",
    "rating": 1
  },
  {
    "title": "",
    "text": "Toxic game full of nec*beards. Do not play this.\r\n10/10 would spend 5k hours on toxic game again",
    "date": "2024-06-04T00:12:25",
    "rating": 1
  },
  {
    "title": "",
    "text": "A lot of terrible people play this game.  The game itself is awesome and when you find good people to play with there is very few better experiences,",
    "date": "2024-06-02T18:29:06",
    "rating": 5
  },
  {
    "title": "",
    "text": "Ja não bastasse esse desequilibrio entre os herois, ainda fizeram esse novo sistema de escolher skill, dota ficou um lixo, desinstalei e não volto a jogar mais",
    "date": "2024-05-26T01:25:17",
    "rating": 1
  },
  {
    "title": "",
    "text": "I've been playing Dota 2 for 12 years now, off and on throughout my life it is one of the few constants. In high school, my friends and I spent many nights playing when there was only one courier. In college I played once or twice a year on my rented laptop from school. During the pandemic It was a way for my brothers and I to connect when we couldn't actually visit each other. It holds a great place in my life.\n\n[h3]The Good[/h3]\n- Gameplay is dynamic, engaging and rewarding once you get the hang of it. There are so many moving parts that when you make your first big play, there is very little that can match the feeling of satisfaction when played just right. \n- Flourishing Pro Scene: If you want to get better there are countless new and old pro players that stream or release content on Youtube to help you improve, and often times Discord chats to find players to play with.\n- Semi Consistent Updates: They just released one of the biggest updates the game has seen since Talents were released in 2016, or neutral items were released in 2019, or when they DOUBLED the size of the map in 2022. Valve isn't afraid to experiment with this game, and while you can get stuck on a single patch for a long time, you can always know that Valve Devs are working on something truly different to add.\n\n[h3]Negatives[/h3]\n- Mental Health: This is a team game. I love it for that, but playing with others can be frustrating and demoralizing. You can also find yourself \"chain queuing\" which after multiple losses can really effect your mood outside the game. My girlfriend and I have a rule that I cant start a game after 10pm because if i lose badly sometimes I will be too angry to fall asleep or talk before bed. You have to find these ways to look inward yourself, and without barriers it can really negatively impact you.\n- The Community: I said it a bit above, but if you're new to online games there is so much racism, sexism, anger etc. I've met really great people playing dota, but the brain tends to remember the bad eggs. Remember there is a mute button.\n- Communication from Valve: There can be crickets from valve sometimes. They ARE working on stuff, but if you read reddit to much you can get a bit riled for no reason.\n\nOverall, best game I've ever played by a long margin.",
    "date": "2024-05-24T23:56:03",
    "rating": 5
  },
  {
    "title": "",
    "text": "Great fun game if you've got friends and play around at lower ranks trying stuff out. However, this game has one of the most toxic fanbases in existence, second only to maybe LoL. If you intend on playing solo, do your sanity a favor and just avoid this game like the plague. You will be flamed, griefed, have slurs screamed at you, etc. if these players perceive even a microsecond of sub-optimal play.",
    "date": "2024-05-24T23:34:22",
    "rating": 1
  },
  {
    "title": "",
    "text": "yes.",
    "date": "2024-05-24T19:08:52",
    "rating": 5
  },
  {
    "title": "",
    "text": "i love this game, only issue i have with it is every update i have to either run a scan to fix things or reinstall which is the only quite annoying thing.",
    "date": "2024-05-24T17:26:00",
    "rating": 5
  },
  {
    "title": "",
    "text": "yea its pretty good",
    "date": "2024-05-24T00:11:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "I have played this game for 1,200+ hours.  I have a group of friends who only plays this game (they suck at all other games, which I am good at), so I am stuck playing it with them.  If you never played before, I would say stay away from this game.  It will suck the life out of your soul.  First of all even if you play exactly right, if your team is bad you will lose.  Games take around 40 minutes so its a huge time commitment.  Finally it is by far the most toxic community I have ever experienced in a video game.",
    "date": "2024-05-22T20:19:38",
    "rating": 1
  },
  {
    "title": "",
    "text": "broken matchmaking system",
    "date": "2024-05-19T17:05:57",
    "rating": 1
  },
  {
    "title": "",
    "text": "get good, then its fun... sometimes",
    "date": "2024-05-19T09:44:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "I really can't recommend this game any more. Match making is imbalanced now in every mode but all pick ranked, and the meta is so stale that if you do not group up as five you will lose the game. Toxicity has gotten to the worst point that I've seen in 10 years of Dota. It's sad how bad the US community for this game has gotten and how much Valve has abandoned this game.",
    "date": "2024-05-15T20:39:10",
    "rating": 1
  },
  {
    "title": "",
    "text": "always on the brink of uninstalling, but always down for another game",
    "date": "2024-05-01T13:16:15",
    "rating": 5
  },
  {
    "title": "",
    "text": "Ah, Dota 2, the game where toxicity flows like a never-ending river and the community is as welcoming as a pack of hungry wolves. Strap in, folks, because this rollercoaster of emotional distress is about to make you question your life choices.\n\nLet's start with the community, shall we? A lovely bunch, really, if your idea of lovely involves getting flamed for daring to pick a hero someone else wanted. And don't even get me started on the joy of encountering smurfs who stomp around like they own the place, leaving a trail of shattered dreams in their wake.\n\nBut wait, there's more! Ever wanted to experience the thrill of spending an hour in a match, only to have your hopes dashed by a single misstep? Congratulations, Dota 2 has got you covered. And let's not forget the joy of watching your teammates rage quit faster than you can say \"GG.\"\n\nAnd don't even think about trying to improve. Sure, you could watch tutorials, read guides, and practice till your fingers bleed, but why bother when you can just blame your losses on everyone else? It's the Dota 2 way!\n\nBut overall, despite the salt mines and the occasional dumpster fire of a match, I would still recommend this game. Because beneath all the toxicity lies a surprisingly addictive experience that somehow keeps you coming back for more punishment. So, if you're ready to dive headfirst into a cesspool of salt, frustration, and occasional glimpses of actual gameplay, welcome to Dota 2. Just remember to bring a hazmat suit and a healthy dose of sarcasm. You're gonna need it.",
    "date": "2024-04-27T17:20:22",
    "rating": 5
  },
  {
    "title": "",
    "text": "Came with the Valve Complete Pack when it wasn't free... \n\nEven these 2.7 hours were a complete waste of time. \nIt would have been a better value to buy Steam trading cards for the whole money.",
    "date": "2024-04-24T20:18:55",
    "rating": 1
  },
  {
    "title": "",
    "text": "fun with friends in customs or against bots but the community is way too toxic. you'd have more fun drinking poison than being screamed at by these addicts. cool game toxic community and no real way to circumvent that other than to go do literally anything else",
    "date": "2024-04-23T00:00:27",
    "rating": 1
  },
  {
    "title": "",
    "text": "demonic battlegrounds very fun",
    "date": "2024-04-22T04:37:08",
    "rating": 5
  },
  {
    "title": "",
    "text": "I played hero wars on WC3 custom mode for years. Dota took over in 2012 for me and it's the greatest game ever. The cost is your life, and few other games will make their way into your rotation of playable games - as Dota will always force itself open. But it's worth the cost. Free game no complaining",
    "date": "2024-04-19T15:16:34",
    "rating": 5
  },
  {
    "title": "",
    "text": "Techies fun",
    "date": "2024-03-28T20:57:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "super",
    "date": "2024-03-12T20:21:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "every hour is death and i will continue to die over and over again.\n",
    "date": "2024-03-12T04:00:37",
    "rating": 5
  },
  {
    "title": "",
    "text": "much better and developed than league of legends",
    "date": "2024-03-03T21:13:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "League of Legends but:\r\n\r\n1.    Too zoomed in so you can't see whats happening. \r\n2a.  Stuns and silences that last literally 6 - 8 seconds to remove all chance of counter-play.\r\n2b.  Because of this BKB is needed on 99% of all heroes, giving a few second window where you get to play.\r\n3.    Hero speed is much faster and the map is much bigger, combined with point 1 and its constant panning.\r\n4.    Jungle role is still not a thing, and the jungle is way less interesting.\r\n5.    Hero balance is non-existent. heroes hard counter each-other. Games are decided in hero select.\r\n6.    Somehow even a more toxic community.\r\n7.    Items are less diverse, and it seems the only way they can develop interesting ones is to give them all \r\n       active abilities, making the game a memory game of what item is in what hotkey slot.\r\n8.    Blink is still an expensive item you need to buy, forcing you to chose between mobility or power, making\r\n        it impossible to play a hero that needs a blink in a losing lane.",
    "date": "2024-03-02T01:00:02",
    "rating": 1
  },
  {
    "title": "",
    "text": "Its the best game ever, I have been playing it for like 20 years.",
    "date": "2024-02-09T00:31:17",
    "rating": 5
  },
  {
    "title": "",
    "text": "Great game for timepass",
    "date": "2024-02-06T10:01:04",
    "rating": 5
  },
  {
    "title": "",
    "text": "so toxic it rendered me immune to all other poisons",
    "date": "2024-02-05T01:09:26",
    "rating": 5
  },
  {
    "title": "",
    "text": "not worth it",
    "date": "2024-02-03T17:53:28",
    "rating": 1
  },
  {
    "title": "",
    "text": "the game imho is a very toxic and very time consuming. I dont recoommend to spend any time with this game",
    "date": "2024-01-27T19:38:05",
    "rating": 1
  },
  {
    "title": "",
    "text": "it is a good game but they are really strict with the bans and no really much of a freedom to express. but the game it self is a good game.",
    "date": "2024-01-24T18:57:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "What can I say? One of the best games EVER made <3",
    "date": "2024-01-23T14:34:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "The matches used to take a long time and that makes the learning curve steeper but it's a very deep fast paced game...  It's hard to find a better real time strategy game, the complexity, team dynamics, and high capacity for upset or turn around matches makes for good watching and great play.",
    "date": "2024-01-19T22:59:29",
    "rating": 5
  },
  {
    "title": "",
    "text": "no\ni'd rather my children get into recreational drugs than discover this game",
    "date": "2024-01-15T07:06:44",
    "rating": 1
  },
  {
    "title": "",
    "text": "Can't find any game better than this.",
    "date": "2024-01-13T18:57:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "is not recommended",
    "date": "2024-01-13T14:09:00",
    "rating": 1
  },
  {
    "title": "",
    "text": "inviting community tolerant of new players. simple gameplay (destroy the enemy ancient) produces a relaxed, euphoric, almost meditative state, perfect for enjoying the beautiful hero customizations (skins) as you wait to appear in your fountain.",
    "date": "2024-01-09T03:21:46",
    "rating": 5
  },
  {
    "title": "",
    "text": "The worst fucking MOBA",
    "date": "2024-01-05T17:24:20",
    "rating": 1
  },
  {
    "title": "",
    "text": "This is a new format of chess that both helps relieve stress and seriously raises it to a new level :D",
    "date": "2024-01-01T17:21:47",
    "rating": 5
  },
  {
    "title": "",
    "text": "One of the best games ever conceived. Every game is different from the diverse hero combinations to the special people you encounter along the way. And believe you me you will agree that there are a lot of special people playing Dota.",
    "date": "2024-01-01T14:53:18",
    "rating": 5
  },
  {
    "title": "",
    "text": "It is one of the best multiplayer games to date. This has gone thru serious tweak and game balancing.",
    "date": "2023-12-21T09:33:59",
    "rating": 5
  },
  {
    "title": "",
    "text": "Its not worth it. Trust me\n\n148 hours later, still not worth it.",
    "date": "2023-12-13T10:54:21",
    "rating": 5
  },
  {
    "title": "",
    "text": "good",
    "date": "2023-11-25T18:42:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "Hermoso juego para estresarse",
    "date": "2023-11-23T01:43:35",
    "rating": 5
  },
  {
    "title": "",
    "text": "Good time sink xD",
    "date": "2023-11-21T23:51:46",
    "rating": 5
  }
]