[
  {
    "title": "",
    "text": "love it",
    "date": "2025-05-27T20:13:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "It is the best game if you want a engaging fun challenging experience.",
    "date": "2025-05-21T06:16:58",
    "rating": 5
  },
  {
    "title": "",
    "text": "its good",
    "date": "2025-05-14T10:46:21",
    "rating": 5
  },
  {
    "title": "",
    "text": "Communication score is a joke. Zero words, always play assigned role to my best. Communication score keeps dropping without exploiting anything and doing decent in every game. Shitty, easily exploitable system made for lambs of modern era",
    "date": "2025-05-13T13:21:19",
    "rating": 1
  },
  {
    "title": "",
    "text": "very addictive play with caution your life my fall apart, you've been warned",
    "date": "2025-04-07T06:57:16",
    "rating": 1
  },
  {
    "title": "",
    "text": "Piece of Utter Trash I do not know how anyone enjoys this. I would rather be buried alive.",
    "date": "2025-04-06T22:53:33",
    "rating": 1
  },
  {
    "title": "",
    "text": "Ainda vou precisar de algumas horas a mais para poder avaliar corretamente...",
    "date": "2025-04-06T18:28:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "to many updates",
    "date": "2025-03-26T01:50:03",
    "rating": 5
  },
  {
    "title": "",
    "text": "A perfect game to \"come back to\". When every other game gets boring. You can allways come back for a round of Dota 2.",
    "date": "2025-03-17T13:48:40",
    "rating": 5
  },
  {
    "title": "",
    "text": "помойка",
    "date": "2025-03-14T18:54:50",
    "rating": 1
  },
  {
    "title": "",
    "text": "10 social credit scores out of 10\n10 new shtty maps out of 10\n10 dota to league of legends conversions out of 10\n10 -40% concurrent players in the past year after \"the patch\" out of 10",
    "date": "2025-03-12T20:51:23",
    "rating": 1
  },
  {
    "title": "",
    "text": "good",
    "date": "2025-03-11T03:41:26",
    "rating": 5
  },
  {
    "title": "",
    "text": "This is the game that i will probably play till my time on this earth expires",
    "date": "2025-03-08T04:10:46",
    "rating": 5
  },
  {
    "title": "",
    "text": "Shit",
    "date": "2025-03-01T15:45:30",
    "rating": 1
  },
  {
    "title": "",
    "text": "unbalanced\n\nPlay this game only if you hate yourself otherwise play League of Legends.",
    "date": "2025-03-01T00:10:34",
    "rating": 1
  },
  {
    "title": "",
    "text": "toxic, auto losses because trolls exist",
    "date": "2025-02-28T00:59:13",
    "rating": 1
  },
  {
    "title": "",
    "text": "FREE GAME",
    "date": "2025-02-25T11:54:55",
    "rating": 5
  },
  {
    "title": "",
    "text": "They try to make it more stupid and more stupid, now rivers, after that ocean.",
    "date": "2025-02-23T22:28:25",
    "rating": 1
  },
  {
    "title": "",
    "text": "love it\r\n",
    "date": "2025-02-20T03:19:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "I hear this game is played by nothing but nerds.\n\new.",
    "date": "2025-02-14T14:00:40",
    "rating": 1
  },
  {
    "title": "",
    "text": ">",
    "date": "2025-02-08T20:29:08",
    "rating": 5
  },
  {
    "title": "",
    "text": "Really a time killer thing, very dangerous",
    "date": "2025-02-07T23:22:07",
    "rating": 5
  },
  {
    "title": "",
    "text": "Good game.",
    "date": "2025-02-03T23:18:46",
    "rating": 5
  },
  {
    "title": "",
    "text": "love this game!!",
    "date": "2025-01-27T03:15:55",
    "rating": 5
  },
  {
    "title": "",
    "text": "Piece of trash game, horrible Toxic community \r\nNoobs every day \r\nworthless calipration",
    "date": "2025-01-23T06:24:20",
    "rating": 1
  },
  {
    "title": "",
    "text": "Heed with caution. Once you start there is no going back.",
    "date": "2024-12-31T17:55:04",
    "rating": 5
  },
  {
    "title": "",
    "text": "Not looking for a job, a chore or a masters degree. I want a hobby, a game, some fun. \r\n\r\nFine so some I'm sure but for me not interesting in dedicating an insane amount of time to a single game to keep current.\r\n\r\nIn spite of its playable rating for Steam deck, I'm not sure how. Not only does it seem to randomly change when it accepts face button inputs, the track pad doesnt work for the mouse as so many other similar interfaces would and you are contantly switching to touch screen but even that does not work intuitively as a mouse replacement in game.",
    "date": "2024-12-24T14:42:48",
    "rating": 1
  },
  {
    "title": "",
    "text": "WORST GAME EVER!",
    "date": "2024-12-16T17:47:49",
    "rating": 1
  },
  {
    "title": "",
    "text": "best of best!",
    "date": "2024-12-05T14:40:22",
    "rating": 5
  },
  {
    "title": "",
    "text": "Road to 1 mmr XD",
    "date": "2024-12-03T15:22:35",
    "rating": 5
  },
  {
    "title": "",
    "text": "Best game you suck at",
    "date": "2024-12-03T10:18:37",
    "rating": 5
  },
  {
    "title": "",
    "text": "ADSA",
    "date": "2024-12-02T20:06:49",
    "rating": 5
  },
  {
    "title": "",
    "text": "Wars Amazing. \nGG!",
    "date": "2024-12-01T00:54:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "i recently started playing the dota2 again.\nit is very fun. learning curve is steep, but not impossible. i'd say give the game a try if you left.\n",
    "date": "2024-11-28T19:18:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "more fun then LOL",
    "date": "2024-11-27T23:34:31",
    "rating": 5
  },
  {
    "title": "",
    "text": "Dota 2. Enough Said.",
    "date": "2024-11-23T14:47:14",
    "rating": 5
  },
  {
    "title": "",
    "text": "Don't do it",
    "date": "2024-11-20T10:53:42",
    "rating": 1
  },
  {
    "title": "",
    "text": "good",
    "date": "2024-11-12T19:34:19",
    "rating": 5
  },
  {
    "title": "",
    "text": "parasha\r\n",
    "date": "2024-11-10T07:10:58",
    "rating": 1
  },
  {
    "title": "",
    "text": "beste!",
    "date": "2024-10-26T10:17:31",
    "rating": 5
  },
  {
    "title": "",
    "text": "Frustrating, chaotic and causes all manner of distress.\r\nBretty goob",
    "date": "2024-10-01T08:25:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "I'd say it's pretty good",
    "date": "2024-09-21T04:05:15",
    "rating": 5
  },
  {
    "title": "",
    "text": "dotr",
    "date": "2024-09-10T01:46:54",
    "rating": 5
  },
  {
    "title": "",
    "text": "I love all cultures and respect all people",
    "date": "2024-09-07T04:27:48",
    "rating": 5
  },
  {
    "title": "",
    "text": "ty",
    "date": "2024-08-20T16:29:50",
    "rating": 5
  },
  {
    "title": "",
    "text": "Get in here!",
    "date": "2024-07-19T12:10:08",
    "rating": 5
  },
  {
    "title": "",
    "text": "Made me racist",
    "date": "2024-07-18T13:04:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "Classic\r\n",
    "date": "2024-07-14T21:21:05",
    "rating": 5
  },
  {
    "title": "",
    "text": "trash",
    "date": "2024-07-12T02:12:06",
    "rating": 5
  },
  {
    "title": "",
    "text": "Yes",
    "date": "2024-07-03T01:54:24",
    "rating": 5
  },
  {
    "title": "",
    "text": "Fun Game",
    "date": "2024-06-23T21:30:50",
    "rating": 5
  },
  {
    "title": "",
    "text": "10/10",
    "date": "2024-06-16T15:19:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "I use to play this game religiously for years.  I just recently stated playing again after a couple years gone.  I got punished for leaving a a game that was a stomp.  They put me in a low priority que.  I waited over 1 HOUR, and still no games.  That is not how you treat costumers you wanna keep.  No game should have wait times of even 10-15 min, let alone over an hour.  I will deleteing for good.  Good-bye!",
    "date": "2024-06-11T22:18:24",
    "rating": 1
  },
  {
    "title": "",
    "text": "I hate this game as much as it hates me",
    "date": "2024-06-05T20:16:18",
    "rating": 1
  },
  {
    "title": "",
    "text": "Toxic game full of nec*beards. Do not play this.\r\n10/10 would spend 5k hours on toxic game again",
    "date": "2024-06-04T00:12:25",
    "rating": 1
  },
  {
    "title": "",
    "text": "A lot of terrible people play this game.  The game itself is awesome and when you find good people to play with there is very few better experiences,",
    "date": "2024-06-02T18:29:06",
    "rating": 5
  },
  {
    "title": "",
    "text": "Ja não bastasse esse desequilibrio entre os herois, ainda fizeram esse novo sistema de escolher skill, dota ficou um lixo, desinstalei e não volto a jogar mais",
    "date": "2024-05-26T01:25:17",
    "rating": 1
  },
  {
    "title": "",
    "text": "I've been playing Dota 2 for 12 years now, off and on throughout my life it is one of the few constants. In high school, my friends and I spent many nights playing when there was only one courier. In college I played once or twice a year on my rented laptop from school. During the pandemic It was a way for my brothers and I to connect when we couldn't actually visit each other. It holds a great place in my life.\n\n[h3]The Good[/h3]\n- Gameplay is dynamic, engaging and rewarding once you get the hang of it. There are so many moving parts that when you make your first big play, there is very little that can match the feeling of satisfaction when played just right. \n- Flourishing Pro Scene: If you want to get better there are countless new and old pro players that stream or release content on Youtube to help you improve, and often times Discord chats to find players to play with.\n- Semi Consistent Updates: They just released one of the biggest updates the game has seen since Talents were released in 2016, or neutral items were released in 2019, or when they DOUBLED the size of the map in 2022. Valve isn't afraid to experiment with this game, and while you can get stuck on a single patch for a long time, you can always know that Valve Devs are working on something truly different to add.\n\n[h3]Negatives[/h3]\n- Mental Health: This is a team game. I love it for that, but playing with others can be frustrating and demoralizing. You can also find yourself \"chain queuing\" which after multiple losses can really effect your mood outside the game. My girlfriend and I have a rule that I cant start a game after 10pm because if i lose badly sometimes I will be too angry to fall asleep or talk before bed. You have to find these ways to look inward yourself, and without barriers it can really negatively impact you.\n- The Community: I said it a bit above, but if you're new to online games there is so much racism, sexism, anger etc. I've met really great people playing dota, but the brain tends to remember the bad eggs. Remember there is a mute button.\n- Communication from Valve: There can be crickets from valve sometimes. They ARE working on stuff, but if you read reddit to much you can get a bit riled for no reason.\n\nOverall, best game I've ever played by a long margin.",
    "date": "2024-05-24T23:56:03",
    "rating": 5
  },
  {
    "title": "",
    "text": "Great fun game if you've got friends and play around at lower ranks trying stuff out. However, this game has one of the most toxic fanbases in existence, second only to maybe LoL. If you intend on playing solo, do your sanity a favor and just avoid this game like the plague. You will be flamed, griefed, have slurs screamed at you, etc. if these players perceive even a microsecond of sub-optimal play.",
    "date": "2024-05-24T23:34:22",
    "rating": 1
  },
  {
    "title": "",
    "text": "yes.",
    "date": "2024-05-24T19:08:52",
    "rating": 5
  },
  {
    "title": "",
    "text": "i love this game, only issue i have with it is every update i have to either run a scan to fix things or reinstall which is the only quite annoying thing.",
    "date": "2024-05-24T17:26:00",
    "rating": 5
  },
  {
    "title": "",
    "text": "yea its pretty good",
    "date": "2024-05-24T00:11:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "I have played this game for 1,200+ hours.  I have a group of friends who only plays this game (they suck at all other games, which I am good at), so I am stuck playing it with them.  If you never played before, I would say stay away from this game.  It will suck the life out of your soul.  First of all even if you play exactly right, if your team is bad you will lose.  Games take around 40 minutes so its a huge time commitment.  Finally it is by far the most toxic community I have ever experienced in a video game.",
    "date": "2024-05-22T20:19:38",
    "rating": 1
  },
  {
    "title": "",
    "text": "broken matchmaking system",
    "date": "2024-05-19T17:05:57",
    "rating": 1
  },
  {
    "title": "",
    "text": "get good, then its fun... sometimes",
    "date": "2024-05-19T09:44:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "I really can't recommend this game any more. Match making is imbalanced now in every mode but all pick ranked, and the meta is so stale that if you do not group up as five you will lose the game. Toxicity has gotten to the worst point that I've seen in 10 years of Dota. It's sad how bad the US community for this game has gotten and how much Valve has abandoned this game.",
    "date": "2024-05-15T20:39:10",
    "rating": 1
  },
  {
    "title": "",
    "text": "always on the brink of uninstalling, but always down for another game",
    "date": "2024-05-01T13:16:15",
    "rating": 5
  },
  {
    "title": "",
    "text": "Ah, Dota 2, the game where toxicity flows like a never-ending river and the community is as welcoming as a pack of hungry wolves. Strap in, folks, because this rollercoaster of emotional distress is about to make you question your life choices.\n\nLet's start with the community, shall we? A lovely bunch, really, if your idea of lovely involves getting flamed for daring to pick a hero someone else wanted. And don't even get me started on the joy of encountering smurfs who stomp around like they own the place, leaving a trail of shattered dreams in their wake.\n\nBut wait, there's more! Ever wanted to experience the thrill of spending an hour in a match, only to have your hopes dashed by a single misstep? Congratulations, Dota 2 has got you covered. And let's not forget the joy of watching your teammates rage quit faster than you can say \"GG.\"\n\nAnd don't even think about trying to improve. Sure, you could watch tutorials, read guides, and practice till your fingers bleed, but why bother when you can just blame your losses on everyone else? It's the Dota 2 way!\n\nBut overall, despite the salt mines and the occasional dumpster fire of a match, I would still recommend this game. Because beneath all the toxicity lies a surprisingly addictive experience that somehow keeps you coming back for more punishment. So, if you're ready to dive headfirst into a cesspool of salt, frustration, and occasional glimpses of actual gameplay, welcome to Dota 2. Just remember to bring a hazmat suit and a healthy dose of sarcasm. You're gonna need it.",
    "date": "2024-04-27T17:20:22",
    "rating": 5
  },
  {
    "title": "",
    "text": "Came with the Valve Complete Pack when it wasn't free... \n\nEven these 2.7 hours were a complete waste of time. \nIt would have been a better value to buy Steam trading cards for the whole money.",
    "date": "2024-04-24T20:18:55",
    "rating": 1
  },
  {
    "title": "",
    "text": "fun with friends in customs or against bots but the community is way too toxic. you'd have more fun drinking poison than being screamed at by these addicts. cool game toxic community and no real way to circumvent that other than to go do literally anything else",
    "date": "2024-04-23T00:00:27",
    "rating": 1
  },
  {
    "title": "",
    "text": "demonic battlegrounds very fun",
    "date": "2024-04-22T04:37:08",
    "rating": 5
  },
  {
    "title": "",
    "text": "I played hero wars on WC3 custom mode for years. Dota took over in 2012 for me and it's the greatest game ever. The cost is your life, and few other games will make their way into your rotation of playable games - as Dota will always force itself open. But it's worth the cost. Free game no complaining",
    "date": "2024-04-19T15:16:34",
    "rating": 5
  },
  {
    "title": "",
    "text": "Techies fun",
    "date": "2024-03-28T20:57:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "super",
    "date": "2024-03-12T20:21:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "every hour is death and i will continue to die over and over again.\n",
    "date": "2024-03-12T04:00:37",
    "rating": 5
  },
  {
    "title": "",
    "text": "much better and developed than league of legends",
    "date": "2024-03-03T21:13:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "League of Legends but:\r\n\r\n1.    Too zoomed in so you can't see whats happening. \r\n2a.  Stuns and silences that last literally 6 - 8 seconds to remove all chance of counter-play.\r\n2b.  Because of this BKB is needed on 99% of all heroes, giving a few second window where you get to play.\r\n3.    Hero speed is much faster and the map is much bigger, combined with point 1 and its constant panning.\r\n4.    Jungle role is still not a thing, and the jungle is way less interesting.\r\n5.    Hero balance is non-existent. heroes hard counter each-other. Games are decided in hero select.\r\n6.    Somehow even a more toxic community.\r\n7.    Items are less diverse, and it seems the only way they can develop interesting ones is to give them all \r\n       active abilities, making the game a memory game of what item is in what hotkey slot.\r\n8.    Blink is still an expensive item you need to buy, forcing you to chose between mobility or power, making\r\n        it impossible to play a hero that needs a blink in a losing lane.",
    "date": "2024-03-02T01:00:02",
    "rating": 1
  },
  {
    "title": "",
    "text": "Its the best game ever, I have been playing it for like 20 years.",
    "date": "2024-02-09T00:31:17",
    "rating": 5
  },
  {
    "title": "",
    "text": "Great game for timepass",
    "date": "2024-02-06T10:01:04",
    "rating": 5
  },
  {
    "title": "",
    "text": "so toxic it rendered me immune to all other poisons",
    "date": "2024-02-05T01:09:26",
    "rating": 5
  },
  {
    "title": "",
    "text": "not worth it",
    "date": "2024-02-03T17:53:28",
    "rating": 1
  },
  {
    "title": "",
    "text": "the game imho is a very toxic and very time consuming. I dont recoommend to spend any time with this game",
    "date": "2024-01-27T19:38:05",
    "rating": 1
  },
  {
    "title": "",
    "text": "it is a good game but they are really strict with the bans and no really much of a freedom to express. but the game it self is a good game.",
    "date": "2024-01-24T18:57:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "What can I say? One of the best games EVER made <3",
    "date": "2024-01-23T14:34:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "The matches used to take a long time and that makes the learning curve steeper but it's a very deep fast paced game...  It's hard to find a better real time strategy game, the complexity, team dynamics, and high capacity for upset or turn around matches makes for good watching and great play.",
    "date": "2024-01-19T22:59:29",
    "rating": 5
  },
  {
    "title": "",
    "text": "no\ni'd rather my children get into recreational drugs than discover this game",
    "date": "2024-01-15T07:06:44",
    "rating": 1
  },
  {
    "title": "",
    "text": "Can't find any game better than this.",
    "date": "2024-01-13T18:57:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "is not recommended",
    "date": "2024-01-13T14:09:00",
    "rating": 1
  },
  {
    "title": "",
    "text": "inviting community tolerant of new players. simple gameplay (destroy the enemy ancient) produces a relaxed, euphoric, almost meditative state, perfect for enjoying the beautiful hero customizations (skins) as you wait to appear in your fountain.",
    "date": "2024-01-09T03:21:46",
    "rating": 5
  },
  {
    "title": "",
    "text": "The worst fucking MOBA",
    "date": "2024-01-05T17:24:20",
    "rating": 1
  },
  {
    "title": "",
    "text": "This is a new format of chess that both helps relieve stress and seriously raises it to a new level :D",
    "date": "2024-01-01T17:21:47",
    "rating": 5
  },
  {
    "title": "",
    "text": "One of the best games ever conceived. Every game is different from the diverse hero combinations to the special people you encounter along the way. And believe you me you will agree that there are a lot of special people playing Dota.",
    "date": "2024-01-01T14:53:18",
    "rating": 5
  },
  {
    "title": "",
    "text": "It is one of the best multiplayer games to date. This has gone thru serious tweak and game balancing.",
    "date": "2023-12-21T09:33:59",
    "rating": 5
  },
  {
    "title": "",
    "text": "Its not worth it. Trust me\n\n148 hours later, still not worth it.",
    "date": "2023-12-13T10:54:21",
    "rating": 5
  },
  {
    "title": "",
    "text": "good",
    "date": "2023-11-25T18:42:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "Hermoso juego para estresarse",
    "date": "2023-11-23T01:43:35",
    "rating": 5
  },
  {
    "title": "",
    "text": "Good time sink xD",
    "date": "2023-11-21T23:51:46",
    "rating": 5
  },
  {
    "title": "",
    "text": "ну и игрулька)))",
    "date": "2023-11-21T18:45:08",
    "rating": 5
  },
  {
    "title": "",
    "text": "I play it to relax",
    "date": "2023-11-07T21:47:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "best",
    "date": "2023-11-07T21:21:00",
    "rating": 5
  },
  {
    "title": "",
    "text": "league of legends but enjoyable\n",
    "date": "2023-10-30T22:48:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "russian man told me to kill myself\n",
    "date": "2023-10-28T10:12:52",
    "rating": 1
  },
  {
    "title": "",
    "text": "unquittable game you only take breaks from the game",
    "date": "2023-10-16T20:27:05",
    "rating": 5
  },
  {
    "title": "",
    "text": "814",
    "date": "2023-10-14T11:11:21",
    "rating": 5
  },
  {
    "title": "",
    "text": "maybe one of best ways in a century for group time killing",
    "date": "2023-10-01T05:57:48",
    "rating": 5
  },
  {
    "title": "",
    "text": "The heir to the OG best mod ever.",
    "date": "2023-09-30T15:05:32",
    "rating": 5
  },
  {
    "title": "",
    "text": "You will hate it but play it for 7000 hours",
    "date": "2023-09-16T05:31:41",
    "rating": 5
  },
  {
    "title": "",
    "text": "better than league of lesbians",
    "date": "2023-09-03T13:41:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "I love new updates. Way to go Valve!",
    "date": "2023-09-03T08:16:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "",
    "date": "2023-09-03T00:32:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "game is good",
    "date": "2023-09-01T15:04:53",
    "rating": 5
  },
  {
    "title": "",
    "text": "Don't bother with it.... \n\nif your not fast enough and and quick enough to get those lvl ups in JUST a few seconds of the match you are going to get destroyed EVERYTIME \n\nthis is main reason why i hate Mobas in the first place... i like to have plenty of time with RPGs which i have plenty of time to grind and lvl up\n\nthing is with MOBAs time... is something you don't have your either first in or your destroyed...\n\nif your not a fan of those odds stay away from this game and other Mobas like this...",
    "date": "2023-08-31T16:47:14",
    "rating": 1
  },
  {
    "title": "",
    "text": "This game is like Heroes of the Storm, in the aspect of, it's the same genre of game. Heroes of the Storm, despite being abandoned, is actually far more interesting and compelling than this is for a purely casual/fun gaming experience.",
    "date": "2023-08-11T17:31:11",
    "rating": 1
  },
  {
    "title": "",
    "text": "Game would be great but Volvo loves RNG, so if you are lucky you win...No skill needed..\n\nOh and if you play ranked make sure you download scripts and macros for mouse. It helps on the first 20min of the game; afterwards just right click and wait for the crit.\nDont worry about ban Volvo does not care as long as they got your money from skins.",
    "date": "2023-08-11T16:36:15",
    "rating": 1
  },
  {
    "title": "",
    "text": "the most trash game ever, dont even know why did i try to play it again with the most toxicity community ever",
    "date": "2023-08-08T16:29:14",
    "rating": 1
  },
  {
    "title": "",
    "text": "Game is good",
    "date": "2023-08-08T11:25:55",
    "rating": 5
  },
  {
    "title": "",
    "text": "No good compedium? No mother?",
    "date": "2023-07-25T12:58:08",
    "rating": 1
  },
  {
    "title": "",
    "text": ":O",
    "date": "2023-07-10T00:48:10",
    "rating": 5
  },
  {
    "title": "",
    "text": "Except for kowtowing to china by changing skeleton king to wraith king, this is a good MOBA.\n\nI've played DOTA since before 2005.  This maintains most of the spirit of the original.\n\nThere is not enough emphasis on backdoor and map control strategy.   Developers seem to be trying to emulate League of Legends in this regard.  Which I believe is a step backwards.\n\nStill, this is a great game and you should play .",
    "date": "2023-07-08T02:11:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "Fun game",
    "date": "2023-07-02T17:44:17",
    "rating": 5
  },
  {
    "title": "",
    "text": "Good game to play takes time to learn the way comps are compared to league but rewarding experience when you do can fully enjoy the game after that.",
    "date": "2023-07-01T01:58:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "It will take over your life and is more addictive than meth.",
    "date": "2023-06-24T11:58:41",
    "rating": 1
  },
  {
    "title": "",
    "text": "Pros\n - Fun as hell\n - Great design\n - Satisfying af\n - Constantly updated\n\nCons\n - Online toxicity\n - Steep learning curve\n - Consumes your life",
    "date": "2023-06-19T12:58:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "Charge. Die. Repeat.",
    "date": "2023-05-23T23:06:29",
    "rating": 5
  },
  {
    "title": "",
    "text": "Most serious Moba out there, great updates and events all along",
    "date": "2023-05-19T18:11:40",
    "rating": 5
  },
  {
    "title": "",
    "text": ">:D",
    "date": "2023-05-16T23:56:42",
    "rating": 5
  },
  {
    "title": "",
    "text": "This game is an absolute delight to play. With its engaging multiplayer mode, you and your friends are sure to have a great time. I found myself repeatedly coming back to play, even after taking breaks from it. The replayability factor of this game is impressive, as it keeps you engaged and wanting to play more. Overall, I highly recommend this game to anyone looking for a fun and exciting gaming experience.",
    "date": "2023-05-14T03:59:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "The most recent patch (New\nFrontiers) has completely changed how the game plays. Whilst I appreciate that the devs are trying to keep it fresh and exciting the game doesn’t feel like Dota to me and I’ve lost all interest in playing.\n\nIf there was the possibility to include a classic mode with a previous version I would love to jump back in again.",
    "date": "2023-05-11T13:54:38",
    "rating": 1
  },
  {
    "title": "",
    "text": "Good game, but the toxic community, absurdly long games, and the ability to be fountain camped for hours really ruins the experience for anyone not already invested into it.",
    "date": "2023-05-02T04:08:06",
    "rating": 1
  },
  {
    "title": "",
    "text": "Fenomenal",
    "date": "2023-04-30T16:56:00",
    "rating": 5
  },
  {
    "title": "",
    "text": "Game is in the best place its ever been in. Never a better time to start!",
    "date": "2023-04-26T17:31:32",
    "rating": 5
  },
  {
    "title": "",
    "text": "After patch 7.33 game is unplayable on my pc with win 11.  It either stays on updating or it crashes and i get abandon and low prio.  thx valve",
    "date": "2023-04-26T15:49:51",
    "rating": 1
  },
  {
    "title": "",
    "text": "Apparently it's gone from friendly and fun to toxic and terrible. Stay away, pure and simple. I might have written a better review but no, a toxic group of players are not worth anyone's time.",
    "date": "2023-04-24T10:30:02",
    "rating": 1
  },
  {
    "title": "",
    "text": "very bad last update, killed the game",
    "date": "2023-04-22T17:45:30",
    "rating": 1
  },
  {
    "title": "",
    "text": "They make knee jerk nerfs to characters if they dominate games even though they are easily countered, and then after years of continuous nerfs they completely take that characters identity away, i stopped playing when that happened.",
    "date": "2023-04-22T14:34:30",
    "rating": 1
  },
  {
    "title": "",
    "text": "The new patch is horrrrrrrrrrrible!!! makes the map way too busy and adds too many redundant resources like observers and ways to teleport.",
    "date": "2023-04-21T01:09:56",
    "rating": 1
  },
  {
    "title": "",
    "text": "dogshit game will ruin ur mental health",
    "date": "2023-04-14T22:18:05",
    "rating": 1
  },
  {
    "title": "",
    "text": "good game",
    "date": "2023-04-14T13:57:51",
    "rating": 5
  },
  {
    "title": "",
    "text": "I've hardly ever played or tried the game, but recently I thought it may be fun to give it a shot. \n\nThis game is pure unadulterated dog shit, it's a terrible new player experience, coated with an over-abundance of gimmicky abilities and crowd control. It's like if you let a group of 12 year old's develop a competitive MOBA title.\n\nThe extreme level of different abilities and vast power-spikes can turn a fun and engaging early game experience into a god awful immune to literally everything Slark one-shotting your entire team EVEN if they're fed.\n\nDOTA just simply does not hold up with the level of competitive integrity that other similar titles offer. The overpowered, overloaded, over-the-top skills quickly get old as you're constantly left scratching your head after the 5th team of people that all speak different languages after waiting 40 minutes to finally get a good match where someone doesn't abandon and waste all your time.\n\nThe game is not salvageable it will die. Inevitably. In the very least at least some small places in the world will keep the player count around 200k~ for a while, though once all the old folks get tired of it.. That's it. \nR.I.P DOTA\n\nI gave it a shot, it's just not worth the stress LMAO",
    "date": "2023-04-12T10:20:42",
    "rating": 1
  },
  {
    "title": "",
    "text": "⠄⠂⠄⠐⠄⠄⠄⠄⠄⢀⣠⣶⣶⣿⣿⣿⣷⣶⣶⣤⣀⡀⠄⠄⠄⠄⠄⠄⠂⠄⠐⠄⠄⠂⠄⠐\n⠄⠐⠈⠄⠄⠄⠄⣀⣴⣿⣿⣿⣿⣿⢿⣿⢿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠄⠄⠄⠄⠁⢀⠈⠄⠈⠄\n⠐⠄⠄⠄⠄⢀⣴⣿⣿⡿⣿⢽⣾⣽⢿⣺⡯⣷⣻⣽⣻⣟⣿⣿⣿⣿⣦⡀⠄⠄⠄⠄⡀⠐⠈⠄\n⠄⠄⠄⠄⢀⣾⣿⣿⢿⡽⡯⣿⢾⣟⣿⣳⢿⡽⣾⣺⣳⣻⣺⣽⣻⡿⣿⣿⣦⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⣿⣿⣿⣯⢿⣽⣻⣽⣿⣿⣯⣿⣿⣿⣷⣻⢮⣗⡯⣞⡾⡹⡵⣻⣿⣇⠄⠄⠄⠂⠄⠄\n⠄⠄⠄⣸⣿⣿⣿⣿⡿⡾⣳⢿⢿⢿⠿⠿⠟⠟⠟⠿⣯⡾⣝⣗⣯⢪⢎⢗⣯⣿⣇⠄⠄⠄⠄⢀\n⠄⠄⠄⠋⠉⠁⠑⠁⢉⣁⡁⠁⠁⠄⠄⠄⠄⠄⠄⠄⢉⢻⢽⣞⢾⣕⢕⢝⢎⣿⣿⡀⠄⠄⠄⠄\n⠄⠄⠄⡧⠠⡀⠐⠂⣸⣿⢿⢔⢔⢤⢈⠡⡱⣩⢤⢴⣞⣾⣽⢾⣽⣺⡕⡕⡕⡽⣿⣿⠟⢶⠄⠄\n⠄⠄⠄⣿⡳⡄⡢⡂⣿⣿⢯⣫⢗⣽⣳⡣⣗⢯⣟⣿⣿⢿⡽⣳⢗⡷⣻⡎⢎⢎⣿⡇⠻⣦⠃⠄\n⠄⠄⠄⡿⡝⡜⣜⣬⣿⣿⣿⣷⣯⢺⠻⡻⣜⢔⠡⢓⢝⢕⢏⢗⢏⢯⡳⡝⡸⡸⣸⣧⡀⣹⣠⠄\n⠄⠄⠄⣇⢪⢎⡧⡛⠛⠋⠋⠉⠙⣨⣮⣦⢅⡃⠇⡕⡌⡪⡨⢸⢨⢣⠫⡨⢪⢸⠰⣿⣇⣾⡞⠄\n⠄⠄⠄⢑⡕⡵⡻⣕⠄⠄⠄⠔⡜⡗⡟⣟⢿⢮⢆⡑⢕⣕⢎⢮⡪⡎⡪⡐⢅⢇⢣⠹⡛⣿⡅⠄\n⠄⠄⠄⢸⢎⠪⡊⣄⣰⣰⣵⣕⣮⣢⣳⡸⡨⠪⡨⠂⠄⠑⢏⠗⢍⠪⡢⢣⢃⠪⡂⣹⣽⣿⣷⡄\n⠄⠄⠄⡸⠐⠝⠋⠃⠡⡕⠬⠎⠬⠩⠱⢙⣘⣑⣁⡈⠄⠄⡕⢌⢊⢪⠸⡘⡜⢌⠢⣸⣾⢿⣿⣿\n⠄⠄⠄⡎⣐⠲⢒⢚⢛⢛⢛⢛⠛⠝⡋⡫⢉⠪⡱⠡⠄⠠⢣⢑⠱⡨⡊⡎⢜⢐⠅⢼⡾⣟⣿⣿\n⠄⠄⣠⡃⡢⠨⢀⢂⢐⢐⢄⠑⠌⢌⢂⠢⠡⡑⡘⢌⠠⡘⡌⢎⠜⡌⢎⠜⡌⠢⠨⡸⣿⡽⣿⣿\n⢴⠋⠁⡢⡑⡨⢐⢐⢌⠢⣂⢣⠩⡂⡢⡑⡑⡌⢜⠰⡨⢪⢘⠔⡱⢘⠔⡑⠨⢈⠐⢼⡷⣿⣻⢷\n⠂⠄⠄⡢⡃⡢⢊⢔⢢⠣⡪⡢⢣⠪⡢⡑⡕⡜⡜⡌⢎⢢⠱⠨⡂⡑⠨⠄⠁⡂⡨⣺⡽⡯⡫⠣\n⠄⠄⣰⡸⠐⠌⠆⢇⠎⡎⢎⢎⢎⢎⢎⢎⠎⡎⡪⠘⠌⠂⠁⠁⠄⢀⠄⢄⢢⢚⢮⢏⠞⡨⢂⠕\n⡀⢀⡯⡃⡌⠈⠈⠄⠄⠈⠄⠄⠄⠄⠄⠂⠁⠄⠄⠄⠄⠄⠄⢄⢂⢢⢱⢱⢱⠱⢡⢑⠌⢂⠡⠠\n⣀⡸⠨⢂⠌⡊⢄⢂⠠⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⠠⢐⢨⣘⢔⢵⠱⡃⡃⡕⡸⠐⡁⠌⡐⡨⠨\n⢣⢎⠨⠄⠄⠨⢊⢪⢪⡫⡪⡊⡐⡐⡐⡌⡬⡪⡪⣎⢗⡕⡎⡣⠃⢅⠊⠆⠡⠠⡁⠢⡑⡐⢌⢌\n⡎⡎⠄⠈⠄⠡⢂⠂⡕⡕⡕⠕⢌⢌⢢⢱⢸⡸⣪⢮⡣⡓⠌⠠⢑⠡⢈⠌⢌⢂⠪⠨⡂⣊⠢⡢\n⢢⢣⠊⢀⠨⠨⢐⠐⡸⡸⡪⡱⡑⡌⡆⡇⡇⣏⢮⢪⢪⠊⠄⢑⢐⠨⡐⢌⠢⡪⡘⢌⠢⡢⢣⠪\n⡣⡑⢅⠄⠄⠨⢐⠨⢰⢱⢣⢣⢪⢸⢨⡚⣞⢜⢎⢎⢎⠪⠐⠄⡆⡣⡪⡊⡪⡂⡪⡘⡌⡎⠊⠄\n⡣⠊⠄⣷⣄⠄⠄⠌⢸⢸⠱⡱⡡⡣⡣⡳⡕⡇⡇⡇⠥⠑⠄⢡⢑⠕⢔⢑⠔⡌⡆⠇⠁⡀⠄⠁",
    "date": "2023-03-13T14:25:22",
    "rating": 5
  },
  {
    "title": "",
    "text": "Why shuold solo players play against and with party? There is at least one arg? Therefore almost all games are toxic piece of shit",
    "date": "2023-03-11T10:11:18",
    "rating": 1
  },
  {
    "title": "",
    "text": "Game is totally unplayable under Linux. It hangs after every match (hang whole system with noise in headphones).",
    "date": "2023-03-06T02:44:52",
    "rating": 1
  },
  {
    "title": "",
    "text": "Before I played this, I had a small wee wee, no girlfriend and absolutely no will to live. None of these things have changed, but the game is pretty good.",
    "date": "2023-03-06T01:41:27",
    "rating": 5
  },
  {
    "title": "",
    "text": "Super shitty match making system, supertoxic at all levels.",
    "date": "2023-02-11T00:25:12",
    "rating": 1
  },
  {
    "title": "",
    "text": "Love the game, extremely complex but worth spending the time to learn and partake in the game. Valve have done a great job of adding some extras to the game: queuing, demo, viewing etc, that make it even better!",
    "date": "2023-02-08T12:02:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "Can i get my 2775 hours back?",
    "date": "2023-01-29T22:21:49",
    "rating": 1
  },
  {
    "title": "",
    "text": "My hours in this game speak for itself",
    "date": "2023-01-28T17:52:53",
    "rating": 5
  },
  {
    "title": "",
    "text": "Today Dota 2 has become the empty shell of its formal existence. Balance only exist in the form of IMBA and \"balance in imbalance\", micro-transactions and season pass are rampant, and individual player quality seriously lacking. MOBA game has run its course, now it need to end.",
    "date": "2023-01-21T13:15:31",
    "rating": 1
  },
  {
    "title": "",
    "text": "Highly recommend. fun strategic game",
    "date": "2023-01-15T03:15:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "Если играешь УМОМ, смотришь свои реплеи и любишь стратегии + экшн, то игра достойная, если не учитывать забавные баги в каждом патче (Дота 2 Бета же, KEKW). Если играешь по фану (пожалуйста, в РЕЙТИНГ НЕ ЗАХОДИ), то и по фану можно. И можно сказать, что ранговая система херня, и тут спорно. Главное, на тиммейтов не вали свои фейлы, будь ВЫШЕ, you know, а не если играешь уево, то у тебя все виноваты, у меня есть такие знакомые в т ч (лучше посмотри реплеи и гайды)\n\nP.S. наиграл 2-2.5к часов ещё до того, как добавили таланты, было весело\nP.P.S дружелюбие выигрывает игры",
    "date": "2023-01-11T13:22:50",
    "rating": 5
  },
  {
    "title": "",
    "text": "NO",
    "date": "2023-01-05T15:31:25",
    "rating": 1
  },
  {
    "title": "",
    "text": "I once was told by a friend to \"check out this multiplayer game\" 8 years later I still suck and so does everyone else. By all means \"check it out\".",
    "date": "2023-01-03T19:49:14",
    "rating": 5
  },
  {
    "title": "",
    "text": "a",
    "date": "2023-01-01T03:13:24",
    "rating": 5
  },
  {
    "title": "",
    "text": "Game is great and continues to entertain me even after 9yrs.. \n\nTo me it was always DOTA2 the best MOBA type game..",
    "date": "2022-12-31T12:45:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "mush game",
    "date": "2022-12-28T08:15:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "too addicting!",
    "date": "2022-12-23T21:54:59",
    "rating": 5
  },
  {
    "title": "",
    "text": "The only game to make me feel something again.",
    "date": "2022-11-30T23:04:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "60% of the time, it works every time!",
    "date": "2022-11-29T21:02:22",
    "rating": 5
  },
  {
    "title": "",
    "text": "7.33 (15.16):\n\nThere is a lot to say about this update. If you had changed the algorithms and map  that much, (more over, the map that made Dota \"DOTA\"), could have named this Dota3. If you say \"no, we want to apply this to Dota2\", then show respect the classic, and give players the option to play as a classic map or a modern map. So you keep your two player pools in your hands. If the Classics needed change, they wouldn't be called classics anyway.\n\n#rollbackDOTA2",
    "date": "2022-11-22T22:05:55",
    "rating": 1
  },
  {
    "title": "",
    "text": "The one MOBA to rule them all. But be warned, this game is a jealous lover and will take most of your gaming time.",
    "date": "2022-11-19T05:07:14",
    "rating": 5
  },
  {
    "title": "",
    "text": "Its ok",
    "date": "2022-11-12T22:46:05",
    "rating": 5
  },
  {
    "title": "",
    "text": "The matchmaking will enrage you. You can have a long strings of losses and the game will not adjust itself. If you are bad at farming there is no way to make up for it. Why is there no mod where all players get the same exact income and it is only a matter of how well you cast your skills. Players remain toxic even if you explain why you built your inventory in a particular way given your circumstances, which is world issue not a game issue, but still. The game could be addictive even if you are losing.",
    "date": "2022-11-11T02:27:52",
    "rating": 1
  },
  {
    "title": "",
    "text": "This game has ruined my life, 10/10",
    "date": "2022-11-07T14:31:12",
    "rating": 1
  },
  {
    "title": "",
    "text": "Hey, \nThe new update DOTA 2 leads to a reboot game when I am playing. Do you have any issues too?",
    "date": "2022-11-06T21:43:26",
    "rating": 5
  },
  {
    "title": "",
    "text": "wack",
    "date": "2022-11-02T23:08:12",
    "rating": 1
  },
  {
    "title": "",
    "text": "Nothing compares",
    "date": "2022-10-31T23:25:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "Даже не заходите в эту помойку!",
    "date": "2022-10-29T18:26:34",
    "rating": 1
  },
  {
    "title": "",
    "text": "I didn't link it. I know I put 6,021 hours in it but I still dont like it.",
    "date": "2022-10-27T18:04:44",
    "rating": 1
  },
  {
    "title": "",
    "text": "Fun! Fun!",
    "date": "2022-10-27T00:04:40",
    "rating": 5
  },
  {
    "title": "",
    "text": "No, don't do it. It's damn awful",
    "date": "2022-10-26T21:01:20",
    "rating": 1
  },
  {
    "title": "",
    "text": "matching make is a shit dota is a game made for you that play alone to suffer and get angry.",
    "date": "2022-10-23T20:28:15",
    "rating": 1
  },
  {
    "title": "",
    "text": "DRAIN ALL MY LIFE AWAY.",
    "date": "2022-10-22T00:01:24",
    "rating": 5
  },
  {
    "title": "",
    "text": "Too addictive.",
    "date": "2022-10-20T21:30:47",
    "rating": 1
  },
  {
    "title": "",
    "text": "Рекомендую доту 2, если вам не куда потратить время из своей жизни )))",
    "date": "2022-10-20T16:02:59",
    "rating": 5
  },
  {
    "title": "",
    "text": "toxic community",
    "date": "2022-10-09T01:26:40",
    "rating": 1
  },
  {
    "title": "",
    "text": "Incredible depth and nuance with high skill ceilings and the most integrated and expansive client of any moba.   The game feels very premium outside of annoying bugs in the game viewer. \n\nThe community also has a high skill level (creating a pretty high skill floor) which can make even unranked games overwhelming for new players.\n\nIf you can make it through the steep learning curve you will experience a tactical moba far beyond the rest of the field.\n\nI recommend turning on anonymous mode when starting out to mute other players, the community is toxic and obnoxious towards new players.",
    "date": "2022-09-27T22:48:51",
    "rating": 5
  },
  {
    "title": "",
    "text": "This is Dota. From the original Warcraft3. Its awesome, others try to emulate but fail. All that being said there are times when I hate all the nerfing being done to some of the more awesome characters. \nExample, when Baranthum charges he should hit you and you should bounce across the lane and it should cause you to loose half your life early game. Zeus early game should be a hugely annoying with wrath. Some heros should be OP if played well. but its up to the player to know how to counter the play or strat. When Dota2 first came out heros were played as is for several years till player could have their say.. on what they thought was OP and not. then nerfing began. ZZZzzzz.... and the similarity to LOL also began. (except for the big round heads)",
    "date": "2022-09-25T11:08:10",
    "rating": 5
  },
  {
    "title": "",
    "text": "A great game with some awesome synergies and mechanics, but with the most toxic community in any game ever.\n",
    "date": "2022-09-24T11:13:49",
    "rating": 5
  },
  {
    "title": "",
    "text": "It's got a pretty high learning curve, but the game is pretty good about showing you what to do.\n\nThe game is super frustrating until you learn it well enough to multi-task.\n\nAll in all, I like it for the challenge.",
    "date": "2022-09-20T21:08:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "game has hackers still + you need dota plus to rank up smoothly, plus servers are shit, you got diss in game so much, just do anything else, it will be better than this shit\n\nUpdate: Super buggy game, you'll get diss or an error while in game and can't even reconnect, play something else or go for turbo mode only\n\nAlso as a typical volvo game players are worthless shits",
    "date": "2022-09-11T20:04:13",
    "rating": 1
  },
  {
    "title": "",
    "text": "ITS GOOD",
    "date": "2022-09-08T19:52:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "Player culture is super shitty in this game lately, people wont end the game when they are lightyears ahead of your team and enjoy wasting your time, dont feel bad to leave when people are trolling cause its not worth playing out when you could save 20 minutes of your precious  life. 1/50 games actually have players who respect themselves and others. Spoon man mini game is trash",
    "date": "2022-09-03T05:16:25",
    "rating": 1
  },
  {
    "title": "",
    "text": "nice game",
    "date": "2022-09-03T03:22:02",
    "rating": 5
  },
  {
    "title": "",
    "text": "if you wanna get fucked by your own team throwing or the other team bashing your bum hole in weekly would recommend.  10/10",
    "date": "2022-09-02T19:00:28",
    "rating": 5
  },
  {
    "title": "",
    "text": "love it",
    "date": "2022-09-01T21:05:57",
    "rating": 5
  },
  {
    "title": "",
    "text": "DoTA = toxicity. Need i say more? EDIT: Still toxic af\nArcade is super fun tho! EDIT: Arcade is still super fun\nEDIT: They've fixed ranked some, added better battle passes. Still toxic af in 2024.  But long live DoTA.\nSame toxicity in 2025.",
    "date": "2022-08-30T04:42:43",
    "rating": 1
  },
  {
    "title": "",
    "text": "My friends and I wasted more than one hour dealing with the trash system and non-sense errors. I keep getting erroneous messages that prevents me from create a game unless I restarted the game. And my friends were having trouble to log in and sync the game despite tried everything we could.",
    "date": "2022-08-20T10:46:13",
    "rating": 1
  },
  {
    "title": "",
    "text": "its good",
    "date": "2022-08-18T12:56:03",
    "rating": 5
  },
  {
    "title": "",
    "text": "The only other game I've had such a problem abandoning is Starcraft, and I suspect that this is just filling the void that Starcraft left.  Also, it's easier for an old to only manage one character at a time.  \n\nThis game is a little like Eve, in that the only winning play is to quit.  Don't play it.",
    "date": "2022-08-13T02:21:53",
    "rating": 5
  },
  {
    "title": "",
    "text": "Fun!",
    "date": "2022-08-12T16:31:29",
    "rating": 5
  },
  {
    "title": "",
    "text": "shit",
    "date": "2022-07-27T11:19:15",
    "rating": 1
  },
  {
    "title": "",
    "text": "Left LoL after finding this game around 1 year into playing league with friends in highschool(about 2014). I loved Dota right off the bat, the first thing that stuck out to me was that nothing except cosmetics can be bought or unlocked.\n\nMy League friends unfortunately never got it. I had to keep playing League with them, they refused to give the game more than a few hours each. Crushed me, still bitter about that to this day.\n\nMy love for Dota turned into a total obsession. I learned as much as I could, and played whenever I had the time. I was so inspired by Fear and Dendi's stories in Free to Play, I wanted to go the distance myself. I saw Dota as the one path for me to turn my boundless enthusiasm for strategy games into freedom from jobs I didn't love and a place I didn't want to live. The one rope I could use to pull upward into the future I wanted for myself. Of course, I decided to become a professional Dota player. \n\nThis wasn't meant to be.\n\nI was working as a busboy at the time and would work my shift and come home at night and play, then work again without any significant breaks. I would go 24-48hrs without sleep regularly to play as much Dota as I could without missing any work. Went to 1 LAN and placed 2nd, that was one of my favorite experiences in my life. Also met people from all over the world and learned words(mostly curses heh) from languages I would have otherwise never encountered, got to practice my Spanish a bit too. I grew so much as a person from the interactions I had in Dota. It shaped me.\n\nDespite my extreme(and overzealous and counterproductive in retrospect) dedication I never got above 3.6k MMR. What happened instead was that I ended up in the mental hospital from playing between 5 and 22 ranked matches a day and not sleeping on top of working my full time job bussing tables(which I worked as hard as I could at as well). When I got to the hospital I was 135lbs(I am 5'11\") and hadn't eaten or slept for 6 days, and was in full blown manic psychosis. Maybe if I had been provided for and fully supported during this time(and born without bipolar disorder) by my parents, I could have done it. We'll never know, but that's what happened. What I did was the epitome of the adage: \"burning the candle from both ends\". I flew too close to the sun and crashed and burned in the flames of psychosis and malnutrition. \n\nIt's been almost 6 years since that episode of mania. Don't worry guys, I'm fine now, I sleep and eat every single day and have never had a recurrence of mania. I use medication to stabilize my mood whenever that pattern fails. Although I still enjoy the game a lot, I really only play turbo on and off since that's what I have time for. Gone are the dreams.\n\nI know I spent a lot of time on this game, and I will regret somewhat my failure to become pro for the rest of my life. At one point it was everything to me. I lived, breathed, and dreamed it. That said, I look back on all that time with nostalgia and fondness. This is a game that will one way or another leave an impression on the rest of your life. You will either give up at less than 50 hours, or you will never forget it. \n\nHow can I not recommend that?\nIt's a masterpiece.\n\nP.S. \nHere's my dotabuff if you want to see my schedule during that breaking point: https://www.dotabuff.com/players/34646363/activity",
    "date": "2022-07-15T00:45:02",
    "rating": 5
  },
  {
    "title": "",
    "text": "Best game ever. Too hard to get in to.",
    "date": "2022-07-08T03:27:21",
    "rating": 1
  },
  {
    "title": "",
    "text": "It's great.  Just ask Dendi",
    "date": "2022-06-20T21:27:05",
    "rating": 5
  },
  {
    "title": "",
    "text": "Endless combination of heroes both allied and enemy teams.",
    "date": "2022-06-19T14:11:22",
    "rating": 1
  },
  {
    "title": "",
    "text": "if you have not started, just do not start, it's a trap))",
    "date": "2022-06-17T18:15:54",
    "rating": 1
  },
  {
    "title": "",
    "text": "don't play so we dont get more shit people",
    "date": "2022-06-15T01:19:26",
    "rating": 1
  },
  {
    "title": "",
    "text": "Although this game is free and it's pretty fun, you're gonna be shelling out a type of currency you'll never get back, TIME. If you're prepared to give literal years of your life to play this game, more power to you, but shit man, take it from a guy that spent over 10k hours playing this shit, it ain't worth it.",
    "date": "2022-06-11T22:59:54",
    "rating": 1
  },
  {
    "title": "",
    "text": "Over 3,000 hours. That can't be healthy.",
    "date": "2022-06-11T00:04:25",
    "rating": 5
  },
  {
    "title": "",
    "text": "Best game out there. Easy to learn and practice.",
    "date": "2022-06-03T13:30:25",
    "rating": 5
  },
  {
    "title": "",
    "text": "if you want to lose a part of your soul, this game is for you. it's a love hate relationship.",
    "date": "2022-05-25T13:58:01",
    "rating": 5
  },
  {
    "title": "",
    "text": "I have been playing DOTA since it came out in Warcraft 3. I can say this is enjoyable at any level of skill. There is a lot to learn but there is a pretty good tutorial around that. A massive selection of heroes add difference to each match.\n\n",
    "date": "2022-05-24T09:55:58",
    "rating": 5
  },
  {
    "title": "",
    "text": "Fun",
    "date": "2022-05-23T07:14:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "do not recommend.",
    "date": "2022-05-22T11:49:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "be kind to your teammates, only babies blame their team",
    "date": "2022-05-11T05:28:59",
    "rating": 5
  },
  {
    "title": "",
    "text": "almost 4k hours played, still suck",
    "date": "2022-01-09T02:43:53",
    "rating": 5
  },
  {
    "title": "",
    "text": "Absolutely 100 percent pure dogshit",
    "date": "2021-12-31T15:31:53",
    "rating": 1
  },
  {
    "title": "",
    "text": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☑ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
    "date": "2021-01-08T00:07:18",
    "rating": 5
  },
  {
    "title": "",
    "text": "its a shity game",
    "date": "2020-09-07T12:05:14",
    "rating": 1
  },
  {
    "title": "",
    "text": "this game is legit rigged.\n\ndo not buy double downs, if u have any in inventory game will put a feeder or a pos 3 sniper or other dumb shit on your team. matchmaking is fucking stupid.\n\nalso stop letting fucking mexicans ruin the us servers its annoying as fuck.",
    "date": "2020-03-22T15:16:14",
    "rating": 1
  },
  {
    "title": "",
    "text": "-It's free because the moment you install the game, the 2FA memory leak your email and phone number to the dark web with this new rubbish steam UI. please observe the timestamp correlation between:\n-dota installation \n-Massive amount of the fishing email influx\n-massive amount of SMS with fishing web link\n\nThis new Steam UI is so Rubbish, I made the decision to uninstall this 23 year old steam library and forget about it. I Just can't stand this new steam UI, Way to buggy for 2023 standard and it look terrible on a 1920x1080 by the way (Probably not tested at the shop).\n\nYou lost me kids",
    "date": "2020-03-21T01:27:24",
    "rating": 1
  },
  {
    "title": "",
    "text": "meh",
    "date": "2020-02-19T19:14:13",
    "rating": 1
  },
  {
    "title": "",
    "text": "Nobody around me who plays this game happy..people who are super nice in their everyday life becomes raging monsters while playing this game. Stop this madness",
    "date": "2019-12-06T14:42:06",
    "rating": 1
  },
  {
    "title": "",
    "text": "Likes-\nGood way to make friends, recently went to uni DOTA is a great way to meet people of similar interests.\nInfinite skill ceiling always something new to learn.\nOnce you can deal with the flame from your team/enemy you will be able to weather the hardest storms.",
    "date": "2019-11-26T16:09:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "Tired of daily damn updates.",
    "date": "2019-09-20T19:39:52",
    "rating": 1
  },
  {
    "title": "",
    "text": "Good gamu",
    "date": "2019-07-04T15:17:41",
    "rating": 5
  },
  {
    "title": "",
    "text": "i hate this game",
    "date": "2018-07-14T11:17:15",
    "rating": 5
  },
  {
    "title": "",
    "text": "If you've got a time machine this game was great about 4+ years ago. Now it's full of the most toxic community imaginable and all valve has done to combat it is maximise it for profits. Everything is everyone else's fault and abuse of any and everything is around every corner.",
    "date": "2017-11-18T04:49:23",
    "rating": 1
  },
  {
    "title": "",
    "text": "Would play again",
    "date": "2017-09-23T05:59:48",
    "rating": 5
  },
  {
    "title": "",
    "text": "I like it LMAO",
    "date": "2017-03-01T00:42:22",
    "rating": 5
  },
  {
    "title": "",
    "text": "uuu",
    "date": "2017-03-01T00:33:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "i recommend some people who can play well. and i donot like does people doing some trashtalks for me thats not good",
    "date": "2017-03-01T00:20:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "played it a bit. learnt colorful words from several languages. \n11/10 would trashtalk again",
    "date": "2017-03-01T00:11:55",
    "rating": 5
  },
  {
    "title": "",
    "text": "dota 2 is a good game. i've been playing for 3 years. but some trash on latest updates must be seriously foccused on. specially during events on this game. some updates just sucks. but dota is still the best for me.",
    "date": "2017-03-01T00:08:51",
    "rating": 5
  },
  {
    "title": "",
    "text": "Nice Game\n",
    "date": "2017-03-01T00:04:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "Great game indeed. :)",
    "date": "2017-02-28T23:20:26",
    "rating": 5
  },
  {
    "title": "",
    "text": "What a greats game!!",
    "date": "2017-02-28T23:17:54",
    "rating": 5
  },
  {
    "title": "",
    "text": "im pro here",
    "date": "2017-02-28T23:15:48",
    "rating": 5
  },
  {
    "title": "",
    "text": "Nice MOBA game EVER !",
    "date": "2017-02-28T22:57:11",
    "rating": 5
  },
  {
    "title": "",
    "text": "Couldnt find a better game",
    "date": "2017-02-28T22:53:42",
    "rating": 5
  },
  {
    "title": "",
    "text": "Good game.\nToxic playerbase.",
    "date": "2017-02-28T22:33:51",
    "rating": 5
  },
  {
    "title": "",
    "text": "really addictive and good",
    "date": "2017-02-28T22:18:11",
    "rating": 5
  },
  {
    "title": "",
    "text": ".",
    "date": "2017-02-28T22:13:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "Nice Game GG!",
    "date": "2017-02-28T22:06:58",
    "rating": 5
  },
  {
    "title": "",
    "text": "Hours and i still have no clue how to play.",
    "date": "2017-02-28T22:06:11",
    "rating": 1
  },
  {
    "title": "",
    "text": "Better than League.",
    "date": "2017-02-28T21:37:50",
    "rating": 5
  },
  {
    "title": "",
    "text": "Should be a warning lable for addiction...\n\n\nBut seriously... its a good game",
    "date": "2017-02-28T21:35:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "A",
    "date": "2017-02-28T21:17:14",
    "rating": 5
  },
  {
    "title": "",
    "text": "Awesome !!",
    "date": "2017-02-28T21:15:34",
    "rating": 5
  },
  {
    "title": "",
    "text": "I do not recommend this trash game!!!",
    "date": "2017-02-28T21:05:00",
    "rating": 1
  },
  {
    "title": "",
    "text": "Tried",
    "date": "2017-02-28T20:48:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "addicted on this game",
    "date": "2017-02-28T20:46:59",
    "rating": 5
  },
  {
    "title": "",
    "text": "Great game! (no)",
    "date": "2017-02-28T20:46:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "salad",
    "date": "2017-02-28T20:46:00",
    "rating": 5
  },
  {
    "title": "",
    "text": "Once you are in , there is no way out ! \n\nCommunity is good . \n \nJust ignore the in-game rage .\n\nEdit : 2k hours was played then , Now have 3k hours played , take my advice , never start playing this game , spend time on some other hobbies, take a trip , give time to your family , but please , there is so much life can offer , don't let this game be one of them . \n\nAgain , NEVER EVER START PLAYING THIS GAME , PLEASE DONOT !!.///\n\nEdit 2 : 3.7k hours played . Still not worth it , this game was made to take as mush time as possiable from the player .Changed a lot and now takes avarage of 40 minutes instade of 1 hour per match but not worth it at all . Please , there are tons of other game to try , DO NOT waste your time in this one .\n\nEdit 3 : Date 18:12:2019 , another 1000 hours since last review , this game is shit , don't even start , please , there is no way out\n\nEdit 4 : Date 27:11:2020 , after 4977.7 hours , I still strongly recommend not to ever play this game .",
    "date": "2017-02-28T20:42:43",
    "rating": 1
  },
  {
    "title": "",
    "text": "oke",
    "date": "2017-02-28T20:31:07",
    "rating": 5
  },
  {
    "title": "",
    "text": "GG",
    "date": "2017-02-28T19:13:28",
    "rating": 5
  },
  {
    "title": "",
    "text": "Only played a while. Kinda fun",
    "date": "2017-02-28T19:12:56",
    "rating": 5
  },
  {
    "title": "",
    "text": "kool",
    "date": "2017-02-28T18:22:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "is very hardd & goood game  i play dota 2 (warcraft)                                                   *  pls like me *",
    "date": "2017-02-28T18:22:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "The place is dirty, staff were bunch of incompetent subhumans, everything was overpriced.\n\nWill never dine at this place again",
    "date": "2017-02-28T18:04:36",
    "rating": 1
  },
  {
    "title": "",
    "text": "+++",
    "date": "2017-02-28T17:33:35",
    "rating": 5
  },
  {
    "title": "",
    "text": "hue",
    "date": "2017-02-28T17:16:16",
    "rating": 5
  },
  {
    "title": "",
    "text": "It very nice",
    "date": "2017-02-28T17:16:07",
    "rating": 5
  },
  {
    "title": "",
    "text": "I really like DOTA2 there are a saying that Dota is Life and its true <3",
    "date": "2017-02-28T17:13:37",
    "rating": 5
  },
  {
    "title": "",
    "text": "sssssssssssssss",
    "date": "2017-02-28T17:01:25",
    "rating": 5
  },
  {
    "title": "",
    "text": "Good game in the world.",
    "date": "2017-02-28T17:01:00",
    "rating": 5
  },
  {
    "title": "",
    "text": "NIce\nwedqdqwd",
    "date": "2017-02-28T16:50:34",
    "rating": 5
  },
  {
    "title": "",
    "text": "yea",
    "date": "2017-02-28T16:49:17",
    "rating": 5
  },
  {
    "title": "",
    "text": "100% lifesteal. Plus cancerous SEA servers. Also account buyers.",
    "date": "2017-02-28T16:46:54",
    "rating": 1
  },
  {
    "title": "",
    "text": "Bad game",
    "date": "2017-02-28T16:46:09",
    "rating": 1
  },
  {
    "title": "",
    "text": "This game is an amazing game please everyone play this game!! amazing graphs,amazing security.",
    "date": "2017-02-28T16:40:21",
    "rating": 5
  },
  {
    "title": "",
    "text": "nice game ever i played",
    "date": "2017-02-28T16:31:55",
    "rating": 5
  },
  {
    "title": "",
    "text": "You wont find another game where grown men screech over their microphones in an autistic rage, all because their teammate did something wrong.",
    "date": "2017-02-28T16:16:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "Dota 2. From Warcraft 3 Custom Map to here. I love Strategy game. For me, this game is the best MOBA. yeah Really,The gameplay,just awesome. bunch of heroes there,use items for powerup, u need use ur brain play this game,especially the items. the heroes have their own Abilities, and The graphics are good!. u need teamwork to win this game..............\n\nWait...\n\ni just said teamwork?\n\nNo f ng way, This game have terrible Community,toxic Community,its just bad,really bad, more than horse dog or bull Sh*t, I Play in SEA Server. it just the the worst server, its like Place of Cr4p. The people dont have attitude,Blame Support,Blame Carry,Blame Everyone. Missused Report System, never give a chance for newbie. Feeding to enemy, Ruins ur Friend Gameplay. Chat full of Sh*t. just What the f? \n\ni said Missused Report, For Example, I have experience when playing this game, Select the hero. the game start, Waiting for other people loading or join the session. someone just take long time for loading, and then the people says \"report Report that nub loading,report\" WHAT THE??? U REPORTED someone cuz he/she have long loading at Start of the game?.  U ALD REPORT PEOPLE CUZ LOADING??? R U F KIDDING ME? THAT LOADING IS HIS/HER FAULT??? PURPOSE OF REPORT SYSTEM IF UR TEAMATES ARE TOXIC! FOR EXAMPLE: Feeding to enemy, use bad words much. and maybe you need tolerance to people who  cant play the hero propely. Teach him/her, RESPECT! dont blame,or report or other bullsh*t. ALL U NEED IS RESPECT! RESPECT OTHER PEOPLE!\n\nU cant avoid Bullying here,The community just cancer,cant Cure. If u Strong enough,u can play this game,be a good people,dont be toxic. I never recommend this game cuz its community, I know there's good poeple there,if u LUCKY!. I prefer play with bots even the bots are stupid. or play with ur friend,dont ever try Public. \n\nGAME: 10/10\nCOMMUNITY -1000/10\n\n(Sorry For English)",
    "date": "2017-02-28T15:56:46",
    "rating": 1
  },
  {
    "title": "",
    "text": "nice game",
    "date": "2017-02-28T14:59:01",
    "rating": 5
  },
  {
    "title": "",
    "text": "I like dota because its a challenging game not mind games yoneed to defeat your enemy\n",
    "date": "2017-02-28T14:56:09",
    "rating": 5
  },
  {
    "title": "",
    "text": "Very nice",
    "date": "2017-02-28T14:39:47",
    "rating": 5
  },
  {
    "title": "",
    "text": "just like dota 1, there are bad words XD hehehe\n\nthe game is nice if you play with pro players and friends\nalso strategic and challenging when raising your mmr\n\nbtw I do mute other players many times when the game starts, to avoid stress XD",
    "date": "2017-02-28T14:39:41",
    "rating": 5
  },
  {
    "title": "",
    "text": "*-*",
    "date": "2017-02-28T14:33:40",
    "rating": 5
  },
  {
    "title": "",
    "text": ">get into game >gets killed instantly >smashes $300 moniter\n\n11/10 would break moniter again",
    "date": "2017-02-28T14:29:44",
    "rating": 5
  },
  {
    "title": "",
    "text": "its awesome :)",
    "date": "2017-02-28T14:20:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "good game",
    "date": "2017-02-28T14:13:39",
    "rating": 5
  },
  {
    "title": "",
    "text": "Dota 2 is hard, but there's a huge reward for those who commit.",
    "date": "2017-02-28T14:09:41",
    "rating": 5
  },
  {
    "title": "",
    "text": "A LITTLE addctive.Just a LITTLE",
    "date": "2017-02-28T14:09:41",
    "rating": 1
  },
  {
    "title": "",
    "text": "VERY NICE AND EPIC",
    "date": "2017-02-28T14:05:45",
    "rating": 5
  },
  {
    "title": "",
    "text": "NICE GAME",
    "date": "2017-02-28T13:58:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "hay",
    "date": "2017-02-28T13:58:25",
    "rating": 5
  },
  {
    "title": "",
    "text": "Fix your CANCER GAMERS",
    "date": "2017-02-28T13:55:54",
    "rating": 5
  },
  {
    "title": "",
    "text": "Y",
    "date": "2017-02-28T13:44:13",
    "rating": 5
  },
  {
    "title": "",
    "text": "Easy game to learn but difficult to master.",
    "date": "2017-02-28T13:36:58",
    "rating": 5
  },
  {
    "title": "",
    "text": "Fun playing it and can challenge with other players.",
    "date": "2017-02-28T13:15:30",
    "rating": 5
  },
  {
    "title": "",
    "text": "The best game i have played",
    "date": "2017-02-28T13:06:14",
    "rating": 5
  },
  {
    "title": "",
    "text": "one of the best games i ever played",
    "date": "2017-02-28T12:44:52",
    "rating": 5
  },
  {
    "title": "",
    "text": "Awesome game ever",
    "date": "2017-02-28T12:38:29",
    "rating": 5
  },
  {
    "title": "",
    "text": "ASasASas",
    "date": "2017-02-28T12:36:06",
    "rating": 5
  },
  {
    "title": "",
    "text": "These exciting new games should try to play the game Dota 2 as well\n\nI love Dota 2",
    "date": "2017-02-28T12:34:36",
    "rating": 5
  },
  {
    "title": "",
    "text": "I made a screenshot of the lock screen. I opened it. I was distracted by something. Then I looked at the phone and tried to unlock it. [b]10 of 10 stupid neko[/b][quote=Chocola]Another such garbage, and you will need a neko doctor.[/quote]",
    "date": "2017-02-28T12:28:18",
    "rating": 1
  },
  {
    "title": "",
    "text": ":D",
    "date": "2017-02-28T12:24:35",
    "rating": 5
  },
  {
    "title": "",
    "text": "It'd cool.. but I'm just doing this to level up my steam.. lol",
    "date": "2017-02-28T12:24:23",
    "rating": 5
  },
  {
    "title": "",
    "text": "Best team game, of all time !!!",
    "date": "2017-02-28T12:20:03",
    "rating": 5
  },
  {
    "title": "",
    "text": "keep giv me low mmr and stupid teammate",
    "date": "2017-02-28T12:19:16",
    "rating": 1
  },
  {
    "title": "",
    "text": "11-28-2024",
    "date": "2017-02-28T12:16:40",
    "rating": 5
  },
  {
    "title": "",
    "text": "fix the fucking servers fuckers, i want a reufnd for my item transactions. Dota is a useless piece of fvck that you cant even play properly on.",
    "date": "2017-02-28T12:15:32",
    "rating": 1
  },
  {
    "title": "",
    "text": "100 percent lifestealer.Good game but full of stupid player ,mmr just a number.MAYBE....",
    "date": "2017-02-28T12:11:02",
    "rating": 5
  },
  {
    "title": "",
    "text": "dota uninstalled",
    "date": "2017-02-28T12:08:29",
    "rating": 1
  },
  {
    "title": "",
    "text": "Pick SF - Ask for tango and ward - Dominate your lane - EZ Win GGWP",
    "date": "2017-02-28T11:52:17",
    "rating": 5
  },
  {
    "title": "",
    "text": "its awsome",
    "date": "2017-02-28T11:46:40",
    "rating": 5
  },
  {
    "title": "",
    "text": "Awesome, so addicting like the previous dota but this is much better, no,  I mean the best :D",
    "date": "2017-02-28T11:40:50",
    "rating": 5
  },
  {
    "title": "",
    "text": "pretty cool game for free",
    "date": "2017-02-28T11:36:31",
    "rating": 5
  }
]