[
  {
    "title": "Poco profesionales",
    "text": "Yo no tengo ninguna culpa de habiendo dinero en mi cuenta el banco Santander no me dé la cantidad de 2910 euros que pedía que tampoco le importa para que quiero mi dinero, que es mío, que a las once se la mañana no tienes ese dinero, ala iros a cascarla Ampuero, yo no tengo culpa que estuviesen en obras, y luego la actitud de la señorita invitándome a marchar cuando no había ninguna persona más,y posteriormente metiendo prisa para que sacase el dinero, y criticando que lo tengo limitado a 1000 euros salida de dinero en cajero, señorita yo el límite pongo el que me interesa,  en efectivo, manda naricesBanco Santander oficina san martín del pino Peña castillo Santander.Lo que hay que hacer es cerrar esa oficina.",
    "date": "03 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "NEFASTO!! MAMARRACHOS!!! INCOMPETENTES!!!",
    "text": "NEFASTO!!! HORRIBLE!!! INCOMPETENTES!!! TANTO OPENBANK COMO EL SANTANDER!!! LLEVO UN MES EN ESTE ÙLTIMO PARA PONERME  COMO SEGUNDO TITULAR EN UNA CUENTA Y NO HACEN CASO NI CONTESTAN A LAS RECLAMACIONES,ETCC PORQUE SEAN CRUZADO DATOS CON OTRO CLIENTE Y NO ME INCLUYEN EN LA CUENTA, ES MÁS HE IDO A LA P.N. PARA UN CERTIFICADO DE TITULARIDAD LO HE PRESENTANDO Y TAMPOCO ACTUAN!!! SON ESCORIA!!! MAMARRACHOS!! INCOMPETENTES!!!",
    "date": "03 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Mala",
    "text": "Mala, mala y mala. Desastrosa. Incapacidad, mala praxis por parte de sus trabajadores. En general muy mala. No la recomiendo ni a mi pero enemigo.",
    "date": "27 de marzo de 2025",
    "rating": "N/A"
  },
  {
    "title": "El banco impide el cierre de la cuenta de España",
    "text": "Estoy en 4000 de España, entro en la aplicación del banco, transfiero el saldo a mi cuenta extranjera, todas las reservas están cerradas, en la cuenta 0 Euro sin deudas. El 19 de mayo me retiraron 20 euros por el mantenimiento de la cuenta, el 22 de mayo solicité el cierre de la cuenta. La tarjeta bancaria está cerrada. La respuesta prometida en 3 días hábiles ocurrió en 6 días hábiles: el banco decidió que le debía pagar 8,39 euros, por lo que esta cantidad aún no la conozco. A partir del 2 de junio, la cuenta bancaria no está cerrada.En mayo contacté con el banco, el primer mensaje fue sin mi nombre y cuenta, en el segundo mensaje agregué todo, pero nuevamente me envían un correo electrónico que tengo que proporcionar mi nombre y otros datos. El inofensivo cierre de la cuenta se convirtió en hemorroides, y eso es en 2025.Lo siento banco Santander, no voy a dar un paseo conmigo, no le debo nada al banco. La siguiente factura que facture por el Servicio de la cuenta será ilegal, toda la correspondencia y los intentos de contactar con usted se guardan. Presenté la solicitud el 22 de mayo, para mí la cuenta se cerró el 22 de mayo y la facturación adicional será ilegal.",
    "date": "22 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pésimo banco",
    "text": "Pésimo banco, pésimo servicio. Me robaron el dinero de la tarjeta. Alguien en Francia pagó con él en un taxi. ¿Me dio alguna explicación el banco? ¡No!!!! NADA!",
    "date": "24 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Sinceramente estoy sorprendida con la…",
    "text": "Sinceramente estoy sorprendida con la forma de proceder de la que se supone es la primera entidad bancaria en España. En pleno proceso de concurso de acreedores cobraron íntegramente el importe pendiente que tenía en la tarjeta de crédito, cosa que no pueden hacer. Facilitaron mis datos personales a terceros sin mi previo consentimiento a una entidad externa para el cobro de esa cantidad. No contentos con eso y una vez finalizado el concurso de acreedores, no me permiten pagar las cuotas del préstamo que tengo con ellos. Ceden tus datos a terceras empresas, las cuales dicen que son despachos de abogados y son meras empresas para el recobro de deudas.",
    "date": "29 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Oficina del Santander en Av Jaime III…",
    "text": "Oficina del Santander en Av Jaime III Palma. Pésimas maneras de atender a un cliente por la cajera, casi amenazante. Cancele la operación y estoy gestionando hacer lo mismo con la cuenta. No puedo permitir este comportamiento.",
    "date": "29 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "El peor trato jamás recibido.",
    "text": "El peor trato jamás recibido.Cojo cita online, confirmo cita, me presento puntual, cojo mi número, preparo un dossier… Me siento, saludo y doy los buenos días (no recibo saludo de parte de la gestora). 2 minutos.. no me deja hablar y concluye: “mira, no te lo vamos a dar…”.Minuto 3: ya estoy fuera de la sucursal alucinada porque ni siquiera han valorado mi perfil financiero.Peor Banco del Mundo. Óptimo coworking y felicidades por las fundaciones.Todo mkt enfocado a empresas start.ups.Trato nefasto y gente al frente con pocas ganas de trabajar",
    "date": "29 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Problemas con la APP",
    "text": "Llamo porque no puedo entrar en la APP del Santander, me hacen preguntas para identificarme, como nombre, fecha nacimiento y luego todas las preguntas de importes en la cuenta que evidentemente si no entro en la web no sé contestar. Le digo chico que me atiende por ya iré a la oficina personalmente a resolverlo porque así era imposible. Ahora lo he hecho yo sola en el ordenador y ya lo he solucionado. Profesionales muy poco.",
    "date": "27 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Oficina de Galdar",
    "text": "Oficina de Galdar ; Banco Santander Estoy desde 40 años en Canarias y nunca me atendieron tan mal en un banco. A pesar de tener cita previa cada vez que he ido me hicieron esperar un montón de tiempo. Además Me daron informaciones contradictorias según las empleadas que me atendieron. Acabo de tener una herencia y estaba pensando invertir parte de mi dinero en sus productos. Quería primero probar como me iban a atender por la compraventa de una casa (en general es una prueba buena para ver la profesionalidad de un banco y como atienden a la clientela) . Conclusión: nunca les confiaré mi dinero. Ya he perdido totalmente confianza en este banco que me hizo perder mucho tiempo cada vez que he ido y no ha sido capaz de darme una información básica para una compraventa.",
    "date": "23 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Solo le aporto una estrella debido no…",
    "text": "Solo le aporto una estrella debido no poder dale una nota 0, mi sentimiento es que son estafadores. Los explico, alquiler una suscripción com wabi, una empresa que pertenece a Santander, ellos crean motivos para no hacer la devolución del depósito inicial. Aumentan los precios de los acessorios o reparos para que tomen toda la fianza. Horrible la experiência.",
    "date": "21 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Contraté un TPV para mi negocio pero…",
    "text": "Contraté un TPV para mi negocio pero dejó de funcionar el primer día, estuve dos semanas intentando que lo arreglaran pero no hicieron nada y le di de baja, pues ahora a pesar que estaba en promoción y de qué no he podido usarlo me han cobrado la comisión, una vergüenza, ya me he ido al BBVA donde si me han atendido muy bien.",
    "date": "23 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Yo tengo un seguro de accidentes para…",
    "text": "Yo tengo un seguro de accidentes para autónomos. Por mala suerte para mí tuve que dar un parte en diciembre del 2023. Tras este parte me dicen que necesitan el informe del traumatólogo con el diagnóstico definitivo para indemnizarme. Porque me reconocen que me corresponde la indemnización. Después de todo este tiempo con varias infiltraciones en la rodilla. Me hacen la resonancia y el menisco está roto. Ayer envío por fin el informe del traumatólogo el cual explica todo a la perfección. Pues hoy me dicen que hasta que esté operada no me indemnizan. Unos impresentables. Están esperando y poniendo excusas hasta que pasen los dos años. Puse una reclamación, creo que para nada. Tendré que denunciar y aún así ya veremos. No recomiendo ningún seguro con Santander seguro que con uno de vida pedirán firma póstuma.",
    "date": "16 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pésimo seguro, nunca vienen ni te llaman",
    "text": "Llevamos esperando un mes a que vengan a ver una humedad (cuyo origen era un radiador roto que lo hemos arreglado nosotros porque supuestamente no lo cubre) Tenemos la tarima levantada de toda la habitación, la pared negra y el mueble hinchado.Llamadas y llamadas y dicen que esperemos otras 24h a que se pongan en contacto con nosotros, 24h eternamente porque ya van 15 días. Pésimo el trato y el servicio.",
    "date": "16 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Horrible",
    "text": "Jamás contraten un seguro de hogar con Santander. Pésimo en todos los aspectos. Las empresas con las que trabajan son nefastas. Dejadez completa y absoluta. 6 meses de llamadas y quejas para manden a tu casa gente que no saben ni poner una bombilla, lamentable. No quiero ni pensar lo que pasaría si contratas un seguro de vida o de coche con estos incompetentes.",
    "date": "15 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "NI SEGURO NI CUENTA CON ESE BANCO.",
    "text": "NI SEGURO NI CUENTA CON ESE BANCO.YO VOY A PEDIR UN CRÉDITO PERSONAL A OUN USURERO Y CANCELAR HIPOTECA. ASI, NO TENDRE QUE PAGAR SEGURO DE MUERTE ABUSIVO .EL USURERO SE LO QUE ME COBRA Y LO QUE ME DA.CON LA BANCA NUNCA SE SABE.",
    "date": "04 de febrero de 2025",
    "rating": "N/A"
  },
  {
    "title": "INSEGURO BANCO SANTANDER",
    "text": "Otra vez más, el inseguro del Banco Santander no cubre nada, a pesar de los demás de 1000 € que pago al año por la póliza del seguro, no atienden por teléfono, es un desastre total y encima después de hacerte esperar, nunca cubren nada, lo mejor es que hagáis el seguro con cualquier otra compañía, nunca con el banco Santander es una vergüenza, me voy a dar de baja.",
    "date": "13 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Llevo mes y medio con la casa patas…",
    "text": "Llevo mes y medio con la casa patas arriba por una avería del sanitario, el suelo abombado y las paredes con humedad.No hay manera de conseguir el informe del perito.Servio pésimo del seguro de hogar del banco de Santander",
    "date": "12 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Blanca la directora del banco Santander…",
    "text": "Blanca la directora del banco Santander oficina de san Eugenio . Una persona seca sin modales ni educación . Que en vez de tratar a personas parecía como si estuviera tratando con animales . Fui hacerle una pregunta sobre mi cuento . Y me dijo que ella no estaba para atender ese tipo de tonterías . Me quedé a cuadros nunca hubiera esperado esa contestación . Si es verdad cuando la vi me dio muy mala impresión . Fumando y tomándose un trago de wishy . Eso en un trabajo se ve feo .",
    "date": "09 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Una basura de seguro no entra nada las…",
    "text": "Una basura de seguro no entra nada las llamadas son un infierno y el personal que atiende unos inútiles.El servicio de manitas otra estafaNi se os ocurra contratar este seguro.",
    "date": "09 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Oficinas Smart Red,",
    "text": "Hay que felicitar a la empresa que diseña la imagen de marca corporativa del Banco de Santander. ¡¡¡Son unos genios!!!. Han creado las oficinas Smart Red, unas oficinas inteligentes-avanzadas-digitales-y-muy-modernas donde NO hay servicio de Caja. La estrategia está clara: se trata de dotar de prestigio a la marca con un nombre \"premium\" para suprimir servicios fundamentales a los clientes y ofrecer otros de dudosa utilidad. Muy modernos, eso sí. Tu dinero lo tienen, pero no te lo dan porque son sucursales inteligentes. Acabáramos... Lo inteligente es no tener caja para pagar. Lo cierto es que el planteamiento no tiene fisuras. Se ahorran costes en empleados y retrasan los pagos ofreciendo todo tipo de servicios digitales, pero los billetes no te los dan... Por no hablar de la actitud de los empleados que merece un capítulo aparte. (Sucursal de Torrelodones, por si quieren ir a probar ustedes mismos)Pero no todo van a ser buenas noticias. Hay una aún mejor: te puedes desplazar a otra sucursal menos \"smart\" para cobrar lo que es tuyo. ¿Son unos cracks o no?. Moraleja: Me voy a casa mucho más tranquilo y orgulloso de mi banco, con la seguridad de que al ser una oficina \"a la última\", no me dan el servicio básico de caja porque no es bueno para mí y con la certeza de que estoy algo desfasado por querer cobrar un cheque en el banco. ¿No será que en vez de listos son unos listillos?. Menos tecnología y más atención básica al cliente.",
    "date": "09 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Superseguro Santander el gran timo",
    "text": "No recomiendo estar asegurado con ellos. Pagamos una prima muy alta por el seguro ampliado.Tras la avería de un electrodoméstico el día del cero energético, y a pesar de que mi seguro especifica esta cobertura: \" se garantizan los daños a aparatos eléctricos como consecuencia de una sobretensión o un cortocircuito\", en primer lugar me lo denegaron, porque decía que la avería debía ser por un rayo, tras preserntarles este párrafo de mi copia del seguro, cambiaron la versión, a que se deberían haber roto todos los electrodomésticos para cubrirlos.Conclusión, casi 1000 euros de seguro anual y lo incumplen. Son unos timadores",
    "date": "07 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Hoy día 6 mayo 2025 aun no han pagado…",
    "text": "Hoy día 6 mayo 2025 aun no han pagado ni ayudas ni paro...y ni sus empleados saben cuando...este banco adelanta las prestaciones al 3 o 4 de cada mes...hay miles de familias q no pueden esperar más! Son todos iguales! Asco",
    "date": "06 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pésima",
    "text": "Pésima, para la cuenta Online, me han hecho ir dos veces a las sucursales, que resulta que abren hasta las 14:30 pero atienden al público hasta las 14... el personal es altanero, cambiaré de Banco, gracias",
    "date": "02 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Te ofrecen productos que no tienen",
    "text": "Me ofrecieron un teléfono y no era el que yo quería",
    "date": "02 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "La sucursal de Casarrubios de el Monte…",
    "text": "La sucursal de Casarrubios de el Monte en Toledo lleva cerrada desde semana santa y para colmo el cajero no tiene dinero , entiendo que el señor que lo lleva pueda tener algún tipo de problema y no pueda ir pero eso no es pretexto para no poner a alguien que lo sustituya,  DE VERGÜENZA 3",
    "date": "30 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Muy buenas.He decidido escribir mi…",
    "text": "Muy buenas.He decidido escribir mi opinión real sobré qué significa ser cliente Santander: yo soy cliente de la  sucursal de Albox.Debo decir que nadie ,NUNCA me ha ayudado tanto y con tanta familiaridad y profesionalidad como lo han hecho ellos, sobre todo el Director ,que además de su oficio se convierte en tu mejor aliado y hombro donde poner la cabeza cuando todo te agobia.Para mi son los únicos en la manera de tratar al cliente y NUNCA sales insatisfecho de la oficina.UN EJEMPLO DE SEGUIR.GRACIAS POR TODO.",
    "date": "30 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "En la oficina de teatinos Málaga",
    "text": "En la oficina de teatinos Málaga,  solo te responden y asesoran para contratar la cuenta. Fui atendido por isabel gomez .  Despues de eso dejan de responderte. Poco serio",
    "date": "24 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Contraté el pasado Enero la cuenta…",
    "text": "Contraté el pasado Enero la cuenta nómina del Banco Santander, pero después de haber pasado unos meses vi que no me llegaban los 400 € que me prometieron con dicha cuenta nomina, y al reclamar me dicen como excusa barata que yo no habia rellenado bien un formulario que iba adjunto a dicha contratación de esa cuenta nomina, y se callan sin decirme nada hasta que me he dado cuenta. Ni que decir tiene que voy cancelar la cuenta y no vuelvo con ellos jamas",
    "date": "21 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "No se puede ser tan usureros y ladrones",
    "text": "Poned en la valoración también cero, en lugar de dar como mínimo una estrella. Sois unos auténticos ladrones, carentes de todo tipo de ética. Os quejáis del tímido impuesto a la banca que ha puesto este gobierno cuando os tenían que crujir con impuestos mucho mayores a los vergonzosos beneficios que obtenéis robando a vuestros clientes. Me da asco y me indigna que la Botina diga que fuera impuestos a los beneficios que sacáis con comisiones y robando el dinero a vuestros mismos clientes.En mi caso, tenía un producto financiero en un Seguro RAW 101, voy un día a rescatarlo y me dicen que ese día no puedo rescatarlo por que incluso la operativa de su página web no estaba operativa, montó un pollo y me dicen que me pase a rescatarlo el día siguiente. El valor de rescate este pasado 9 de abril era de una cantidad determinada, al día siguiente me paso por la oficina y como sospechaba el valor de rescate había bajado en 500€. Después de poner todas las reclamaciones posibles hoy me dan una respuesta después de una semana y me dicen que no van a devolver esos 500€ dando argumentos absolutamente delirantes.Me cago el el Banco Santander y en toda su práctica bancaria. Botina, a ver si te enteras. Tenía que haber un gobierno que os pusiera un pedazo de impuesto sobre beneficios que os cagarais. Sois el máximo exponente de la usura, robando a vuestros propios clientes. Mucho cuidado con este Banco nauseabundo y con los productos que comercializa. Devolvedme lo que me corresponde. No se puede obtener beneficios obscenos a costa de todos nosotros. Boicot a un banco que realiza prácticas bancarias sumamente abusivas",
    "date": "21 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Muy mala la gestion con el gestor que…",
    "text": "Muy mala la gestion con el gestor que no te sabe informar bien de las cosas y te sales perjudicando ahora mismo quiero cerrar mi cuenta y no me dejan, pues así se va a quedar la cuenta al descubierto no pienso ingresar ni 1€",
    "date": "24 de enero de 2025",
    "rating": "N/A"
  },
  {
    "title": "Fondos de Inversión donde ellos se llevan las ganancias y tu se las declaras",
    "text": "Hace 4 años abrí un fondo Santander Horizonte 2026, al cabo de 2 años , como tenía perdidas, muy mal aconsejada por la directora de la oficina de Salamanca, en el Paseo del Rollo, lo traspasé a una cartera. La quité harta de ver que subía y subían los fondos pero nunca los míos, llenos de comisiones. Cual es mi sorpresa que cuando voy a declararlo, según ellos he ganado 1500€, cuando perdí 200€. Y como me fui de ese banco, que es el mayor ladrón de todos, ahora ni puedo pedir cita ni me dan mis datos fiscales. Me toca denunciar a la OCU y CNMV. Jamas he tenido tantos problemas con un banco. Hasta cuando inicié con ellos que abrí un plazo fijo, se equivocaron 4 veces en las transferencias! Tuve que volver de vacaciones del lío que tenía la empleada...una auténtica incompetente!",
    "date": "17 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Le doy una estrella por el debido…",
    "text": "Le doy una estrella por el debido suceso que hubo con uno de sus empleados que tuvo la descara de mentir a un cliente en toda su cara el motivo fue movimientos bancarios el cual le dijo que eran gratuito lo cual no fue así y el cliente se lo preguntó dos veces y las dos veces le confirmó que si era gratuito lo cual no es así porque parece ser que los movimientos sí cuestan dinero",
    "date": "14 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "COMISIONES EXCESIVAS",
    "text": "Mi madre tiene una cuenta en este banco, después de realizar la venta de una propiedad, hemos llevado un cheque bancario para ingresarlo en su cuenta y nos informan de que el coste es dé más de 60 euros. Cobran un 3% del valor del cheque. Ella tiene domiciliada su pensión y recibos. Mis hermanos y yo hemos ingresado los nuestros en BBVA e ING y es totalmente gratuito. Los cajeros tampoco están preparados para muchas operaciones. Es un banco antiguo de los que les saca dinero a los clientes, sobre todo a los mayores que no se manejan con las nuevas tecnologías.",
    "date": "11 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Trato desagradable",
    "text": "Hay una trabajadora que trata mal a los cliientes les habla mal ya la han sacado de una sucursal para cambiarla a otra i lo sigue haziendo",
    "date": "14 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Oficina del Banco Santander. Murcia…",
    "text": "Mi experiencia de la oficina del Banco de Santander de Juan Carlos 1 en Murcia, es muy favorable. María José, una trabajadora de dicha entidad, es empática, muy trabajadora, educada y eficiente.Gracias a ella, nunca cambiaría de  banco.Muchas gracias, María José, tu servicio a los clientes es excelente.",
    "date": "10 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "LADRONES. Bizum nunca recibido",
    "text": "La semana pasada me hicieron un Bizum de 93,5€, el cual nunca recibí. Al contactarles me dicen que mi bizum no está registrado en Santander, lo cual es mentira, pues el mismo día hice un Bizum desde la cuenta de Santander, y los sigo haciendo hasta el día de hoy. Por lo que hay 93,50€ que me han perdido, y se exculpan de su responsabilidad cuando es suya ya que ha sido un error de su sistema. LADRONES",
    "date": "01 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "No vayáis a Santander!",
    "text": "Hace 15 días que mi mujer —funcionaria, con estabilidad laboral y yo también funcionario, solicitó un préstamo de 15.000€ para un coche en Banco Santander. Primero, la app no funcionaba y no permitía completar el trámite. Una vez solucionado, y tras múltiples llamadas entre el gestor y superlínea, y visitas oficina, y tras comprobar que todo está bien y que no hay ningún fallo, el préstamo quedó en ‘tramitación’... y ahí sigue. Ni una llamada, ni una explicación, ni un mísero seguimiento. Nos parece vergonzosa la falta de seriedad, sobre todo tratándose de un cliente solvente y una operación sencilla. Si así gestionan un préstamo básico, no quiero imaginar cómo será el servicio con algo más importante. Muy decepcionados.",
    "date": "11 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "El peor banco del mundo",
    "text": "El peor banco del mundo, el de Elche ( alicante) son unos ineptos y tratan mal y mienten a las personas para conseguir su bienestar. Un asco el banco santanddr de España",
    "date": "08 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Muchas coberturas que no cubren nada",
    "text": "Solicite asistencia juridica a traves de la poliza de mi seguro por un tratamiento de ortodoncia que comenzo antes de contratar el seguro pero empezo a dar los problemas muy posteriormente a la contratacion, de hecho el mal resultado del tratamiento es ahora cuando aparece. Me deniegan el servicio por haber comenzado el tratamiento con anterioridad al contrato de la poliza. Tomen nota. Por supuesto el seguro de Santander ha cambiado inmediatamente al mas basico y xk por la hipoteca no me queda otra, y tal como van los intereses esta tiene tambien los dias contados, me cambio de banco.",
    "date": "08 de abril de 2025",
    "rating": "N/A"
  }
]