[
  {
    "title": "Nefasta y lenta gestión",
    "text": "Nefasta y lenta gestión. Burocracia injustificada, nula atención al cliente, retraso y errores en todos los trámites, gestora con la que trabajan (Gestinova99) peor aún... No he visto ni he trabajado con un banco peor en mi vida. Además nos mintió el director de la sucusal en un caso de permuta de un piso con las condiciones del préstamo, nos dijo que nos mantendría el interés y la cuota (literalmente nos dijo que íbamos a seguir pagando la misma cuota) y cuando ya no teníamos tiempo de mirar el préstamo con otro banco, nos DUPLICÓ el interés fijo. Una verguenza",
    "date": "16 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Por favor huyan de los seguros…",
    "text": "Por favor huyan de los seguros Santander. No sirven para nada, carísimos y no cubren una M....... Háganme caso. Llevo 9 años con ellos obligado porque si no me suben el diferencial de la hipoteca. Que ganas de acabar y no verles ni en pintura.",
    "date": "02 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Desastres llevo 5 meses con un…",
    "text": "Desastres llevo 5 meses con un siniestro Imposible que nadie responda a nada",
    "date": "16 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Para ingresar 50 € tantos dias ???",
    "text": "El jueves 12 ingresé 50 € en un cajero y se tragaron el dinero, llamé el viernes 13 de junio y me dijeron que me llamarian para constatar la incidencia , me llamaron a las 15 h de la tarde del viernes  y me dijero que si, que con esa tarjeta habia un ingreso se 50€ , hoy es Lunes 16 de Junio y aún no tengo mi dinero ingresado. Estoy alucinada. Es surrealista todo.",
    "date": "12 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Intento acceder a la app móvil y es…",
    "text": "Intento acceder a la app móvil y es imposible, encima ni avisaron ,el lunes retiraré todos mis ahorros de esta entidad y me iré a la Caixa bank , no tienen vergüenza ninguna , no podemos acceder a ver nada , esto es denunciable",
    "date": "15 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Servicio nulo",
    "text": "Servicio nulo. Seguimos trabajando en tu caso con nº xxxx que diste de alta el día 2025-06-03 14:xx:xx a través de banca telefónica, esperamos responderte en el menor tiempo posible. 10 días más tarde... ni flowers.",
    "date": "03 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Banco Santander Calle Boltaña, no cogen teléfono",
    "text": "Buenos días en la sucursal de la calle Boltaña en Madrid barrio de Canillejas cuando llamas no coge nunca nadie el teléfono, es  una  auténtica vergüenza.",
    "date": "13 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Fatal",
    "text": "Fatal, no cubre nada de lo que pone que cubre, se lavan las manos",
    "date": "12 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Fatal",
    "text": "No se porque te dicen que cojas cita por la web si luego te atienden cuando les da la gana.",
    "date": "11 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Muy contenta",
    "text": "Yo tengo que decir que me he quedado sorprendida con la rapidez que me han resuelto mi problema no han tardado ni 24 horas. Mis agradecimientos a la oficina 5867 y en especial a Esther.",
    "date": "09 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pasaron de empleados de banca a…",
    "text": "Pasaron de empleados de banca a funcionarios, muy mala atención y si no compras los seguros la atención es pésima, son muy malos vendedores y pésimos gestores. \"Trabajan \" por que no tienen a donde ir. Se acabo la banca viven amargados, no sienten la profesión, es lógico, no cobran por trabajar, cobran por lo que te tratan de vender.",
    "date": "02 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "CUENTA CONGELADA 2 MESES ES INCREIBLE Y NADIE DICE PORQUE LO Q PIDIERON YA SE ADJUNTO Y SIEMPRE LO MISMO EN 24 HORAS.ESTARA ACTIVA Y NADA, SON UNOS SINVERGUENZAS NI Q SE MOVIERAN MILLONES DE EUROS.",
    "text": "Lleva mi hijo con la cuenta congelada 2 meses ya adjunto todo lo que le pidieron q adjuntara y nada, nadie da razon y el problema es que ahi llegan todos los recibos de pagos que debe hacer y creditos con el mismo banco y le estan cobrando intereses por falta de pago y todo congelado, son unos sinverguenzas y lo peor todos los dias llamando y la misma respuesta que en 24 horas estara ya activa y 2 meses en esto, son unos mal nacidos y no le dicen porque esta congelada, por favor YA BASTA NO MAS MI HIJO ESTA ENFERMO YA CON ESTA SITUACION NESECITAMOS.SOLUCIONES.",
    "date": "01 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "El banco Santander me ha bloqueado la…",
    "text": "El banco Santander me ha bloqueado la cuenta porque llamé por un cargo posiblemente fraudulento y me bloquea la cuenta sin mi consentimiento me quedo sin dinero todo el fin de semana con lo fácil que era solicitar tarjetas virtuales nuevas como otras veces pero no la señora que me atendió por teléfono de su mano mayor decidió bloquearme la cuenta esto es totalmente ilegal no he dado ningún consentimiento para que se proceda así  con lo sencillo que era bloquear las tarjetas y solicitar otras que al miento ya se pueden utilizar y mi cuenta seguiría siendo segura pues no la señora por sus santas narices me bloquea la cuenta la reclamación que la va a caer va a ser buena a ver cómo compro yo ahora leche para mí bebé sinvergüenza todas mis redes sociales van a saber cómo actúa el banco Santander esto no es ayudar a los clientes esto es ejercer su poder para hacernos sentir insignificante pues acabo de vender ni piso y el dinero iba a entrar íntegro en ese banco ahora por supuesto que no y la cuenta la voy a cerrar jamás volveré aser clientes del banco Santander por gestionar el acceso a mí i dinero de forma inefizcaz e ilegal y la denuncia en consumo por supuesto a ver qué ocurre en la junta arbitraria porque para bloquear una cuenta deben tener el consentimiento del titular y no le tienen sinvergüenzas",
    "date": "05 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "La app del banco santander es PENOSA",
    "text": "La app del banco santander es realmente penosa. Se bloquea seguido, con lo que debo anularla y volverla a configurarla; esto me ha pasado como ocho veces. Nunca me ha pasado con ninguna app de otro banco, es para que tomen nota y lo arreglen ya. Tercermundista parece¡¡",
    "date": "05 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pongo una estrella por no poner 0",
    "text": "Pongo una estrella por no poner 0. Son tan malos que se ma acaban las palabras. No os gasteis el dinero. Cuando hay cualquier suceso pasa lo sigiente: no cubre, no llovio los suficiente, demuestreme usted que llovió, aporte un disgnositico sobre subida de tensión.....",
    "date": "05 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Poco profesionales",
    "text": "Yo no tengo ninguna culpa de habiendo dinero en mi cuenta el banco Santander no me dé la cantidad de 2910 euros que pedía que tampoco le importa para que quiero mi dinero, que es mío, que a las once se la mañana no tienes ese dinero, ala iros a cascarla Ampuero, yo no tengo culpa que estuviesen en obras, y luego la actitud de la señorita invitándome a marchar cuando no había ninguna persona más,y posteriormente metiendo prisa para que sacase el dinero, y criticando que lo tengo limitado a 1000 euros salida de dinero en cajero, señorita yo el límite pongo el que me interesa,  en efectivo, manda naricesBanco Santander oficina san martín del pino Peña castillo Santander.Lo que hay que hacer es cerrar esa oficina.",
    "date": "03 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "NEFASTO!! MAMARRACHOS!!! INCOMPETENTES!!!",
    "text": "NEFASTO!!! HORRIBLE!!! INCOMPETENTES!!! TANTO OPENBANK COMO EL SANTANDER!!! LLEVO UN MES EN ESTE ÙLTIMO PARA PONERME  COMO SEGUNDO TITULAR EN UNA CUENTA Y NO HACEN CASO NI CONTESTAN A LAS RECLAMACIONES,ETCC PORQUE SEAN CRUZADO DATOS CON OTRO CLIENTE Y NO ME INCLUYEN EN LA CUENTA, ES MÁS HE IDO A LA P.N. PARA UN CERTIFICADO DE TITULARIDAD LO HE PRESENTANDO Y TAMPOCO ACTUAN!!! SON ESCORIA!!! MAMARRACHOS!! INCOMPETENTES!!!",
    "date": "03 de junio de 2025",
    "rating": "N/A"
  },
  {
    "title": "Mala",
    "text": "Mala, mala y mala. Desastrosa. Incapacidad, mala praxis por parte de sus trabajadores. En general muy mala. No la recomiendo ni a mi pero enemigo.",
    "date": "27 de marzo de 2025",
    "rating": "N/A"
  },
  {
    "title": "El banco impide el cierre de la cuenta de España",
    "text": "Estoy en 4000 de España, entro en la aplicación del banco, transfiero el saldo a mi cuenta extranjera, todas las reservas están cerradas, en la cuenta 0 Euro sin deudas. El 19 de mayo me retiraron 20 euros por el mantenimiento de la cuenta, el 22 de mayo solicité el cierre de la cuenta. La tarjeta bancaria está cerrada. La respuesta prometida en 3 días hábiles ocurrió en 6 días hábiles: el banco decidió que le debía pagar 8,39 euros, por lo que esta cantidad aún no la conozco. A partir del 2 de junio, la cuenta bancaria no está cerrada.En mayo contacté con el banco, el primer mensaje fue sin mi nombre y cuenta, en el segundo mensaje agregué todo, pero nuevamente me envían un correo electrónico que tengo que proporcionar mi nombre y otros datos. El inofensivo cierre de la cuenta se convirtió en hemorroides, y eso es en 2025.Lo siento banco Santander, no voy a dar un paseo conmigo, no le debo nada al banco. La siguiente factura que facture por el Servicio de la cuenta será ilegal, toda la correspondencia y los intentos de contactar con usted se guardan. Presenté la solicitud el 22 de mayo, para mí la cuenta se cerró el 22 de mayo y la facturación adicional será ilegal.",
    "date": "22 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pésimo banco",
    "text": "Pésimo banco, pésimo servicio. Me robaron el dinero de la tarjeta. Alguien en Francia pagó con él en un taxi. ¿Me dio alguna explicación el banco? ¡No!!!! NADA!",
    "date": "24 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Sinceramente estoy sorprendida con la…",
    "text": "Sinceramente estoy sorprendida con la forma de proceder de la que se supone es la primera entidad bancaria en España. En pleno proceso de concurso de acreedores cobraron íntegramente el importe pendiente que tenía en la tarjeta de crédito, cosa que no pueden hacer. Facilitaron mis datos personales a terceros sin mi previo consentimiento a una entidad externa para el cobro de esa cantidad. No contentos con eso y una vez finalizado el concurso de acreedores, no me permiten pagar las cuotas del préstamo que tengo con ellos. Ceden tus datos a terceras empresas, las cuales dicen que son despachos de abogados y son meras empresas para el recobro de deudas.",
    "date": "29 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Oficina del Santander en Av Jaime III…",
    "text": "Oficina del Santander en Av Jaime III Palma. Pésimas maneras de atender a un cliente por la cajera, casi amenazante. Cancele la operación y estoy gestionando hacer lo mismo con la cuenta. No puedo permitir este comportamiento.",
    "date": "29 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "El peor trato jamás recibido.",
    "text": "El peor trato jamás recibido.Cojo cita online, confirmo cita, me presento puntual, cojo mi número, preparo un dossier… Me siento, saludo y doy los buenos días (no recibo saludo de parte de la gestora). 2 minutos.. no me deja hablar y concluye: “mira, no te lo vamos a dar…”.Minuto 3: ya estoy fuera de la sucursal alucinada porque ni siquiera han valorado mi perfil financiero.Peor Banco del Mundo. Óptimo coworking y felicidades por las fundaciones.Todo mkt enfocado a empresas start.ups.Trato nefasto y gente al frente con pocas ganas de trabajar",
    "date": "29 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Problemas con la APP",
    "text": "Llamo porque no puedo entrar en la APP del Santander, me hacen preguntas para identificarme, como nombre, fecha nacimiento y luego todas las preguntas de importes en la cuenta que evidentemente si no entro en la web no sé contestar. Le digo chico que me atiende por ya iré a la oficina personalmente a resolverlo porque así era imposible. Ahora lo he hecho yo sola en el ordenador y ya lo he solucionado. Profesionales muy poco.",
    "date": "27 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Oficina de Galdar",
    "text": "Oficina de Galdar ; Banco Santander Estoy desde 40 años en Canarias y nunca me atendieron tan mal en un banco. A pesar de tener cita previa cada vez que he ido me hicieron esperar un montón de tiempo. Además Me daron informaciones contradictorias según las empleadas que me atendieron. Acabo de tener una herencia y estaba pensando invertir parte de mi dinero en sus productos. Quería primero probar como me iban a atender por la compraventa de una casa (en general es una prueba buena para ver la profesionalidad de un banco y como atienden a la clientela) . Conclusión: nunca les confiaré mi dinero. Ya he perdido totalmente confianza en este banco que me hizo perder mucho tiempo cada vez que he ido y no ha sido capaz de darme una información básica para una compraventa.",
    "date": "23 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Solo le aporto una estrella debido no…",
    "text": "Solo le aporto una estrella debido no poder dale una nota 0, mi sentimiento es que son estafadores. Los explico, alquiler una suscripción com wabi, una empresa que pertenece a Santander, ellos crean motivos para no hacer la devolución del depósito inicial. Aumentan los precios de los acessorios o reparos para que tomen toda la fianza. Horrible la experiência.",
    "date": "21 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Contraté un TPV para mi negocio pero…",
    "text": "Contraté un TPV para mi negocio pero dejó de funcionar el primer día, estuve dos semanas intentando que lo arreglaran pero no hicieron nada y le di de baja, pues ahora a pesar que estaba en promoción y de qué no he podido usarlo me han cobrado la comisión, una vergüenza, ya me he ido al BBVA donde si me han atendido muy bien.",
    "date": "23 de abril de 2025",
    "rating": "N/A"
  },
  {
    "title": "Yo tengo un seguro de accidentes para…",
    "text": "Yo tengo un seguro de accidentes para autónomos. Por mala suerte para mí tuve que dar un parte en diciembre del 2023. Tras este parte me dicen que necesitan el informe del traumatólogo con el diagnóstico definitivo para indemnizarme. Porque me reconocen que me corresponde la indemnización. Después de todo este tiempo con varias infiltraciones en la rodilla. Me hacen la resonancia y el menisco está roto. Ayer envío por fin el informe del traumatólogo el cual explica todo a la perfección. Pues hoy me dicen que hasta que esté operada no me indemnizan. Unos impresentables. Están esperando y poniendo excusas hasta que pasen los dos años. Puse una reclamación, creo que para nada. Tendré que denunciar y aún así ya veremos. No recomiendo ningún seguro con Santander seguro que con uno de vida pedirán firma póstuma.",
    "date": "16 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pésimo seguro, nunca vienen ni te llaman",
    "text": "Llevamos esperando un mes a que vengan a ver una humedad (cuyo origen era un radiador roto que lo hemos arreglado nosotros porque supuestamente no lo cubre) Tenemos la tarima levantada de toda la habitación, la pared negra y el mueble hinchado.Llamadas y llamadas y dicen que esperemos otras 24h a que se pongan en contacto con nosotros, 24h eternamente porque ya van 15 días. Pésimo el trato y el servicio.",
    "date": "16 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Horrible",
    "text": "Jamás contraten un seguro de hogar con Santander. Pésimo en todos los aspectos. Las empresas con las que trabajan son nefastas. Dejadez completa y absoluta. 6 meses de llamadas y quejas para manden a tu casa gente que no saben ni poner una bombilla, lamentable. No quiero ni pensar lo que pasaría si contratas un seguro de vida o de coche con estos incompetentes.",
    "date": "15 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "NI SEGURO NI CUENTA CON ESE BANCO.",
    "text": "NI SEGURO NI CUENTA CON ESE BANCO.YO VOY A PEDIR UN CRÉDITO PERSONAL A OUN USURERO Y CANCELAR HIPOTECA. ASI, NO TENDRE QUE PAGAR SEGURO DE MUERTE ABUSIVO .EL USURERO SE LO QUE ME COBRA Y LO QUE ME DA.CON LA BANCA NUNCA SE SABE.",
    "date": "04 de febrero de 2025",
    "rating": "N/A"
  },
  {
    "title": "INSEGURO BANCO SANTANDER",
    "text": "Otra vez más, el inseguro del Banco Santander no cubre nada, a pesar de los demás de 1000 € que pago al año por la póliza del seguro, no atienden por teléfono, es un desastre total y encima después de hacerte esperar, nunca cubren nada, lo mejor es que hagáis el seguro con cualquier otra compañía, nunca con el banco Santander es una vergüenza, me voy a dar de baja.",
    "date": "13 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Llevo mes y medio con la casa patas…",
    "text": "Llevo mes y medio con la casa patas arriba por una avería del sanitario, el suelo abombado y las paredes con humedad.No hay manera de conseguir el informe del perito.Servio pésimo del seguro de hogar del banco de Santander",
    "date": "12 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Blanca la directora del banco Santander…",
    "text": "Blanca la directora del banco Santander oficina de san Eugenio . Una persona seca sin modales ni educación . Que en vez de tratar a personas parecía como si estuviera tratando con animales . Fui hacerle una pregunta sobre mi cuento . Y me dijo que ella no estaba para atender ese tipo de tonterías . Me quedé a cuadros nunca hubiera esperado esa contestación . Si es verdad cuando la vi me dio muy mala impresión . Fumando y tomándose un trago de wishy . Eso en un trabajo se ve feo .",
    "date": "09 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Una basura de seguro no entra nada las…",
    "text": "Una basura de seguro no entra nada las llamadas son un infierno y el personal que atiende unos inútiles.El servicio de manitas otra estafaNi se os ocurra contratar este seguro.",
    "date": "09 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Oficinas Smart Red,",
    "text": "Hay que felicitar a la empresa que diseña la imagen de marca corporativa del Banco de Santander. ¡¡¡Son unos genios!!!. Han creado las oficinas Smart Red, unas oficinas inteligentes-avanzadas-digitales-y-muy-modernas donde NO hay servicio de Caja. La estrategia está clara: se trata de dotar de prestigio a la marca con un nombre \"premium\" para suprimir servicios fundamentales a los clientes y ofrecer otros de dudosa utilidad. Muy modernos, eso sí. Tu dinero lo tienen, pero no te lo dan porque son sucursales inteligentes. Acabáramos... Lo inteligente es no tener caja para pagar. Lo cierto es que el planteamiento no tiene fisuras. Se ahorran costes en empleados y retrasan los pagos ofreciendo todo tipo de servicios digitales, pero los billetes no te los dan... Por no hablar de la actitud de los empleados que merece un capítulo aparte. (Sucursal de Torrelodones, por si quieren ir a probar ustedes mismos)Pero no todo van a ser buenas noticias. Hay una aún mejor: te puedes desplazar a otra sucursal menos \"smart\" para cobrar lo que es tuyo. ¿Son unos cracks o no?. Moraleja: Me voy a casa mucho más tranquilo y orgulloso de mi banco, con la seguridad de que al ser una oficina \"a la última\", no me dan el servicio básico de caja porque no es bueno para mí y con la certeza de que estoy algo desfasado por querer cobrar un cheque en el banco. ¿No será que en vez de listos son unos listillos?. Menos tecnología y más atención básica al cliente.",
    "date": "09 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Superseguro Santander el gran timo",
    "text": "No recomiendo estar asegurado con ellos. Pagamos una prima muy alta por el seguro ampliado.Tras la avería de un electrodoméstico el día del cero energético, y a pesar de que mi seguro especifica esta cobertura: \" se garantizan los daños a aparatos eléctricos como consecuencia de una sobretensión o un cortocircuito\", en primer lugar me lo denegaron, porque decía que la avería debía ser por un rayo, tras preserntarles este párrafo de mi copia del seguro, cambiaron la versión, a que se deberían haber roto todos los electrodomésticos para cubrirlos.Conclusión, casi 1000 euros de seguro anual y lo incumplen. Son unos timadores",
    "date": "07 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Hoy día 6 mayo 2025 aun no han pagado…",
    "text": "Hoy día 6 mayo 2025 aun no han pagado ni ayudas ni paro...y ni sus empleados saben cuando...este banco adelanta las prestaciones al 3 o 4 de cada mes...hay miles de familias q no pueden esperar más! Son todos iguales! Asco",
    "date": "06 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Pésima",
    "text": "Pésima, para la cuenta Online, me han hecho ir dos veces a las sucursales, que resulta que abren hasta las 14:30 pero atienden al público hasta las 14... el personal es altanero, cambiaré de Banco, gracias",
    "date": "02 de mayo de 2025",
    "rating": "N/A"
  },
  {
    "title": "Te ofrecen productos que no tienen",
    "text": "Me ofrecieron un teléfono y no era el que yo quería",
    "date": "02 de mayo de 2025",
    "rating": "N/A"
  }
]