[
  {
    "rating": "9",
    "title": "Genuinely superb and a step forward in 3D films",
    "text": "HTTYD is the latest in a run of animated 3D films to hit the family market. One might be forgiven for feeling a little weary of this genre as the big production studios churn out one \"action-packed film with a cute central character and some pretty effects\" after another. But wait...\nHTTYD stands apart from these other attempts for a number of reasons. First, the 3D (Odeon digital in this screening) is moving more toward the subtle with fewer \"gratuitous\" 3D moments than in movies like Bolt and Coraline. As 3D becomes a staple of high street cinema, directors seem to be finding 3D to be more about adding depth rather than a brief focal-point. That's not to say that there isn't effective use of the 3D wow-factor here; it's just not all the film has to hold attention.\nSecond, a cast of voice talent that does not demand too much consideration of the man/woman behind the microphone is refreshing. Baruchel is not over-playing the sugar or the heroics and, as much as an animated character can be, he is believable and as three-dimensional as the visuals. Butler is not greatly stretched here but manages to stay just the right side of a Mike Myers impression so as not to annoy. How many kids will now think the Vikings were a fearsome race of Americans and Scots? Oh, well! \nThird, the plot and dialogue. You may not know the plot and I won't spoil it now. It is straightforward stuff but the pace keeps it interesting for kids and the grown-ups. Younger children may be upset at times and I heard a sob or two at the emotional moments. Nothing too heavy here though, it's just a well-written script with as many actual laughs as I have seen in a kids' film.\nThis is one of the best films so far in this prolific genre and it has been made with passion rather than thrown together to cash-in on the thirst for these films, right now. I would urge all ages to see this film in 3D as the textures are extraordinary and you can't help but be charmed by it all."
  },
  {
    "rating": "9",
    "title": "Will enamour kids and enthrall adults",
    "text": "With a somewhat unwieldy tile and the lack of the winning Pixar storyline that has dominated the Oscars for a decade, Dreamworks animations latest could have been a clunker. Not only is How to Train Your Dragon the best film of the year so far, but it even eclipses the quality of last years duel academy award winner Up.\nThe latest 3-D film to fly into theatres in so many weeks is also the best of its format (story wise), making Burton's overblown misfire Alice in Wonderland look even more pitiful. Dragon will no doubt enamour kids (excuse the cliché) of all ages while keeping parents not only awake but equally enthralled. This movie is sure to tug the hearts of anyone who has ever loved a pet and will undoubtedly draw tears from those who are so inclined.\nThe texture that can be created from today's CG technology never ceases to amaze. Consider a beautiful tracking shot of a downed dragon where the twisted wing that protrudes towards the screen is actually out of focus, as if you yourself were staring awestruck at the giant lizard that lay before you in real, tangible life. I did not have the pleasure to viewing How to Train Your Dragon in 3-D but I have heard great things and even without having paid a surcharge the film does in no way suffer as a result. The narrative, visuals, writing and voicework is ample reason to seek out Dragon and frankly is the real heart of the movie anyways.\nOn the Island of Berk, the Viking community that lives there does not fear a rival tribe, the weather or disease but rather a much more toothy threat: dragons. Nightly raids by the winged beasts have forged a great hatred upon the tribe and led by the aptly named Stoik the Vast (Gerard Butler) they wage war with the intent to rid themselves of dragons once and for all. This is not a feeling shared by Stoik's scrawny son Hiccup (Jay Baruchel) who favours non-lethal tactics as much as he does blacksmithing. Much to Hiccup's surprise, during one of the aforementioned raids he is able to down a dragon with one of his contraptions. Intent on proving his manhood to Stoik, he seeks out to find the dragon know as a Night Fury but finds himself unable to slay his scaly foe. So begins an unlikely and forbidden friendship with the later named Toothless that follows a time-tested but absolutely rewarding arc that is as enthralling as it is touching.\nJoining Butler and Baruchel, both of whom give excellent performances (with Butler recapturing some of his 300 mojo), are the likes of Craig Fergusson as the Viking blacksmith, America Ferrera as the feisty object of Hiccup's affections and a whole slice of the Apatow gang including Kristen Wiig, Christopher Mintz-Plasse and Jonah Hill as other young warriors. Much like WALL-E, Toothless exhibits oodles of personality and is endlessly endearing. To achieve this level of depth is perhaps even more impressive due to the fact that he never utters a word and must emote through non-verbal means.\nAlong with Kung Fu Panda this movie represents the highest ilk of the Dreamworks repertoire and that is not a backhanded compliment by any means. Like Panda, there are thrilling and well choreographed action sequences to compliment the heart, and plenty of humour to keep this from becoming too much of a dramatic slog for younger theatre goers. Teenager or adult, fan or animation or not if you like truly good cinema, you will not be unsatisfied by How to Train Your Dragon.\nRead all my reviews at simonsaysmovies.blogspot.com"
  },
  {
    "rating": "8",
    "title": "Most moving, spiritually enriched 3D movie you have ever seen!",
    "text": "I am not at all interested in dragons and all such fantasy creatures. I don't like children movies with all their stupid messages. I saw this movie rather just to pass the time than to watch it for its sake. And Whoa! I was drawn in this river in first 5 minutes. And what a experience it has been! Right from the start as the narrator describes his world, you are immediately there. You feel yourself in the characters place. The movie does that for you. This is very uncommon movie and it has set a milestone for 3D, not because of its technical aspects, but because of the Depth this movie has. This movie is as much for a 7 year old as it is for an old man who has seen a lot of life. This movie will entertain each viewer in his own way. This is a masterpiece! This movie isn't what it sounds on the surface. It has layers of meanings attached to it. Look at just the title: How to train your Dragon!. If you see it carefully you will notice that there is more to it than meets the eye. Watch the movie and you will know what i mean. This movie cleverly comments on Human Fear, War, Friendship, prejudices, courage, Love. ........................... Don't miss this movie or you will miss one of the few periods when you really LIVE. Note: Just remember to carry your heart with you when you see this movie. It will fill your heart with nothing but what should truly belong there. 10/10."
  },
  {
    "rating": "10",
    "title": "One of the most Breathtaking Animated Films of all time.",
    "text": "I watched How to Train Your Dragon about 5 times now, and it never gets boring. It actually keeps on getting better and better with with more and more views. This is a huge accomplishment for DreamWorks Animation, it might actually be its Best Animated Feauture it yet. It is an amazing experience to watch this film in Cinema. The 3D is amazing and at times Breathtaking. I may of had the most fun that I've ever had in Cinema watching How to Train Your Dragon.\nThe script is really good and is has a lot of dramatic depth. This movie is for everyone. Adults and Kids will enjoy it equally and will love it at the end. This movie will probably become a series like Shrek. But I'm hoping this film doesn't get bad sequels like Shrek 3 and Shrek Forever After. Anyways this film will be most recognized for its beautiful animation.\n10/10 Highly Recommended"
  },
  {
    "rating": "10",
    "title": "Wonderful movie, a must see 3D",
    "text": "I saw the trailer and I enjoyed it but I was afraid that all the good parts from the movie will be there and that will be all, like it was with many films lately. That was certainly not the case. There are way better parts that were left to be discovered and I definitely congratulate the choice.\nI didn't read the book, so I don't know the story, witch might have suffered, as stories usually do from books to picture, but I think a writer couldn't hope for a better image, better portraits of characters, especially the black dragon who one definitely falls in love with - the mimic and the gestures and the face expressions, so complex and real. \nI agree it's not the kind of movie that makes you keep thinking too much once it's finished bot it's not meant to be. It's just lovely, from the beginning to the end, I really laughed and I was anxious for the characters when they suffered (and I'm 22). The film wasn't too long, it didn't have stupid lines whatsoever and it put to silence the annoying child behind me from the first five minutes or so, which I believe says it all.\nI don't know if I will actually go to the cinema but I definitely want to see it again. \nGreat special effects and, again, a very lovely dragon."
  },
  {
    "rating": "10",
    "title": "Truly Moving Picture",
    "text": "N/A"
  },
  {
    "rating": "10",
    "title": "A Nutshell Review: How to Train Your Dragon",
    "text": "If this is done following the same old beat up formula that Hollywood sticks to with regards to animation, then the dragons will be yakking non-stop. Thank goodness that this film, directed by Dean DeBlois and Chris Sanders, avoids this like the plague, and \nJay Baruchel voices Hiccup, a viking kid who happens to be more brains than brawn, more scrawny than buffed, and this of course sets him apart from the rest of his warrior clan folks, who are battle scarred from the constant defense of the village pests - dragons who come from afar to plunder their livestock and setting their houses on fire, so much so that every house on the block is relatively brand new. Wanting to help out in any way he can, he's deemed more of a liability than an asset, especially when even his dad Stoick (Gerard Butler) cannot appreciate his unique, technical talent.\nIn a stroke of uncanny luck, Hiccup downs a flying dragon in the heat of battle, and his compassion meant to set the dragon free, rather than trying to prove himself to be a worthy viking man by killing it. And it's a rare specimen of a dragon too, which would have brought him instant glory. So a bond between man and mythical beast gets struck, and christened as Toothless, this is one pest who slowly grows into a pet, with Hiccup's secret rendezvous resulting in growing appreciation for the species, despite what the knowledge that his kinsman had compiled into a Dragon compendium which details facts all ending with an advisory on compulsory annihilation.\nThe story here is the strength of the film, being witty, smart but never condescending nor insulting the intelligence of the audience. While most characters are caricatures, especially Hiccup's peers, a lot of effort have been put into creating the leads as multi-dimensional and full of heart, and I enjoyed how the characters are so open to their emotions, that it becomes a lot more real than the photo realistic 3D animation and effects. Sure there's the usual father-son misunderstanding and expectations, and how a zero turns to hero, or even the theme of fearing something that we don't fully comprehend, but it's the manner in which the usual got delivered, that made all the difference. Especially so for its anti-war stance, that all it takes is a little step back from the common battle-cry, and instead seek to be understood, by holding out an olive branch, and to understand first.\nFor those who enjoy the mythology of the dragon creature, there are a number of ideas thrown up in the film that would make you nod in appreciation how these got conjured up for the film, and they worked wonders, even though they may be a tad predictable plot wise. And I'm betting that a lot of folks out there will take to Toothless, thanks to its \"stitch\"-ish design similar to Lilo and Stitch (since it's co-director Chris Sander's previous work) and huge saucer like eyes, plus a lovable demeanour built into the character that's always apprehensive, and mischievous. Being the creature that has no track record also helped, since it ropes you into a journey of friendship, bonding and discovery with Hiccup as to how powerful his new found friend can be, not to mention how symbiotic their relationship will evolve into as well.\nAction junkies will find the action sequences in the film faultless, and the 3D got specifically crafted for certain set action pieces that really had me ducking for cover, for once. Fights are incredible, and always accompanied either by humour that worked without the feeling that it was deliberate nor just tried too hard, coupled with the comedic voice talents such as Jonah Hill and Christopher Mintz-Plasse.\nHow to Train Your Dragon is similar to last year's Cloudy With a Chance of Meatballs - Long titles, great story, beautiful animation and a total delight. Highly recommended, and it goes into my list as contenders for best films of this year!"
  },
  {
    "rating": "N/A",
    "title": "Why I gave it 10",
    "text": "I'm not a big fan of animation but I like this movie very much. I consider this is the greatest animation movie created so far. This movie is constituted by great story line, splendid background music, amazing animation and breathtaking brawls.\nAs for the story line, I can tell that it is very unique as well as heart touching. That's one thing, you will definitely enjoy while watching the movie. One will enjoy wild but growing friendship between Hiccup and the dragon. A good story line along with satisfactory and delightful background music makes this movie prominent.\nOn the other hand superb and impeccable animation will draw you into the chair until the movie is finished. Fight scenes are spectacular and humorous. I'm pretty sure that after watching this movie everyone will watch it multiple times."
  },
  {
    "rating": "7",
    "title": "Fabulous Film To Begin A Fine Fantasy Animated Franchise",
    "text": "This is a great beginning to a remarkable franchise. All viewers will enjoy watching this. I certainly did. The storyline was strong and wild. It held itself throughout the instalment and to the whole franchise. The cast selection was truly spectacular. They really committed and connected to the storyline and to their respective characters.\nThis instalment and franchise reveals to viewers that it is possible for humans and creatures to form a friendship and bring peace to all. I do not have friends. I never have been good with people. It also shows the bravery and courage that anyone can have. This is a great beginning to the franchise that everyone will enjoy."
  },
  {
    "rating": "10",
    "title": "A heartfelt movie with a beautiful message",
    "text": "There are a lot of excellent reviews out there, I will just discuss a single point. What got to me the most in this movie is the message I got out of it, I got it from a single line uttered by the hero and it just burned in my memory, it's about how when we look deep in the eyes of our enemies -the ones we fear the most- we will see that they are afraid of us just as we are afraid of them, we might realize their humanity and that they are not what we thought, monsters.\nThis is definitely one of the best 2 animation movies this year, with Toy Story 3 being the other one, tough job for the academy awards this year, and hope this is the case every year.\nIt's nice to see beautiful animation movies challenging Pixar's, it definitely benefits the viewer the most. How to train your dragon - Highly Recommended."
  },
  {
    "rating": "7",
    "title": "What are we to do About the DRAGON! THE DRAGON!",
    "text": "Dean DeBlois and Chris Sanders have done it again. The directing duo that brought Disney \"Lilo & Stitch\", has now made a brilliant film for Dreamworks. In similar fashion to their previous work, we have an unlikely human creature friendship. They have a real talent for making unusual animals that are both parts frightening and adorable. They also take some tired storytelling tropes and do it with such likable characters that you forgive the clichés.\nWhat keeps me from rating this as high as most is the underwhelming ending and the tired, predictable story beats.\nIf you ever get the chance to watch this film in theatres in 3D, do not hesitate. The movie is beautiful in animation and in music. It is a delight for the eyes and ears.\nThe movie has a lot of grit to it. It is not toothless."
  },
  {
    "rating": "9",
    "title": "this is why you go to the movies",
    "text": "incredible! certainly the front runner for the best animated film of the year. from the first to the last frame this film is as good as an animated film gets on almost every level. beautifully written, designed and executed. though an incredible movie, it's not quite perfection - probably due to time and budget limitations (is there ever enough of either?). that said, the problems i had are far too few to mention. if dragon doesn't absolutely slay at the box office i'll lose faith in middle America. \ncongrats to the filmmakers - you've made a masterpiece and you made me feel like a kid again. thank you."
  },
  {
    "rating": "7",
    "title": "Visually entertaining",
    "text": "There's lots of very dynamic exciting action in this movie and it's mostly done with a cheerful fun tone most of the time even though there's still danger. However, despite that lack of \"realism\", I do think that adults will enjoy it a lot too. The story is not the most original (except for the original premise) but it's very well told, with good character development and has a fairly good morale for those into that. The effects and animation is stunning. Very well done.The story was entertaining to watch and it didn't really drag on like other animated films. One thing I didn't really like, is that there's a part of the ending that we've seen a hundred times before especially in kids movies and I would have preferred a little more originality there or at least see it better done because I didn't really buy into it. Very clichéd and should have been better in my opinion"
  },
  {
    "rating": "1",
    "title": "HTTYD fans...",
    "text": "I'm putting this at 1 star because everyone comes straight here, especially for such an incredible film like this. I'm also sorry to everyone else in this comment section. I'm sorry that you're so angry that this film for kids was not as accurate as you were picturing.\nThe 1-star community has made some valid points for why this movie is bad however I disagree and I will disprove all of them.\n1.\n\"The voice acting is TERRIBLE\" I disagree. Ruffnut and Tuffnut are perfect, Gobber is perfect, Stoick the Vast perfect, and even Hiccup is perfect, maybe not your stereotypical male voice actor but for this particular role, Hiccup is meant to be portrayed as a scrawny teenager, so I think the voice actor crushes the prompt.\n2.\n\"It's a feminist film and makes Hiccup look weak\" Yes Hiccup is a weak character at the beginning of the film, its called a character arc buddy. He shows manly characteristics like bravery and courage and again he's meant to be a scrawny character for YOUNG boys to look up to. I'm sorry I'm you watched this and were expecting John wick. Plus at the end you can't say tons of young boys aspired to be him as he rode a dragon and defeated an actual video game final boss. Also, there are several other more masculine characters like Stoick and Gobber. Also, there are two female characters so how can this be a film for girls.\n3.\n\"The animation is terrible\" This one is pretty subjective I think the animation is beautiful, especially the flying scenes, but honestly what were you expecting It was made in 2010. Also, it wasn't trying to be perfectly accurate to reality, polar express did that and it did not look natural, and I think that's part of the charm of animation it doesn't have to be grounded in reality.\nSomeone said it defeats the purpose of the movie when they fight the bad dragon at the climax, which doesn't make sense. They're trying to show the contrast between good dragons and bad dragons obviously all dragons aren't the same and plus the good dragons help to defeat the big final dragon so how can you say that, that implies that all dragons are bad.\nI believe one of the one-star comments said \"If you like this movie you are a nerd who wears glasses and plays World of Warcraft\" First off you are implying glasses are bad or somehow a skill Issue, that bad vision is acquired by some fault of the wearer which is not true you're born with bad vision or you slowly lose your vision throughout your life and if you have a problem with that you should take it up with God. Also, I love this movie and I don't play World of Warcraft nor do I wear glasses\nIf I missed anything just leave a comment, I have an open mind, but so far all the stuff y'all have said is either subjective, requires context, or is simply wrong."
  },
  {
    "rating": "10",
    "title": "Hiccup a young Viking befriends Toothless, a young dragon.",
    "text": "Hiccup a young Viking befriends Toothless, a young dragon. This is the best movie I've seen since the \"Lord of the Rings\" trilogy. Virtually everything about it is wonderful. Rarely have I been so drawn in to an animated movie. The 3D aspects are thrilling and the movie has a great story, amazing animation, non stop action and a positive and constructive message. It made me want to go out and get a pet dragon. This movie is perfect for people of all ages. Now I know what a feel good movie is. This movie will make everyone feel good. Congratulations to all who contributed to this amazing film. It will make toy dragons a popular gift item. Hope to see it again and again. 3D at it's best."
  },
  {
    "rating": "10",
    "title": "A Beautiful Tale Of Adventure And Friendship For People Of All Ages",
    "text": "Warning: this beautifully animated tale is highly addictive! As soon as it's over you'll immediately want to watch it again. I'm a grown man, but somehow this movie managed to ignore all the layers of cynicism and fake toughness we grown-ups tend to build around ourselves to cope with life; it cut right through to the wide-eyed, adventure-loving boy in me, right through to the heart. It's impossible not to fall in love with this movie, with these characters - especially if you love wild animals. This beautiful story of a very unlikely friendship between a boy who's a bit of an outcast and a dragon is just so well done; it's never cheesy, yet full of passion, and there's simply not a dull moment in it.\nAnd although it's very funny, this really isn't just an accumulation of gags and one-liners loosely held together by a paper-thin story: this is a great adventure and touching coming-of-age tale where the protagonist has an actual arc; it tells an intelligent and compelling story about people who are not just one-note characters, and they're wonderfully realized through the great voice-work of such actors as Jay Baruchel, America Ferrera, Gerard Butler and Craig Ferguson. The animation is fantastic, and there's so much playful creative energy at display in the design of the characters - especially in the design of all the different dragon species - that it's simply a joy to watch. 10 stars out of 10."
  },
  {
    "rating": "10",
    "title": "a definite must see",
    "text": "This has to be one of the best films I've seen with my family.\nThe characters came to life and was instantly hooked.\nI've young children and they hardly flinched throughout. The draw to the screen was virtually magnetic.\nA definite must see for all the family, and the 3d version bought it to life, totally!!\nThe story was well written, even though I must admit the start was a bit slow, but all in all well done dream-works. You've another winner on your hands here.\np.s. can't stop talking about it, and its been a week since I've seen it- I can see Oscars in the not too distant future."
  },
  {
    "rating": "10",
    "title": "More mature than \"Shrek\"-probably one of the best animated features ever made.Worth seeing",
    "text": "This was one of the moments, when you feel so overwhelmed by a movie, that you want to see it again immediately.And when i think of how the whole movie-going began-a theater, full of annoying, noisy kids, 3-th graders mostly.\nBut in the end, you realize you haven't spent any time listening to them, because you are so fascinated by the movie.You feel you are alone in the otherwise overcrowded theater.This feeling is very precious and when you realize it, you know you loved it.\nThe whole idea is very interesting-alternate Dragon-fighting times, an era of vikings and so many kinds of winged creatures.The main character, Hiccup, is the son of a mighty Dragon fighter-Stoick, who is the vikings chief as well.He wants to teach his son the Dragon fighting ways of the vikings, but the boy befriends one of the Dragons, a very rare kind, almost impossible to find.He names it Toothless and they are in for a lot of adventures.\nThe movie is very fresh, but solid and strong as well.And considering it is an animation, the voice performances are very good.That is also important.But the truly strongest sides of the movie are the heart of the movie-it is really a moving picture, but i think, that the level of maturity of the movie is higher, than DreamWorks's previous efforts like \"Shrek\".It is more meaningful, and although it is a Dragon-fighting story it is more real than most of the studio's previous tries in this genre and definitely a step up in animation.The feelings, the emotions, that were expressed throughout made this animation such a memorable experience, and i'm sure, i won't be able to forget it, at least not soon.\n\"How to Train Your Dragon\" is a new, fresh, different start in the animation genre, with a lot of heart and emotions.I think, that's one of the best animations ever made.I recommend it to everyone-from parents with children to more experienced moviegoers and for the more mature audiences as well.\n\"How to Train Your Dragon\" is the best movie this year so far, and a honestly moving picture.An animation masterpiece!\n*****/*****"
  },
  {
    "rating": "N/A",
    "title": "Night Fury; Flight",
    "text": "The first major film where the agent takes a stake. This is sending shivers through CAA whose power resides in control of the performing talent. The old school agents and the performing talent have distorted the product. This business of animation studios and literary agents is likely to distort things in an equally damaging way. But for now, the shift is visible, welcome and exciting as getout.\nThis is actually written. It grows from within as good writing should rather that seeming like a desired shape made of chicken wire and filled with ordinary bits. Yes, we still have the moralizing because otherwise parents wouldn't think they were parenting. The rendering is cutting edge.\nBut what sets this apart is the use of space. Most folks don't notice this, but we have come a long, long way in five years. I have been following the advances in this. I'll say that if you have not been watching movies in that period, this could make you a bit dizzy because you will not have been walked through the incremental steps in our new spatial imagination.\nThe core quality of cinema is that the filmmaker gets to design your eyes. From the beginning, intelligent filmmakers have experimented with what character the camera might have. This is behind all the filmmakers I believe are great; each added and exploited some new character of eye.\nWith animation, and 3D modeling, it became feasible for the camera to behave in ways that a physical camera could not. Some filmmakers deliberately made their artificial cameras behave like old fashioned ones; perhaps they did not have the skills to move into unusual territory, but I think in most cases the decision was to make the fake world seem real by having the eye treat it as if it were real.\nTwo centers of innovation were WETA (Peter Jackson's shop) and Pixar. Both experimented heaving with vertical motion and depth. Much of this was in flight, sometimes through water. We have precedents, starting with Hell's Angels and slowly working through Star Wars (the original). Then an explosion, and experiments in often overlooked films: King Kong, Treasure Planet, Van Helsing. Now we have the two schools in full bloom.\nIndependently, Dreamworks just couldn't get its groove in animation. Heaven knows they tried to catch up, but they always seemed to be working in space left over from someone else. Here the agent-producer seems to have hired some real spatial talent and let them have control. Even the opening sequence where we see the village and then an attack is spatially thrilling.\nLuckily, we have two 3D dragonflight movies playing side by side so we can see the two camps compared. Avatar uses WETA and the WETA philosophy. This has the camera as a companion in flight with its own distinct flight path. The excitement is in jumps not in the motion being shown, but the place of the camera.\nThis film adopts the Pixar philosophy which uses POV and POV-inspired notions heaving. In this notion, we are ghosts that can place ourselves anywhere we wish so as to see thing better. We do move, and our eyes do, but motivated by discovery rather than participation.\nCompare in particular the idea of falling in love as shared, dangerous flight.\nThrilling. Simply trilling. We are seeing the birth of a new medium and will dream differently tomorrow.\nTed's Evaluation -- 3 of 3: Worth watching."
  },
  {
    "rating": "7",
    "title": "How to Train Your Dragon",
    "text": "N/A"
  },
  {
    "rating": "10",
    "title": "If you feel that Toy Story and Shreck are missing SOMETHING IMPORTANT - this movie is for you",
    "text": "It's far better then all those Shrecks, Toy stories, Ratatoulies, Puss in boots, Mega-minds and other \"renewing\" concepts. Why? It's simple and honest. This movie doesn't TRY to be funny, modern, super-wise, and \"for all\". It's not one of those \"hey-let's-make-a-movie-about-cat-who-is-a-super-spy\" concepts. This movie JUST tells the simple yet very good story in the most proper way.\nI have seen a lot of 3D animated movies - American, European, Asian. This one hits 10 in my opinion, because it's by far the most complete vision enclosed in a 3D animated form. But - in addition - it's a pure fairy tale in the core. And I mean PURE - from the cores of fairy-telling, which is the most polite, elegant way of TEACHING important stuff. I think that 3D movie is not only craftsmanship behind creating artificial environment, animating believably, lighting sets with care, etc., etc. Like any other movie - it should be a well told story, which will left you ...CHANGED a bit (that's what fairy tales do, right?) Only those kind of stories will matter in your life. Rest is just \"fun\".\n'How to train your dragon' is a modern fairy tale. It's modern because - like other mainstream 3D movies - it's excellently crafted. We have here great animation (Toothless, the dragon is \"made of life\", so to speak - you actually just want to HAVE one), lighting and cinematography (splendid flight scenes, which take your breath away, and make you climb your chair), effects, etc.... But it's a fairy tale because - above all that - we have here a master degree directing by Dean DeBlois and Chris Sanders too. All those decisions made by them - from very basic (like the look of Toothless and other characters, or editing), to more important (like balancing the amounts of fear, sadness, seriousness and fun tones in the story) are marks of wisdom. And those decisions made a difference between this movie and \"the rest\". Those decisions crafted a SOUL in it. And achieving this \"soul level\" should be a goal of every director.\nSumming up: great movie in at least two aspects. Technically (character design, animation, cinematography, editing) and emotionally (great simple story with surprisingly 'non-hollywoodish' wise moral, fantastic heart-touching score by John Powell, and mature directing which guide you to be changed a bit after watching).\nBest achievement in 3D storytelling since Euclide :)"
  },
  {
    "rating": "7",
    "title": "Pretty Good Movie",
    "text": "Rating - 7.9:\nOverall, a pretty good movie that lays the foundation for a memorable franchise and lovable characters like Hiccup, Toothless, and Stoick; but, it is held back by its incredibly fast pace and dated 3D animation.\nDirection - Pretty Good:\nThe direction on a macroscale is very similar to other Dreamworks properties, but they do a good job building this world and showing the grand flying and fight scenes; The direction on a microscale is pretty good as it shows the internal struggle Hiccup has with his father and how he doesn't want to be a Viking or hurt others; The storytelling is pretty similar to other Dreamworks movies and pretty predictable given this is a PG movie\nStory - Pretty Good:\nThe concept is a similar trope to the \"Dances with Wolves\" teen who learns to be with the opposition rather than fight them; though it does so in a way that is palatable for children and makes them care for the dragons and the characters; the plot structure is very linear and formulaic, especially for a DreamWorks property, because the movie is pretty short and the pacing is very fast; the character writing is good as they do paint Hiccup as this multi-dimensional character who has to go against what his father wants for him because of his morals, and they do a good job showing the growth in all the characters\nScreenplay - Good:\nThe dialogue is good and memorable, especially for a PG movie; The humor is mostly attached to your caring about these characters; The symbolism is pretty strong as the movie touches on the tough father-son dynamic between two generations with different morals; The foreshadowing is strong as the movie plants roots that are uprooted towards the end\nActing - Pretty Good:\nJay Baruchel - Pretty Good (Feels a little too old playing this role, but does a pretty good job embodying the awkwardness and nerdy nature of Hiccup), Gerard Butler - Good (Really embodies the character and the big stature the chief has over Berk and the disconnect he has with his son), Craig Ferguson - Pretty Good (He plays his role well and has pretty good chemistry with Baruchel), America Ferrera - Decent to Pretty Good (Plays the female lead decently well but does not really have the best chemistry with Baruchel), Rest of the cast - Decent to Pretty Good (A pretty all-star cast, but it feels like they are just speaking and not really embodying the characters they are portraying)\nScore - Very Good:\nVery memorable score that helps build the world and sets the tone\nEditing - Good:\nSharp and clean\nSound - Good:\nIt helps with building this grand world\nAnimation - Good:\nFor the time, it was probably very good; but this style of CGI animation that DreamWorks was known for in the 2000s has not aged well at all, as the technology looks very out-of-date; something that was going to happen when studios favored technology-dependent 3D animation over timeless 2D animation\nPacing - Pacing is incredibly fast as the movie breezes through the plot to get through its short runtime; Because of these pacing issues, many of the scenes and sequences don't feel like they have time to breathe\nClimax - Climax is executed well but feels very fast and short; Also, the final antagonist does not really make sense the more you think about it\nTone - Tone is similar to other DreamWorks properties, mixed with Norse and dragon mythology."
  },
  {
    "rating": "9",
    "title": "One of my favorite films of the last decade...",
    "text": "...not that this is necessarily saying much, since the films of the past decade are either made for the Academy Awards with some social message that hits the audience over the head with a social justice sledgehammer, or they are action films with lots of car chases and explosions and comic book heroes or they are 50 shades of obscene. But I digress. \nThis animated film is beautiful to watch, but that is not the main drawing point. The drawing point are the characters. Even though this is set in some fictitious land full of Vikings beset with fire breathing dragons who are always raiding their livestock, you can easily relate to everybody. The main character, Hiccup, is the son of the warrior king of the Vikings. Hiccup is mild mannered, lanky, awkward - your typical teen of about age 14. He likes to build and invent things. Dad wants his son to be a dragon slayer. So one day, during an attack by the dragons, Hiccup actually catches one with one of his inventions. He grabs a knife and runs into the forest to kill the dragon to make dad happy. But he just can't. This \"fearsome\" dragon is tame, passive, dog-like before people had dogs. And so \"Toothless\" as Hiccup names him, becomes like a pet to Hiccup. The pair develop this beautiful unbreakable bond. And Hiccup learns about dragons.\nHiccup is signed up for Dragon Killing class with the rest of the island's teens. Hiccup quickly rises to the top of his class but manages to not kill even one dragon. Instead he uses the techniques of bonding with dragons that he has learned from Toothless to subdue them into harmless pets. Nobody questions what is going on but Astrid, a tomboyish teen girl who just knows Hiccup is up to something.\nThis film has genuine laughs, thrills, the real problems of sons and fathers disappointing and misunderstanding one another, the awkwardness of that first romance, and the idea that sometimes your enemy may be your enemy for reasons you don't understand. \nI watched this for about the tenth time last night and I have to say it just never gets old. Highly recommended."
  },
  {
    "rating": "7",
    "title": "How to Train Your Dragon",
    "text": "Who doesn't like films about dragons? This one draws a bit from mythology, stays just the right side of sentimentality and avoids any power ballads as it tells us the tale of the young \"Hiccup\" who is the son of the chief (Gerard Butler) and has a reputation for messing things up when it comes to the Viking's biggest nemesis - the marauding dragon. The young \"Hiccup\" is quite inventive though, and he devises a contraption that despite the scorn and derision of his friends, he reckons might by capture the ultimate in dragonry - the \"Night Fury\". Suffice to say he proves just a bit more successful than he had anticipated and so now has to try and do what it says on the posters. What now ensues entertainingly mixes loads of action adventure with some comedy, tales of derring-do and even some engineering that would have made Michelangelo and Da Vinci proud. It's almost perfectly paced as it rollicks along with a bit of slap-stick, plenty of courage and amiable characterisations as it builds to quite an exciting denouement that I felt had something of the \"Moby Dick\" to it. The quality of the animation is pretty high, though perhaps a little too uniform and static at times on the grand scale scenarios but nothing to spoil a solid story engagingly told that I really quite enjoyed."
  },
  {
    "rating": "4",
    "title": "As a Swede I am mildly offended.",
    "text": "N/A"
  },
  {
    "rating": "9",
    "title": "Genuinely superb and a step forward in 3D films",
    "text": "HTTYD is the latest in a run of animated 3D films to hit the family market. One might be forgiven for feeling a little weary of this genre as the big production studios churn out one \"action-packed film with a cute central character and some pretty effects\" after another. But wait...\nHTTYD stands apart from these other attempts for a number of reasons. First, the 3D (Odeon digital in this screening) is moving more toward the subtle with fewer \"gratuitous\" 3D moments than in movies like Bolt and Coraline. As 3D becomes a staple of high street cinema, directors seem to be finding 3D to be more about adding depth rather than a brief focal-point. That's not to say that there isn't effective use of the 3D wow-factor here; it's just not all the film has to hold attention.\nSecond, a cast of voice talent that does not demand too much consideration of the man/woman behind the microphone is refreshing. Baruchel is not over-playing the sugar or the heroics and, as much as an animated character can be, he is believable and as three-dimensional as the visuals. Butler is not greatly stretched here but manages to stay just the right side of a Mike Myers impression so as not to annoy. How many kids will now think the Vikings were a fearsome race of Americans and Scots? Oh, well! \nThird, the plot and dialogue. You may not know the plot and I won't spoil it now. It is straightforward stuff but the pace keeps it interesting for kids and the grown-ups. Younger children may be upset at times and I heard a sob or two at the emotional moments. Nothing too heavy here though, it's just a well-written script with as many actual laughs as I have seen in a kids' film.\nThis is one of the best films so far in this prolific genre and it has been made with passion rather than thrown together to cash-in on the thirst for these films, right now. I would urge all ages to see this film in 3D as the textures are extraordinary and you can't help but be charmed by it all."
  },
  {
    "rating": "9",
    "title": "Will enamour kids and enthrall adults",
    "text": "With a somewhat unwieldy tile and the lack of the winning Pixar storyline that has dominated the Oscars for a decade, Dreamworks animations latest could have been a clunker. Not only is How to Train Your Dragon the best film of the year so far, but it even eclipses the quality of last years duel academy award winner Up.\nThe latest 3-D film to fly into theatres in so many weeks is also the best of its format (story wise), making Burton's overblown misfire Alice in Wonderland look even more pitiful. Dragon will no doubt enamour kids (excuse the cliché) of all ages while keeping parents not only awake but equally enthralled. This movie is sure to tug the hearts of anyone who has ever loved a pet and will undoubtedly draw tears from those who are so inclined.\nThe texture that can be created from today's CG technology never ceases to amaze. Consider a beautiful tracking shot of a downed dragon where the twisted wing that protrudes towards the screen is actually out of focus, as if you yourself were staring awestruck at the giant lizard that lay before you in real, tangible life. I did not have the pleasure to viewing How to Train Your Dragon in 3-D but I have heard great things and even without having paid a surcharge the film does in no way suffer as a result. The narrative, visuals, writing and voicework is ample reason to seek out Dragon and frankly is the real heart of the movie anyways.\nOn the Island of Berk, the Viking community that lives there does not fear a rival tribe, the weather or disease but rather a much more toothy threat: dragons. Nightly raids by the winged beasts have forged a great hatred upon the tribe and led by the aptly named Stoik the Vast (Gerard Butler) they wage war with the intent to rid themselves of dragons once and for all. This is not a feeling shared by Stoik's scrawny son Hiccup (Jay Baruchel) who favours non-lethal tactics as much as he does blacksmithing. Much to Hiccup's surprise, during one of the aforementioned raids he is able to down a dragon with one of his contraptions. Intent on proving his manhood to Stoik, he seeks out to find the dragon know as a Night Fury but finds himself unable to slay his scaly foe. So begins an unlikely and forbidden friendship with the later named Toothless that follows a time-tested but absolutely rewarding arc that is as enthralling as it is touching.\nJoining Butler and Baruchel, both of whom give excellent performances (with Butler recapturing some of his 300 mojo), are the likes of Craig Fergusson as the Viking blacksmith, America Ferrera as the feisty object of Hiccup's affections and a whole slice of the Apatow gang including Kristen Wiig, Christopher Mintz-Plasse and Jonah Hill as other young warriors. Much like WALL-E, Toothless exhibits oodles of personality and is endlessly endearing. To achieve this level of depth is perhaps even more impressive due to the fact that he never utters a word and must emote through non-verbal means.\nAlong with Kung Fu Panda this movie represents the highest ilk of the Dreamworks repertoire and that is not a backhanded compliment by any means. Like Panda, there are thrilling and well choreographed action sequences to compliment the heart, and plenty of humour to keep this from becoming too much of a dramatic slog for younger theatre goers. Teenager or adult, fan or animation or not if you like truly good cinema, you will not be unsatisfied by How to Train Your Dragon.\nRead all my reviews at simonsaysmovies.blogspot.com"
  },
  {
    "rating": "8",
    "title": "Most moving, spiritually enriched 3D movie you have ever seen!",
    "text": "I am not at all interested in dragons and all such fantasy creatures. I don't like children movies with all their stupid messages. I saw this movie rather just to pass the time than to watch it for its sake. And Whoa! I was drawn in this river in first 5 minutes. And what a experience it has been! Right from the start as the narrator describes his world, you are immediately there. You feel yourself in the characters place. The movie does that for you. This is very uncommon movie and it has set a milestone for 3D, not because of its technical aspects, but because of the Depth this movie has. This movie is as much for a 7 year old as it is for an old man who has seen a lot of life. This movie will entertain each viewer in his own way. This is a masterpiece! This movie isn't what it sounds on the surface. It has layers of meanings attached to it. Look at just the title: How to train your Dragon!. If you see it carefully you will notice that there is more to it than meets the eye. Watch the movie and you will know what i mean. This movie cleverly comments on Human Fear, War, Friendship, prejudices, courage, Love. ........................... Don't miss this movie or you will miss one of the few periods when you really LIVE. Note: Just remember to carry your heart with you when you see this movie. It will fill your heart with nothing but what should truly belong there. 10/10."
  },
  {
    "rating": "10",
    "title": "One of the most Breathtaking Animated Films of all time.",
    "text": "I watched How to Train Your Dragon about 5 times now, and it never gets boring. It actually keeps on getting better and better with with more and more views. This is a huge accomplishment for DreamWorks Animation, it might actually be its Best Animated Feauture it yet. It is an amazing experience to watch this film in Cinema. The 3D is amazing and at times Breathtaking. I may of had the most fun that I've ever had in Cinema watching How to Train Your Dragon.\nThe script is really good and is has a lot of dramatic depth. This movie is for everyone. Adults and Kids will enjoy it equally and will love it at the end. This movie will probably become a series like Shrek. But I'm hoping this film doesn't get bad sequels like Shrek 3 and Shrek Forever After. Anyways this film will be most recognized for its beautiful animation.\n10/10 Highly Recommended"
  },
  {
    "rating": "10",
    "title": "Wonderful movie, a must see 3D",
    "text": "I saw the trailer and I enjoyed it but I was afraid that all the good parts from the movie will be there and that will be all, like it was with many films lately. That was certainly not the case. There are way better parts that were left to be discovered and I definitely congratulate the choice.\nI didn't read the book, so I don't know the story, witch might have suffered, as stories usually do from books to picture, but I think a writer couldn't hope for a better image, better portraits of characters, especially the black dragon who one definitely falls in love with - the mimic and the gestures and the face expressions, so complex and real. \nI agree it's not the kind of movie that makes you keep thinking too much once it's finished bot it's not meant to be. It's just lovely, from the beginning to the end, I really laughed and I was anxious for the characters when they suffered (and I'm 22). The film wasn't too long, it didn't have stupid lines whatsoever and it put to silence the annoying child behind me from the first five minutes or so, which I believe says it all.\nI don't know if I will actually go to the cinema but I definitely want to see it again. \nGreat special effects and, again, a very lovely dragon."
  },
  {
    "rating": "10",
    "title": "Truly Moving Picture",
    "text": "N/A"
  },
  {
    "rating": "10",
    "title": "A Nutshell Review: How to Train Your Dragon",
    "text": "If this is done following the same old beat up formula that Hollywood sticks to with regards to animation, then the dragons will be yakking non-stop. Thank goodness that this film, directed by Dean DeBlois and Chris Sanders, avoids this like the plague, and \nJay Baruchel voices Hiccup, a viking kid who happens to be more brains than brawn, more scrawny than buffed, and this of course sets him apart from the rest of his warrior clan folks, who are battle scarred from the constant defense of the village pests - dragons who come from afar to plunder their livestock and setting their houses on fire, so much so that every house on the block is relatively brand new. Wanting to help out in any way he can, he's deemed more of a liability than an asset, especially when even his dad Stoick (Gerard Butler) cannot appreciate his unique, technical talent.\nIn a stroke of uncanny luck, Hiccup downs a flying dragon in the heat of battle, and his compassion meant to set the dragon free, rather than trying to prove himself to be a worthy viking man by killing it. And it's a rare specimen of a dragon too, which would have brought him instant glory. So a bond between man and mythical beast gets struck, and christened as Toothless, this is one pest who slowly grows into a pet, with Hiccup's secret rendezvous resulting in growing appreciation for the species, despite what the knowledge that his kinsman had compiled into a Dragon compendium which details facts all ending with an advisory on compulsory annihilation.\nThe story here is the strength of the film, being witty, smart but never condescending nor insulting the intelligence of the audience. While most characters are caricatures, especially Hiccup's peers, a lot of effort have been put into creating the leads as multi-dimensional and full of heart, and I enjoyed how the characters are so open to their emotions, that it becomes a lot more real than the photo realistic 3D animation and effects. Sure there's the usual father-son misunderstanding and expectations, and how a zero turns to hero, or even the theme of fearing something that we don't fully comprehend, but it's the manner in which the usual got delivered, that made all the difference. Especially so for its anti-war stance, that all it takes is a little step back from the common battle-cry, and instead seek to be understood, by holding out an olive branch, and to understand first.\nFor those who enjoy the mythology of the dragon creature, there are a number of ideas thrown up in the film that would make you nod in appreciation how these got conjured up for the film, and they worked wonders, even though they may be a tad predictable plot wise. And I'm betting that a lot of folks out there will take to Toothless, thanks to its \"stitch\"-ish design similar to Lilo and Stitch (since it's co-director Chris Sander's previous work) and huge saucer like eyes, plus a lovable demeanour built into the character that's always apprehensive, and mischievous. Being the creature that has no track record also helped, since it ropes you into a journey of friendship, bonding and discovery with Hiccup as to how powerful his new found friend can be, not to mention how symbiotic their relationship will evolve into as well.\nAction junkies will find the action sequences in the film faultless, and the 3D got specifically crafted for certain set action pieces that really had me ducking for cover, for once. Fights are incredible, and always accompanied either by humour that worked without the feeling that it was deliberate nor just tried too hard, coupled with the comedic voice talents such as Jonah Hill and Christopher Mintz-Plasse.\nHow to Train Your Dragon is similar to last year's Cloudy With a Chance of Meatballs - Long titles, great story, beautiful animation and a total delight. Highly recommended, and it goes into my list as contenders for best films of this year!"
  },
  {
    "rating": "N/A",
    "title": "Why I gave it 10",
    "text": "I'm not a big fan of animation but I like this movie very much. I consider this is the greatest animation movie created so far. This movie is constituted by great story line, splendid background music, amazing animation and breathtaking brawls.\nAs for the story line, I can tell that it is very unique as well as heart touching. That's one thing, you will definitely enjoy while watching the movie. One will enjoy wild but growing friendship between Hiccup and the dragon. A good story line along with satisfactory and delightful background music makes this movie prominent.\nOn the other hand superb and impeccable animation will draw you into the chair until the movie is finished. Fight scenes are spectacular and humorous. I'm pretty sure that after watching this movie everyone will watch it multiple times."
  },
  {
    "rating": "7",
    "title": "Fabulous Film To Begin A Fine Fantasy Animated Franchise",
    "text": "This is a great beginning to a remarkable franchise. All viewers will enjoy watching this. I certainly did. The storyline was strong and wild. It held itself throughout the instalment and to the whole franchise. The cast selection was truly spectacular. They really committed and connected to the storyline and to their respective characters.\nThis instalment and franchise reveals to viewers that it is possible for humans and creatures to form a friendship and bring peace to all. I do not have friends. I never have been good with people. It also shows the bravery and courage that anyone can have. This is a great beginning to the franchise that everyone will enjoy."
  },
  {
    "rating": "10",
    "title": "A heartfelt movie with a beautiful message",
    "text": "There are a lot of excellent reviews out there, I will just discuss a single point. What got to me the most in this movie is the message I got out of it, I got it from a single line uttered by the hero and it just burned in my memory, it's about how when we look deep in the eyes of our enemies -the ones we fear the most- we will see that they are afraid of us just as we are afraid of them, we might realize their humanity and that they are not what we thought, monsters.\nThis is definitely one of the best 2 animation movies this year, with Toy Story 3 being the other one, tough job for the academy awards this year, and hope this is the case every year.\nIt's nice to see beautiful animation movies challenging Pixar's, it definitely benefits the viewer the most. How to train your dragon - Highly Recommended."
  },
  {
    "rating": "7",
    "title": "What are we to do About the DRAGON! THE DRAGON!",
    "text": "Dean DeBlois and Chris Sanders have done it again. The directing duo that brought Disney \"Lilo & Stitch\", has now made a brilliant film for Dreamworks. In similar fashion to their previous work, we have an unlikely human creature friendship. They have a real talent for making unusual animals that are both parts frightening and adorable. They also take some tired storytelling tropes and do it with such likable characters that you forgive the clichés.\nWhat keeps me from rating this as high as most is the underwhelming ending and the tired, predictable story beats.\nIf you ever get the chance to watch this film in theatres in 3D, do not hesitate. The movie is beautiful in animation and in music. It is a delight for the eyes and ears.\nThe movie has a lot of grit to it. It is not toothless."
  },
  {
    "rating": "9",
    "title": "this is why you go to the movies",
    "text": "incredible! certainly the front runner for the best animated film of the year. from the first to the last frame this film is as good as an animated film gets on almost every level. beautifully written, designed and executed. though an incredible movie, it's not quite perfection - probably due to time and budget limitations (is there ever enough of either?). that said, the problems i had are far too few to mention. if dragon doesn't absolutely slay at the box office i'll lose faith in middle America. \ncongrats to the filmmakers - you've made a masterpiece and you made me feel like a kid again. thank you."
  },
  {
    "rating": "7",
    "title": "Visually entertaining",
    "text": "There's lots of very dynamic exciting action in this movie and it's mostly done with a cheerful fun tone most of the time even though there's still danger. However, despite that lack of \"realism\", I do think that adults will enjoy it a lot too. The story is not the most original (except for the original premise) but it's very well told, with good character development and has a fairly good morale for those into that. The effects and animation is stunning. Very well done.The story was entertaining to watch and it didn't really drag on like other animated films. One thing I didn't really like, is that there's a part of the ending that we've seen a hundred times before especially in kids movies and I would have preferred a little more originality there or at least see it better done because I didn't really buy into it. Very clichéd and should have been better in my opinion"
  },
  {
    "rating": "1",
    "title": "HTTYD fans...",
    "text": "I'm putting this at 1 star because everyone comes straight here, especially for such an incredible film like this. I'm also sorry to everyone else in this comment section. I'm sorry that you're so angry that this film for kids was not as accurate as you were picturing.\nThe 1-star community has made some valid points for why this movie is bad however I disagree and I will disprove all of them.\n1.\n\"The voice acting is TERRIBLE\" I disagree. Ruffnut and Tuffnut are perfect, Gobber is perfect, Stoick the Vast perfect, and even Hiccup is perfect, maybe not your stereotypical male voice actor but for this particular role, Hiccup is meant to be portrayed as a scrawny teenager, so I think the voice actor crushes the prompt.\n2.\n\"It's a feminist film and makes Hiccup look weak\" Yes Hiccup is a weak character at the beginning of the film, its called a character arc buddy. He shows manly characteristics like bravery and courage and again he's meant to be a scrawny character for YOUNG boys to look up to. I'm sorry I'm you watched this and were expecting John wick. Plus at the end you can't say tons of young boys aspired to be him as he rode a dragon and defeated an actual video game final boss. Also, there are several other more masculine characters like Stoick and Gobber. Also, there are two female characters so how can this be a film for girls.\n3.\n\"The animation is terrible\" This one is pretty subjective I think the animation is beautiful, especially the flying scenes, but honestly what were you expecting It was made in 2010. Also, it wasn't trying to be perfectly accurate to reality, polar express did that and it did not look natural, and I think that's part of the charm of animation it doesn't have to be grounded in reality.\nSomeone said it defeats the purpose of the movie when they fight the bad dragon at the climax, which doesn't make sense. They're trying to show the contrast between good dragons and bad dragons obviously all dragons aren't the same and plus the good dragons help to defeat the big final dragon so how can you say that, that implies that all dragons are bad.\nI believe one of the one-star comments said \"If you like this movie you are a nerd who wears glasses and plays World of Warcraft\" First off you are implying glasses are bad or somehow a skill Issue, that bad vision is acquired by some fault of the wearer which is not true you're born with bad vision or you slowly lose your vision throughout your life and if you have a problem with that you should take it up with God. Also, I love this movie and I don't play World of Warcraft nor do I wear glasses\nIf I missed anything just leave a comment, I have an open mind, but so far all the stuff y'all have said is either subjective, requires context, or is simply wrong."
  },
  {
    "rating": "10",
    "title": "Hiccup a young Viking befriends Toothless, a young dragon.",
    "text": "Hiccup a young Viking befriends Toothless, a young dragon. This is the best movie I've seen since the \"Lord of the Rings\" trilogy. Virtually everything about it is wonderful. Rarely have I been so drawn in to an animated movie. The 3D aspects are thrilling and the movie has a great story, amazing animation, non stop action and a positive and constructive message. It made me want to go out and get a pet dragon. This movie is perfect for people of all ages. Now I know what a feel good movie is. This movie will make everyone feel good. Congratulations to all who contributed to this amazing film. It will make toy dragons a popular gift item. Hope to see it again and again. 3D at it's best."
  },
  {
    "rating": "10",
    "title": "A Beautiful Tale Of Adventure And Friendship For People Of All Ages",
    "text": "Warning: this beautifully animated tale is highly addictive! As soon as it's over you'll immediately want to watch it again. I'm a grown man, but somehow this movie managed to ignore all the layers of cynicism and fake toughness we grown-ups tend to build around ourselves to cope with life; it cut right through to the wide-eyed, adventure-loving boy in me, right through to the heart. It's impossible not to fall in love with this movie, with these characters - especially if you love wild animals. This beautiful story of a very unlikely friendship between a boy who's a bit of an outcast and a dragon is just so well done; it's never cheesy, yet full of passion, and there's simply not a dull moment in it.\nAnd although it's very funny, this really isn't just an accumulation of gags and one-liners loosely held together by a paper-thin story: this is a great adventure and touching coming-of-age tale where the protagonist has an actual arc; it tells an intelligent and compelling story about people who are not just one-note characters, and they're wonderfully realized through the great voice-work of such actors as Jay Baruchel, America Ferrera, Gerard Butler and Craig Ferguson. The animation is fantastic, and there's so much playful creative energy at display in the design of the characters - especially in the design of all the different dragon species - that it's simply a joy to watch. 10 stars out of 10."
  },
  {
    "rating": "10",
    "title": "a definite must see",
    "text": "This has to be one of the best films I've seen with my family.\nThe characters came to life and was instantly hooked.\nI've young children and they hardly flinched throughout. The draw to the screen was virtually magnetic.\nA definite must see for all the family, and the 3d version bought it to life, totally!!\nThe story was well written, even though I must admit the start was a bit slow, but all in all well done dream-works. You've another winner on your hands here.\np.s. can't stop talking about it, and its been a week since I've seen it- I can see Oscars in the not too distant future."
  },
  {
    "rating": "10",
    "title": "More mature than \"Shrek\"-probably one of the best animated features ever made.Worth seeing",
    "text": "This was one of the moments, when you feel so overwhelmed by a movie, that you want to see it again immediately.And when i think of how the whole movie-going began-a theater, full of annoying, noisy kids, 3-th graders mostly.\nBut in the end, you realize you haven't spent any time listening to them, because you are so fascinated by the movie.You feel you are alone in the otherwise overcrowded theater.This feeling is very precious and when you realize it, you know you loved it.\nThe whole idea is very interesting-alternate Dragon-fighting times, an era of vikings and so many kinds of winged creatures.The main character, Hiccup, is the son of a mighty Dragon fighter-Stoick, who is the vikings chief as well.He wants to teach his son the Dragon fighting ways of the vikings, but the boy befriends one of the Dragons, a very rare kind, almost impossible to find.He names it Toothless and they are in for a lot of adventures.\nThe movie is very fresh, but solid and strong as well.And considering it is an animation, the voice performances are very good.That is also important.But the truly strongest sides of the movie are the heart of the movie-it is really a moving picture, but i think, that the level of maturity of the movie is higher, than DreamWorks's previous efforts like \"Shrek\".It is more meaningful, and although it is a Dragon-fighting story it is more real than most of the studio's previous tries in this genre and definitely a step up in animation.The feelings, the emotions, that were expressed throughout made this animation such a memorable experience, and i'm sure, i won't be able to forget it, at least not soon.\n\"How to Train Your Dragon\" is a new, fresh, different start in the animation genre, with a lot of heart and emotions.I think, that's one of the best animations ever made.I recommend it to everyone-from parents with children to more experienced moviegoers and for the more mature audiences as well.\n\"How to Train Your Dragon\" is the best movie this year so far, and a honestly moving picture.An animation masterpiece!\n*****/*****"
  },
  {
    "rating": "N/A",
    "title": "Night Fury; Flight",
    "text": "The first major film where the agent takes a stake. This is sending shivers through CAA whose power resides in control of the performing talent. The old school agents and the performing talent have distorted the product. This business of animation studios and literary agents is likely to distort things in an equally damaging way. But for now, the shift is visible, welcome and exciting as getout.\nThis is actually written. It grows from within as good writing should rather that seeming like a desired shape made of chicken wire and filled with ordinary bits. Yes, we still have the moralizing because otherwise parents wouldn't think they were parenting. The rendering is cutting edge.\nBut what sets this apart is the use of space. Most folks don't notice this, but we have come a long, long way in five years. I have been following the advances in this. I'll say that if you have not been watching movies in that period, this could make you a bit dizzy because you will not have been walked through the incremental steps in our new spatial imagination.\nThe core quality of cinema is that the filmmaker gets to design your eyes. From the beginning, intelligent filmmakers have experimented with what character the camera might have. This is behind all the filmmakers I believe are great; each added and exploited some new character of eye.\nWith animation, and 3D modeling, it became feasible for the camera to behave in ways that a physical camera could not. Some filmmakers deliberately made their artificial cameras behave like old fashioned ones; perhaps they did not have the skills to move into unusual territory, but I think in most cases the decision was to make the fake world seem real by having the eye treat it as if it were real.\nTwo centers of innovation were WETA (Peter Jackson's shop) and Pixar. Both experimented heaving with vertical motion and depth. Much of this was in flight, sometimes through water. We have precedents, starting with Hell's Angels and slowly working through Star Wars (the original). Then an explosion, and experiments in often overlooked films: King Kong, Treasure Planet, Van Helsing. Now we have the two schools in full bloom.\nIndependently, Dreamworks just couldn't get its groove in animation. Heaven knows they tried to catch up, but they always seemed to be working in space left over from someone else. Here the agent-producer seems to have hired some real spatial talent and let them have control. Even the opening sequence where we see the village and then an attack is spatially thrilling.\nLuckily, we have two 3D dragonflight movies playing side by side so we can see the two camps compared. Avatar uses WETA and the WETA philosophy. This has the camera as a companion in flight with its own distinct flight path. The excitement is in jumps not in the motion being shown, but the place of the camera.\nThis film adopts the Pixar philosophy which uses POV and POV-inspired notions heaving. In this notion, we are ghosts that can place ourselves anywhere we wish so as to see thing better. We do move, and our eyes do, but motivated by discovery rather than participation.\nCompare in particular the idea of falling in love as shared, dangerous flight.\nThrilling. Simply trilling. We are seeing the birth of a new medium and will dream differently tomorrow.\nTed's Evaluation -- 3 of 3: Worth watching."
  },
  {
    "rating": "7",
    "title": "How to Train Your Dragon",
    "text": "N/A"
  },
  {
    "rating": "10",
    "title": "If you feel that Toy Story and Shreck are missing SOMETHING IMPORTANT - this movie is for you",
    "text": "It's far better then all those Shrecks, Toy stories, Ratatoulies, Puss in boots, Mega-minds and other \"renewing\" concepts. Why? It's simple and honest. This movie doesn't TRY to be funny, modern, super-wise, and \"for all\". It's not one of those \"hey-let's-make-a-movie-about-cat-who-is-a-super-spy\" concepts. This movie JUST tells the simple yet very good story in the most proper way.\nI have seen a lot of 3D animated movies - American, European, Asian. This one hits 10 in my opinion, because it's by far the most complete vision enclosed in a 3D animated form. But - in addition - it's a pure fairy tale in the core. And I mean PURE - from the cores of fairy-telling, which is the most polite, elegant way of TEACHING important stuff. I think that 3D movie is not only craftsmanship behind creating artificial environment, animating believably, lighting sets with care, etc., etc. Like any other movie - it should be a well told story, which will left you ...CHANGED a bit (that's what fairy tales do, right?) Only those kind of stories will matter in your life. Rest is just \"fun\".\n'How to train your dragon' is a modern fairy tale. It's modern because - like other mainstream 3D movies - it's excellently crafted. We have here great animation (Toothless, the dragon is \"made of life\", so to speak - you actually just want to HAVE one), lighting and cinematography (splendid flight scenes, which take your breath away, and make you climb your chair), effects, etc.... But it's a fairy tale because - above all that - we have here a master degree directing by Dean DeBlois and Chris Sanders too. All those decisions made by them - from very basic (like the look of Toothless and other characters, or editing), to more important (like balancing the amounts of fear, sadness, seriousness and fun tones in the story) are marks of wisdom. And those decisions made a difference between this movie and \"the rest\". Those decisions crafted a SOUL in it. And achieving this \"soul level\" should be a goal of every director.\nSumming up: great movie in at least two aspects. Technically (character design, animation, cinematography, editing) and emotionally (great simple story with surprisingly 'non-hollywoodish' wise moral, fantastic heart-touching score by John Powell, and mature directing which guide you to be changed a bit after watching).\nBest achievement in 3D storytelling since Euclide :)"
  },
  {
    "rating": "7",
    "title": "Pretty Good Movie",
    "text": "Rating - 7.9:\nOverall, a pretty good movie that lays the foundation for a memorable franchise and lovable characters like Hiccup, Toothless, and Stoick; but, it is held back by its incredibly fast pace and dated 3D animation.\nDirection - Pretty Good:\nThe direction on a macroscale is very similar to other Dreamworks properties, but they do a good job building this world and showing the grand flying and fight scenes; The direction on a microscale is pretty good as it shows the internal struggle Hiccup has with his father and how he doesn't want to be a Viking or hurt others; The storytelling is pretty similar to other Dreamworks movies and pretty predictable given this is a PG movie\nStory - Pretty Good:\nThe concept is a similar trope to the \"Dances with Wolves\" teen who learns to be with the opposition rather than fight them; though it does so in a way that is palatable for children and makes them care for the dragons and the characters; the plot structure is very linear and formulaic, especially for a DreamWorks property, because the movie is pretty short and the pacing is very fast; the character writing is good as they do paint Hiccup as this multi-dimensional character who has to go against what his father wants for him because of his morals, and they do a good job showing the growth in all the characters\nScreenplay - Good:\nThe dialogue is good and memorable, especially for a PG movie; The humor is mostly attached to your caring about these characters; The symbolism is pretty strong as the movie touches on the tough father-son dynamic between two generations with different morals; The foreshadowing is strong as the movie plants roots that are uprooted towards the end\nActing - Pretty Good:\nJay Baruchel - Pretty Good (Feels a little too old playing this role, but does a pretty good job embodying the awkwardness and nerdy nature of Hiccup), Gerard Butler - Good (Really embodies the character and the big stature the chief has over Berk and the disconnect he has with his son), Craig Ferguson - Pretty Good (He plays his role well and has pretty good chemistry with Baruchel), America Ferrera - Decent to Pretty Good (Plays the female lead decently well but does not really have the best chemistry with Baruchel), Rest of the cast - Decent to Pretty Good (A pretty all-star cast, but it feels like they are just speaking and not really embodying the characters they are portraying)\nScore - Very Good:\nVery memorable score that helps build the world and sets the tone\nEditing - Good:\nSharp and clean\nSound - Good:\nIt helps with building this grand world\nAnimation - Good:\nFor the time, it was probably very good; but this style of CGI animation that DreamWorks was known for in the 2000s has not aged well at all, as the technology looks very out-of-date; something that was going to happen when studios favored technology-dependent 3D animation over timeless 2D animation\nPacing - Pacing is incredibly fast as the movie breezes through the plot to get through its short runtime; Because of these pacing issues, many of the scenes and sequences don't feel like they have time to breathe\nClimax - Climax is executed well but feels very fast and short; Also, the final antagonist does not really make sense the more you think about it\nTone - Tone is similar to other DreamWorks properties, mixed with Norse and dragon mythology."
  },
  {
    "rating": "9",
    "title": "One of my favorite films of the last decade...",
    "text": "...not that this is necessarily saying much, since the films of the past decade are either made for the Academy Awards with some social message that hits the audience over the head with a social justice sledgehammer, or they are action films with lots of car chases and explosions and comic book heroes or they are 50 shades of obscene. But I digress. \nThis animated film is beautiful to watch, but that is not the main drawing point. The drawing point are the characters. Even though this is set in some fictitious land full of Vikings beset with fire breathing dragons who are always raiding their livestock, you can easily relate to everybody. The main character, Hiccup, is the son of the warrior king of the Vikings. Hiccup is mild mannered, lanky, awkward - your typical teen of about age 14. He likes to build and invent things. Dad wants his son to be a dragon slayer. So one day, during an attack by the dragons, Hiccup actually catches one with one of his inventions. He grabs a knife and runs into the forest to kill the dragon to make dad happy. But he just can't. This \"fearsome\" dragon is tame, passive, dog-like before people had dogs. And so \"Toothless\" as Hiccup names him, becomes like a pet to Hiccup. The pair develop this beautiful unbreakable bond. And Hiccup learns about dragons.\nHiccup is signed up for Dragon Killing class with the rest of the island's teens. Hiccup quickly rises to the top of his class but manages to not kill even one dragon. Instead he uses the techniques of bonding with dragons that he has learned from Toothless to subdue them into harmless pets. Nobody questions what is going on but Astrid, a tomboyish teen girl who just knows Hiccup is up to something.\nThis film has genuine laughs, thrills, the real problems of sons and fathers disappointing and misunderstanding one another, the awkwardness of that first romance, and the idea that sometimes your enemy may be your enemy for reasons you don't understand. \nI watched this for about the tenth time last night and I have to say it just never gets old. Highly recommended."
  },
  {
    "rating": "7",
    "title": "How to Train Your Dragon",
    "text": "Who doesn't like films about dragons? This one draws a bit from mythology, stays just the right side of sentimentality and avoids any power ballads as it tells us the tale of the young \"Hiccup\" who is the son of the chief (Gerard Butler) and has a reputation for messing things up when it comes to the Viking's biggest nemesis - the marauding dragon. The young \"Hiccup\" is quite inventive though, and he devises a contraption that despite the scorn and derision of his friends, he reckons might by capture the ultimate in dragonry - the \"Night Fury\". Suffice to say he proves just a bit more successful than he had anticipated and so now has to try and do what it says on the posters. What now ensues entertainingly mixes loads of action adventure with some comedy, tales of derring-do and even some engineering that would have made Michelangelo and Da Vinci proud. It's almost perfectly paced as it rollicks along with a bit of slap-stick, plenty of courage and amiable characterisations as it builds to quite an exciting denouement that I felt had something of the \"Moby Dick\" to it. The quality of the animation is pretty high, though perhaps a little too uniform and static at times on the grand scale scenarios but nothing to spoil a solid story engagingly told that I really quite enjoyed."
  },
  {
    "rating": "4",
    "title": "As a Swede I am mildly offended.",
    "text": "N/A"
  }
]