[
  {
    "title": "Iberia, a masterclass in mediocrity and customer disdain.",
    "text": "Lack of Professionalism and PassionIberia’s employees consistently display a disturbing lack of commitment and professionalism. There is no trace of mística — no sense of service or pride in their work. Passengers are treated as obstacles, not clients. This toxic attitude permeates every interaction and gives the impression that helping customers is an unwanted chore.Dirty and Deteriorated AircraftMoreover, the physical state of some of their aircrafts is unacceptable. Many planes are in visible disrepair: dirty cabins, worn seats, and unkempt interiors that suggest neglect rather than national pride. The experience often feels closer to a low-cost regional bus than a flagship European carrier.Customer service designed to exhaust you, worse yet is Iberia’s so-called customer service, which is clearly engineered to frustrate. It’s nearly impossible to reach a human being. Their communication channels lead to automated dead ends, delays, and circular excuses — all part of a strategy to wear passengers down until they abandon their claims. This is not inefficiency; it’s deliberateA Culture of Contempt.Iberia does not merely fail at service — it shows open contempt for the people who pay for its existence. The company culture seems to have normalized mediocrity and disregard, and that attitude filters down to every level of the customer journey. Avoid Iberia unless absolutely necessary. If you expect dignity, cleanliness, and even the most basic human decency in service, this airline will not meet your standards. Iberia is not just a disappointment — it’s an insult.",
    "date": "April 13, 2025",
    "rating": "1"
  },
  {
    "title": "Worst business class ever",
    "text": "Was on a Iberia flight from DFW to MAD which delayed a bit more than 2 hours. Due to that we missed our connection to MXP. We had to stay overnight in MAD at our own expense. We were traveling business class bit the customer service didn't care. Don't really want to describe the experience on board....I let you imagine that.",
    "date": "November 01, 2024",
    "rating": "1"
  },
  {
    "title": "Webside",
    "text": "The webside of Iberia is a real nightmare!Impossible to book a flight pretending my name wasn't correct!Fortunately cheap airlines like easyjet and ryanair make your purchase easier !",
    "date": "May 15, 2025",
    "rating": "1"
  },
  {
    "title": "Iberia-Vigo Airport Baggage Handling in Total Disarray",
    "text": "I arrived in Vigo from Venice on Thursday, May 29th, via Madrid. Despite the short connecting flight and the fact that I checked in my suitcase along with two smaller carry-on bags (as requested by staff), my main bag was lost.What’s even more frustrating is that my suitcase has since been located and confirmed to be at Vigo Airport as of yesterday morning—yet it still has not been delivered over 30 hours later. I’m staying just 20 minutes away in Baiona, with no transport, no personal belongings, and only here for a one-week holiday. I’ve been forced to spend money on basic hygiene supplies and emergency clothing, which should never have been necessary.This level of service is completely unacceptable. To make matters worse, when I attempted to call the baggage office at Vigo Airport, a staff member hung up on me—a response that was both unprofessional and deeply disrespectful.At present I still do not have my suitcase. I expect Iberia to treat this situation with the urgency it deserves and to provide a clear resolution without further delay.",
    "date": "May 29, 2025",
    "rating": "1"
  },
  {
    "title": "Disgusting company and shit customer…",
    "text": "Disgusting company and shit customer service. The refund for my eligible flexi flight ticket still has not been refunded. It has passed the 10 working days they claimed and the Indians on the phone keep telling me to wait and wait and no confirmation email was sent and the Indian was even lying to me that they had a technical issue when I called them three days on a roll and none of them mentioned they had an issue but saying I could get the confirmation email within 5-10 minutes.",
    "date": "May 27, 2025",
    "rating": "1"
  },
  {
    "title": "The worst airline",
    "text": "The worst airline. They make you fight weeks to get a refund or how much you need to get on your refund. They are not nice at all on the calls. We paid extra for flexible but they say we dont have flexible and make the process for refund long so you dont request it. Avoid it at all cost so far the worst worst worst I ve ever seen",
    "date": "May 26, 2025",
    "rating": "1"
  },
  {
    "title": "So disappointed in Iberia",
    "text": "So disappointed in Iberia ,booked our flights in advance for a holiday in October months ago then I  had an email to say they have cancelled that flight and put us on a much later flight ,I paid for premium economy and then paid extra for the seats all together in the front row now they have put us all sat in different seats separately and my son doesn’t have a seat at all and there are no more seats available now in premium economy,I keep calling and emailing but getting nowhere there customer service is shocking",
    "date": "May 01, 2025",
    "rating": "1"
  },
  {
    "title": "WORST airline in the world",
    "text": "Bought tickets with a avíos and cash. Was given option to select XL seats at no additional charge. Two of the 4 tickets were changed to unassigned seats on both legs of the round trip. Agent at check in counter started with the standard lie of planes changed, when I said it was the same aircraft she turned extremely rude and started giving other excuses. They are humiliating and know they can do and talk to you anyway they want. Flight was operated by Level but also flew on an Iberia plane before and it was the only time my luggage didn’t make it. Their customer service at the time was awful too. There were issues with the app and the telephone customer agents as well who are poorly trained and/or just incompetent. Food was inedible. The stewardesses were helpful and friendly- that’s about the only positive.",
    "date": "May 22, 2025",
    "rating": "1"
  },
  {
    "title": "Worst airline",
    "text": "Worst airline by a mile, they lost my bag. Systems were terrible, no compensation apology nothing. Got my bag 2 days later - they completely have ruined my trip. What an absolute scam! Would recommend paying more to fly via someone else",
    "date": "May 23, 2025",
    "rating": "1"
  },
  {
    "title": "I paid for an XL seat",
    "text": "I paid for an XL seat, it turns out that their so called XL seats are exactly the same as other seats. No additional space, no other seats.",
    "date": "May 22, 2025",
    "rating": "1"
  },
  {
    "title": "AVOID THIS COMPANY AT ALL COSTS IF YOU…",
    "text": "AVOID THIS COMPANY AT ALL COSTS IF YOU CAN!As someone who travels between 10-30 times a year, I have never consistently had so many problems with any airplane company as I do with Iberia. There are always issues, most of the time caused by Iberia themselves, and they will never help you resolve anything. It has gotten to the point where I try my best to always avoid using this company, and somehow the times that I need to use it because there aren't any alternatives, I always have problems with them without fail (something that has never happened to me before with any other company ever). For your own sake, please avoid this company if you can.",
    "date": "May 22, 2025",
    "rating": "1"
  },
  {
    "title": "We were over 100 people waiting in…",
    "text": "We were over 100 people waiting in Mallorca to check in. Only one agent serving the economy line - one hour to check in. Last time we book with Iberia.",
    "date": "May 21, 2025",
    "rating": "1"
  },
  {
    "title": "Please do not book your flight with…",
    "text": "Please do not book your flight with this airline. The price is not worth the experience. You will have someone head in your lap. I am 5ft and the seat in front of me hit my knees. The staff will not attend to you and you are stuck in claustrophobic situation until you land which is subjected to delays and disorganization getting on and off the plane. Please be aware of the website of seating because it can be difficult to navigate if you want to sit next to someone and they will charge you. I unfortunately got a 100$ charge for changing my seat to what i would consider the cargo hold. Por favor, no reserve su vuelo con esta aerolínea. El precio no compensa la experiencia. Tendrá la cabeza de alguien en su regazo. Mido 5ft y el asiento de delante me tocaba las rodillas. El personal no le atenderá y estará en una situación claustrofóbica hasta el aterrizaje, lo que conlleva retrasos y desorganización al subir y bajar del avión. Tenga en cuenta la página web de asientos, ya que puede ser difícil navegar si quiere sentarse junto a alguien y le cobrarán. Lamentablemente, me cobraron 100 $ por cambiar mi asiento a lo que yo consideraría la bodega de carga.",
    "date": "May 18, 2025",
    "rating": "1"
  },
  {
    "title": "IBERIA owes me CHF 400 since 2023",
    "text": "IBERIA owes me CHF 400 since 2023, and they are still keeping me in circles to not give me my money back. They suspiciously charged one same transaction for the purchase of one single flight ticket via bank transfer, using the same reference and transfer details 3 times, arguing that they only received the transfer once, and it is clearly reported by my bank that the transaction went out three times to IBERIA's bank, Deutsche Bank. On what mind does that make sense? If that was an electronic issue, why should I bear the consequences? Never buy a flight ticket via bank transfer",
    "date": "July 20, 2024",
    "rating": "1"
  },
  {
    "title": "Not to Brazil",
    "text": "Not to BrazilBooked a flight Brussels to Rio de Janeiro, had to cancel because of health. Customer service is unreachable via email, and none of the telephone numbers listed on the site work. I also couldn't cancel the trip in Iberia's booking manager for some reason. This is ancient stuff.",
    "date": "May 12, 2025",
    "rating": "1"
  },
  {
    "title": "I recently had the unfortunate…",
    "text": "I recently had the unfortunate experience of traveling with Iberia Airlines on a flight from Boston to Barcelona, and I feel compelled to share my deeply disheartening journey. From the outset, my anticipation for this once-in-a-lifetime trip to Spain was marred by a severe mishap: the airline lost my baggage.Upon arrival in Barcelona, I eagerly anticipated reuniting with my suitcase, filled with essential items for my stay. However, what awaited me was a shocking realization: my bag was nowhere to be found. I immediately reached out to Iberia’s customer service, hoping for prompt assistance and clarity. Regrettably, what ensued was a frustrating cycle of misinformation and contradictory statements.During my multiple calls to customer service, I was met with a barrage of lies and unhelpful responses from their representatives. Each conversation seemed to unravel further into confusion, as I was given promises of updates and timelines that never materialized. I was told that my luggage would be located and delivered imminently, only to be left waiting and wondering, feeling increasingly abandoned.The sheer incompetence of Iberia’s employees turned what should have been a joyous exploration of Spanish culture into an ordeal overshadowed by anxiety and disappointment. The emotional toll of this loss was significant; I found myself unable to fully immerse in the experiences I had long anticipated, as my thoughts were consumed by the whereabouts of my belongings.This trip was meant to be a celebration of new adventures, yet it became a bitter reminder of the shortcomings in Iberia's service. The lack of accountability and effective communication from the airline not only disrupted my travel plans but also marred the entirety of my experience in Spain.I sincerely hope Iberia acknowledges that customer service is not merely a function of answering calls, but a representation of their brand and the experiences they create for their passengers. I urge potential travelers to consider this account when choosing their airline, as my encounter reflects a disconcerting reality regarding Iberia’s commitment to customer satisfaction.In conclusion, my experience with Iberia Airlines has been profoundly disappointing, and the loss of my baggage, coupled with a lack of competent support, has left a negative impression that I will not soon forget. I hope for a resolution, but more importantly, I hope that Iberia takes steps to ensure that future travelers do not endure the same disheartening experience.",
    "date": "May 06, 2025",
    "rating": "1"
  },
  {
    "title": "My 15 year old travelled for the first…",
    "text": "My 15 year old travelled for the first time alone with iberia. I paid extra for both seat selection and priority boarding. On her return from Madrid to Dublin her seat was double booked. She was already seated when a flight attendant forced her to move seats. She went from a window to aisle seat. The flight attendant was very rude and offered her no help. I have no doubt they knew as a teenager she wouldn't be comfortable complaining. We also have had numerous issues when checking in and they never answer customer service. They are the cheapest airline to Madrid but prepare for an ordeal.",
    "date": "October 25, 2024",
    "rating": "1"
  },
  {
    "title": "I'm trying to change the date of my…",
    "text": "I'm trying to change the date of my flight and I called 6 times and on each call I received a rate price, higher and higher of course, this when the call did not drop after more than 30 minutes spending time and money with the call.It even exceeded the original value of the flight price!Iberia, you're abusing your customers.Do you have the dignity to honestly solve the simple change of my flight date?",
    "date": "May 05, 2025",
    "rating": "1"
  },
  {
    "title": "Compensation Still Unpaid After 3 Months - Unacceptable Customer Service",
    "text": "I am extremely disappointed with Iberia. My baggage was delayed for six days on flight IB0271 (31/01/2025), and although the airline acknowledged responsibility and confirmed a compensation payment of USD 229.82, it has now been over three months, and I have still not received anything.I’ve sent countless emails, filled in the required forms multiple times, and even received written confirmation that the payment was processed. Now, Iberia has stopped replying altogether, and their contact forms don’t even work.This experience has caused me unnecessary expenses, stress, and wasted time, and the company’s handling of it has been disrespectful and unprofessional. I expected more from an international airline. At this point, I’m forced to consider legal action.Travelers, be warned: if anything goes wrong, don’t expect Iberia to treat you fairly or resolve it.",
    "date": "February 28, 2025",
    "rating": "1"
  },
  {
    "title": "WORST customer service",
    "text": "WORST customer service.  They actually told us to RUN when they had a us land late in Madrid - we all did our best but they didn't hold the connect that probably 30 people needed to make.  They shut the door in our faces and told us to go to the desk.  The person at the desk was NO HELP!  DO NOT risk it!  WE had to take them home and same experience - late - and told to RUN!  And now they are making up timing and saying we had plenty of time to make the flight and they will not refund us for a flight we were not allowed on!   Can't stand companies like this! DO NOT FLY IBERIA or American if you can help it.",
    "date": "April 19, 2025",
    "rating": "1"
  },
  {
    "title": "Iberia: poor experience transiting through Madrid",
    "text": "Iberia tout an efficient transfer experience through Madrid, but they didn’t deliver.  My plane from London was delayed by an hour, with no help - not even a text - to make sure I made my connection to Lima.  I did, but Iberia failed to transfer my case to the second plane.  Also my business class seat on the Madrid-Lima plane hadn’t been cleaned, with crumbs everywhere.  And there was no WiFi though the crew made an announcement saying there was.  Iberia is an incompetently run mess.",
    "date": "April 30, 2025",
    "rating": "1"
  },
  {
    "title": "AVOID AT ALL COST",
    "text": "it's been 10 months now and these filths have not paid their dues to me for losing my luggage which disrupted my business trip to Brazil. According to them they sent checks and they did this twice. No tracking number no nothing to prove they did all they're going to say is we got our check back BS. Do yourself a favor AVOID these at all cost. AESPA does not give 2 craps about anything(not really surprised since culture). If you're in the US and you had the unfortunate chance to use these filths report them immediately to the DOT. Hopefully they close down soon!",
    "date": "August 19, 2024",
    "rating": "1"
  },
  {
    "title": "By farrrrr the worst airline ever in…",
    "text": "By farrrrr the worst airline ever in life. They don’t even deserve the one ⭐️. They need to be shutdown ASAP! And their compensation is an absolute insult. The food was 🤢🤢 I’m sure prison food is 10 times better…and the toilets 🤢🤢. The plane was an insult, and definitely had not been cleaned since it had been in operation. There were random hairs and filth/stains everywhere you looked. And the blanket you were given had not been washed, so definitely likely to catch something or be bitten by something. The plane was sooooo dirty that you actually had to wipe your feet when you got off it. If you see Iberia on any of your connecting flights, decline decline decline, and save yourself from the disgust and distress of having to experience such an unsavoury, unsanitary, and unprofessional airline.",
    "date": "October 14, 2024",
    "rating": "1"
  },
  {
    "title": "Iberia don’t care about your carer!",
    "text": "My very kind parents bought me a caravan on a campsite in my favourite area of Spain 2 years ago. I’m disabled and also have over 30 medical conditions and because some of these conditions are very serious and will lower my expected lifespan our NHS provide me with a 24/7 live in carer. Anytime I go to visit Spain I always have to travel with my live in carer. I usually book all of my flights for the whole year after Christmas in their New Year sale. The flights are always British Airways flights from Gatwick to Alicante. Previously I have always booked directly with British Airways and because there’s a high turnover of carers if my carer changes for any reason British Airways have always just required a short email from my care agency manager stating who my carer was and who it was now and within 10 minutes British Airways had changed the name on my carers ticket to the name of who I would be travelling with now. I presumed and was advised that because Iberia was still part of the One World Alliance Group that they should have the same rules. Anyone else in this situation please be very careful and please don’t book with Iberia because I was last in Alicante from 24th March until 10th April and my carer lived in Spain and a few days into my last holiday my carer advised me that she was going to be leaving and so I advised her to talk to the manager of the care agency asap which she did and she agreed to stay on until they got another carer there with me which they managed within about 2 days. Because I still had the return ticket and also 5 other return tickets throughout the year I presumed that Iberia would have the same rules as British Airways but to my shock and horror they said that they didn’t and they told me that it didn’t matter what the circumstances were but they wouldn’t change the name on the carers tickets! I ended up talking to Iberia on the phone about my situation every day for hours on end and to different agents. Most of the agents were very rude, showed no compassion at all and on many times they just cut my call off. I often asked to talk to a supervisor or manager but they always told me that there wasn’t 1 available! I eventually managed to talk to a supervisor who offered to refund my carer tickets into vouchers and told me that if I wanted to use them to book with British Airways then I could because they were all part of One World Alliance. They did deduct £15 off of each ticket though! But otherwise I was happy because I could now book with British Airways and so if there were any further changes with my carers I knew that I would have no problem in getting the name on the ticket changed. The prices had obviously increased though but I tried to book with British Airways the next morning only to be told that they couldn’t accept these vouchers but I could still use them to book British Airways flights but it would have to be done through Iberia! So right back to where I started and having to make more telephone calls to Iberia. I got nowhere and for the whole 2 weeks of that holiday I ended up not going out anywhere on any day because I was always on the telephone trying to resolve my situation but without any success! I will never book with Iberia ever again. However even if you telephone British Airways Executive Club and asked them to change the name on a carers ticket they would probably tell you that they can’t change the name on a carers ticket and it only seems to be British Airways Special Assistance team that are aware that they will change the name on a carers ticket. That team are wonderful and will always do their best for you and treat you with respect. I have the email address for the chief executive of British Airways because I’m sure that he knows his equivalent in Iberia and if he wanted to help me I’m sure that he could but I’ve sent him 2 emails and not heard anything from him. My trips to Spain are the only thing that I’ve got to look forward to now in my life and my next trip is booked for 7th May until 21st May but I don’t know if I’m going to be able to go or not! My average expected lifespan is only 64.7 years! Even if you book a carers ticket with EasyJet but book it at a much later date and even if the price is then much higher EasyJet will sell you it at the same price as you paid for your ticket and so it appears that Iberia seem to treat disabled and sick people worse than EasyJet!",
    "date": "April 22, 2025",
    "rating": "1"
  },
  {
    "title": "Stressful and Catastrophic!",
    "text": "I am deeply disappointed with Iberia’s service. Our flight was cancelled with less than 24 hours' notice. They rebooked us on a Lufthansa flight, but it was 12 hours later, which caused significant inconvenience. As a result, we had to book an extra night at the hotel and, despite already purchasing additional baggage with our original Iberia flight, we were forced to pay again at the airport.We were told that calling Iberia’s customer service would resolve the situation and reimburse us, but the experience was frustrating and unprofessional. After submitting all the necessary receipts and documentation for a refund, the customer service was unresponsive, and we are still fighting for our refund.This whole situation has been stressful and catastrophic. I would never recommend Iberia to anyone. I’ve had better experiences with many low-cost carriers than with this airline. Extremely irresponsible and terrible customer service.",
    "date": "March 28, 2025",
    "rating": "1"
  },
  {
    "title": "Absolutely Never Again",
    "text": "Flew MUC-BCN via Madrid in September and the red flags were waving before I had even gone on the flight. First off for context, as this was a family trip my mother was the one who booked the flight. Everything was fine and looked normal, until the next day where Iberia cancelled my booking without any reason besides 'security reasons'. I tried to ring them and they couldn't even tell me why THEY cancelled the ticket! I thought because my mum was the one who booked that it gave a security message in the system but there are plenty of people whose family pay for their flight tickets. However, based on some reviews, this seems to be a frequent occurrence and at shorter notice. In any case their only advice was to rebook, and the price went up astronomically to which I had to book via third-party which is incredulous for a short-haul European flight. Luckily they refunded my mother's ticket within a couple days. Complete incompetence on their customer service and shocking that they can just cancel your flight as they please. Then, four months later when I board on the actual flight, I am appalled at what I saw. Old, worn seats. Flecks of dust and food particles. Brings shame to Spain as a nation if this is what they consider acceptable for their flagship airline. Additionally, the flight attendants only gave instructions, information, etc in Spanish, which was odd and inconvenient as every airline i have flown on they give instructions in both English + the native language.I will never fly Iberia again unless they improve on their customer service",
    "date": "May 14, 2024",
    "rating": "1"
  },
  {
    "title": "Don't bother to write to customer service",
    "text": "Beyond the details of my horrible experience flying back from Guatemala, I sent a mail to customer service in early January 2025, sent a reminder a month later. It is the end of April and I got no answers, not even a half ass sorry.",
    "date": "January 10, 2025",
    "rating": "1"
  },
  {
    "title": "One of the best airline I travelled…",
    "text": "One of the best airline I travelled from LHR to DSSi feel a comfort journey and it was a very good experience for me",
    "date": "December 21, 2024",
    "rating": "5"
  },
  {
    "title": "Two months of lame excuses...",
    "text": "I have never encountered a customer service team as unhelpful and incompetent as Iberia Plus. I've contacted them five or six times over the same issue (being unable to access my Iberia Plus account) and not a single person has been able to do anything remotely useful. Instead, I’ve been met with lame excuses, generic responses, and completely useless justifications that have gotten me absolutely nowhere.This level of negligence and dismissiveness is unacceptable, especially from a company that operates in the travel industry where customer loyalty is supposed to matter. Iberia, do better.",
    "date": "April 15, 2025",
    "rating": "1"
  },
  {
    "title": "Do not fly Iberia Business Class",
    "text": "The food is terrible, and the service is disappointing. I’m pregnant and was offered cava, and they didn’t prioritize my boarding or seating. I already knew their customer service had a bad reputation, but I expected more from Business Class. Breakfast was offered late and cold—just shortly before landing. The quality of the meals was much worse than on my previous trip, despite the high cost of Business. Overall, they should seriously improve how they treat customers. I felt like they had no consideration for my situation.",
    "date": "April 04, 2025",
    "rating": "1"
  },
  {
    "title": "Never again",
    "text": "First time I've flown with Iberia and I won't be repeating the experience. Ancient plane, hard seats, inadequate legroom if you're over 5 feet two inches and rude cabin crew. The only positive was the flight left on time but otherwise total rubbish.",
    "date": "April 08, 2025",
    "rating": "2"
  },
  {
    "title": "Slow, inefficient, crooks.",
    "text": "They sent me to 3 different lines, costing me 45 minutes, to finally tell me that my gate closed 5 minutes ago. They then wanted 80 euros to fly standby for the next 8 hours. A joke of an airline.",
    "date": "April 10, 2025",
    "rating": "1"
  },
  {
    "title": "Extremely Disappointing Experience with Iberia Airways – Unjustified Seat Downgrade and Poor Customer Service",
    "text": "I recently traveled with Iberia Airways on flight IB0243 from Madrid to San Jose, Costa Rica, on December 27, 2024. Months prior to the flight, I specifically booked and paid extra for seats 21C and 21B, both offering extra legroom and aisle access, to ensure a comfortable journey. The total additional cost was £111.26.A few days before the flight, I received an email from Iberia informing me of a plane change and advising me to select new seats. However, when I tried to choose alternative seats, none were available. I called Iberia’s customer service for assistance, but I was told there was nothing that could be done except to submit a claim form.I filled out the claim form as instructed, but the response I received was a generic apology, stating that aircraft changes sometimes lead to seat reallocation, and offering no meaningful compensation. This dismissive response failed to address my specific concern and left me feeling frustrated and undervalued as a customer.I have been a loyal customer of Iberia for years, but this experience has severely shaken my trust in the airline. Paying for a service and not receiving it, combined with unhelpful customer support, is unacceptable. I urge Iberia to take responsibility for this oversight and reimburse me for the seats I was denied.I hope this review serves as a cautionary tale for future travelers and prompts Iberia to reassess its customer service practices.",
    "date": "December 27, 2024",
    "rating": "1"
  },
  {
    "title": "Don’t use this totally ripoff airline",
    "text": "Terrible, we  paid £1377 each for premium economy seats to Lima and we’ve just been told that the plane type has changed and we are now flying economy and there is no refund.   The economy seats are currently for sale on Expedia for about £744.I’m shocked that an airline can do this and I will never ever fly with Iberia again",
    "date": "April 08, 2025",
    "rating": "1"
  },
  {
    "title": "Terrible service",
    "text": "Terrible service. They forced everybody to queue for the flight 30 minutes before boarding for no reason whatsoever.",
    "date": "April 07, 2025",
    "rating": "1"
  },
  {
    "title": "Disrespectful, reckless, rude",
    "text": "Iberia is the worst airline I've ever travelled with! I had a flight from Germany with a stopover in Madrid and then onwards to Brazil. I checked my luggage in Germany and it was never delivered to me. I filed a complaint directly when I arrived in Madrid, and was told that they knew where the luggage was and would send it to me the next day. I left Madrid four days later for Brazil without my luggage in my hands. Worst of all, I have to call frequently to get an update, and each time I'm told something different. I've heard that they don't know where the suitcase is, that it's in Madrid, and that it's in Germany. The only thing I'm sure of is that the luggage is not with me and it's already been 7 days without my belongings, my clothes and everything I had planned for my business stay in Brazil. They always treat me as if I'm a burden to them, and give very little importance to all the trouble they're causing me.",
    "date": "March 27, 2025",
    "rating": "1"
  },
  {
    "title": "They seem to hate customers",
    "text": "The flight left late, the pilot took no responsibility “it is what it is”. Flight attendants gave wrong information about connecting flights. I missed the connection.  Ground staff gave conflicting information. I was given a voucher for “food” which was tepid undercooked chicken.",
    "date": "February 01, 2025",
    "rating": "1"
  },
  {
    "title": "Never ever Iberia anymore…Booked but Hotline was not availabe and…",
    "text": "Booked but Hotline was not availabe and then i lost 500 Euros cause i could not cancel online. Never ever Iberia anymore",
    "date": "March 30, 2025",
    "rating": "1"
  },
  {
    "title": "Zero Customer Focus",
    "text": "Zero Customer Focus. I wrongly booked a flight and could only remburse by the hotline not online. The hotline let me stay for very very long time (hours) in the waiting que. So i gave up and called next day. Next day i reached them but one day too late….so i could not cancel the booking and had to pay 600 Euros for a never taken flight. Conclusion: Never fly Iberia anymore!",
    "date": "April 01, 2025",
    "rating": "1"
  },
  {
    "title": "Disastrous flight with Iberia",
    "text": "Disastrous flight with Iberia. Movie viewing system broken. And the food wasn't great.",
    "date": "April 01, 2025",
    "rating": "1"
  }
]