[
  {
    "title": "One of the Worst Business class",
    "text": "Flight Review and my sheer disappointment. Check in : Awful staff behavior ( not courteous) very rude and disrespectful Counter supervisor and racist I can explain on a separate mail in details . Boarding : Delayed , Slow Aircraft: Boeing 777-300 ERBusiness Class Cabin: Thai Airways Premium Economy has better seating comfort , it’s unbelievable that a carrier like Swiss Air in their long haul flight from BKK- ZRH is so poor standard compared to many other even Asian or middle eastern airlines. It’s not comfortable, and hardly any privacy can not even move freely to use the washroom , I do regret flying with Swiss Air Business Class, I would never fly with swiss, I have seen much smaller Aircraft from even small countries like Tajaksthan with Airbus 310 Neo to have more comfortable seats and space . I have no ideas as to what seats swiss Air Economy or premium Economy has if this is what business class looks like . On my return trip I have paid extra money to be in first class cause this business class felt like a economy class compared to many other like Etihad , Emirates , Qatar, Thai, Singapore and the list can go on and on . I wish someone have given proper review somewhere about swiss Air . So other can decide for themselves. The in flight entertainment had movies from early 80’s and mid 90’s . Cabin air conditioner was not on during boarding until it was on the runway , and even during the entire flight I felt the cabin temperature could be a bit cooler , I was feeling suffocating in the cabin . The amenity kit is a joke the cheapest of its kind I have ever seen, the headphones were old , in total it was a night mare .  The connecting flight was delayed three times by 1 hour  , gates were changed twice . So much for swiss airlines timing . For the same price return on Business Class There were other options to select and I would request any one other who wishes to have direct connection not to fly with swiss Air if any other European city is your destination.  As for me I felt my money was a total waste, such a shame .",
    "date": "June 13, 2025",
    "rating": "1"
  },
  {
    "title": "Airline to be avoided",
    "text": "Airline to be avoided. Everything is terrible",
    "date": "June 14, 2025",
    "rating": "1"
  },
  {
    "title": "Swiss International Airlines booking error",
    "text": "On June 5 at about 9.30am my Swiss International Air lines flight landed in Johannesburg. I had a connecting flight to Durban at 1.40pm (that on my ticket was listed as ‘Swiss Operated By: South African Airways 0555’). At about 10.30am I went to the SAA counter to check in and get my boarding pass. They told me there was a problem on the Swiss Air side and they would contact them as soon as they could. I returned every half hour from then-on but they said they had been unable to contact Swiss Air. By 12-noon several other Swiss Air-booked passengers had arrived with the same issue. Finally at about 12.30 SAA told us that they still had been unable to contact Swiss Air and that the problem was that Swiss Air had failed to secure the bookings. The SAA manager told us that our flight was, in fact, not booked despite what Swiss Air had told us and that if we wanted to get on the flight we would have to buy new tickets. She said we should claim compensation from Swiss Air. I rebooked (as did the others) and the receipt is attached. It cost me R3,828.57 (abouot £160.00)When we were given our boarding passes, the SAA manager said they had discovered that Swiss Air had overbooked and that this was the source of the problem.I contacted Swiss International Airlines and asked for full compensation for the R3,828.57 spent in rectifying the error made by Swiss Air with the booking. They replied that their regulations prevented them from compensating me. The result is that I am out-of-pocket by £160,00 as a direct consequence of a problem with a Swiss International Airlines booking.",
    "date": "June 04, 2025",
    "rating": "1"
  },
  {
    "title": "Inflexible policies",
    "text": "My review is about Swiss' inflexible approach to ticket name change policies. I booked a flight under a wrong last name ; completely my fault for not checking auto-fill when completing the booking form online. The first and middle name, a  unique combination, were correct. I've asked Swiss to have the last name corrected for a fee, sent copies of the travel documents. They wouldn't budge and advised to cancel the flight and rebook under the correct name or fly with the wrong last name at my own risk. Unfortunately, the new fare was more than double the original flights. I had to re-book flights with another airline.",
    "date": "June 02, 2025",
    "rating": "1"
  },
  {
    "title": "Sad state of affairs!",
    "text": "What has happened to this airline? So many negative reviews. Is it a true reflection of the country?Sad very very sad.A small bag, flying from JFK to Zurich.No QR code for easy transit? Waited in line for 90 min to receive a boarding pass?Very layed back service.Paid for a better economy seat. No legroom, and a passenger hitting the back of my seat, as no room to eat?Pathetic.But the final nail in the coffin, scammers from Switzerland calling my mobile within two days of landing.Personally the people would be better off if they closed this farce down. Or employ people whom have their act together!Whatever ever happened to the great, proud Swiss nationals one wonders.So much for progress.",
    "date": "April 26, 2025",
    "rating": "2"
  },
  {
    "title": "Customer Service is non-existent",
    "text": "Key information about airport security access times at Manchester Airport was not provided by Swiss.  Their customer service person refused to accept there was any issue, continually repeated statements that bore no relation to the complaint and make other untrue statements, and then refused to escalate to someone more senior who might be empowered to actually address the complaint.  If this is how they treat someone one a business/first class combo ticket, I dread to think what economy gets you.",
    "date": "June 13, 2025",
    "rating": "1"
  },
  {
    "title": "We booked tickets for flights to Croatia",
    "text": "We booked tickets for flights to Croatia through in January 2025 to ensure a better price, only to receive and email a week ago (5 months later) to state the connecting flight to Croatia was cancelled. I have now had to pay close to double for an alternative flight and have no feedback on the original refund or reason for the cancellation. Unacceptable service and zero accountability from Swissair. You will have no guarantee of a refund and will be left out of pocket on hard earned money. Avoid at all costs...an expensive lesson for me, hoping to save you from the same fate.",
    "date": "June 10, 2025",
    "rating": "1"
  },
  {
    "title": "The worst airline experience ever",
    "text": "The worst airline experience ever, I highly recommend anyone to avoid Swiss. We bought tickets Palermo-Zurich-Toronto-Calgary and return Vancouver-Munich-Frankfurt-Palermo. Several weeks later we get an email from Air Canada that the Frankfurt-Palermo flight has been re-scheduled and will depart before our previous flight arrives in Frankfurt. We manage to get through to online assistance and our return flights are rebooked, to what seems an acceptable alternative. After a few more weeks I look into our booking and it turns out now our return flight starts in Toronto, instead of Vancouver. We won’t be anywhere near Toronto. Contacting Swiss through online chat is impossible. Emails are responded by generic answers which indicate that either the person at the other end doesn’t understand the situation at hand, or doesn’t want to understand it. Eventually we manage to find a telephone number in Switzerland and a reluctant lady explains to us that we can either cancel the entire return journey or request refund for the Vancouver-Toronto leg (which went missing from the booking because Air Canada had not confirmed it to Swiss Air. Which, mind you, Swiss Air never thought of informing us!) However, we can only request the cancellation of the return flight after the journey has started - I.e. after we have flown to Canada.We have bought new return flight tickets (with another airline, of course). We hope that there won’t be more announced and uninformed changes or missing legs in our booking that would affect the outgoing journey, but we have zero confidence left in Swiss. We hope to get back money for the flights we paid for but won’t be receiving, because they “lost” part of the booking, but again, we aren’t confident. We don’t understand why we have to finance Swiss for several months for the flights they cancelled on us, and why we cannot be reimbursed for them immediately, as they have caused the cancellation. So, we submitted a request for cancellation and reimbursement of the return flights, but , in line with our other correspondence with Swiss, we have not heard back from them.So, definitely never again and sincerely advising everyone not to buy tickets with Swiss. We hear their alliance partner Lufthansa is much better, so if you need to fly with them, buy through Lufthansa, not Swiss.",
    "date": "May 31, 2025",
    "rating": "1"
  },
  {
    "title": "Among the worse companies",
    "text": "I flight quite often for work.  Swiss air is among the worse companies: I can barely remember about a flight being on time,  the airplanes are from a 70s nightmare,  the airport crew is unhelpful and impolite.  Avoid if you can",
    "date": "June 08, 2025",
    "rating": "1"
  },
  {
    "title": "Damages to suitcase",
    "text": "They should be accountable for the luggage, as well.When they damage it, they assign another company to handle the compensation which ends up with you paying a more expensive one, with some discounts. All very well calculated.I had to buy another suitcase in a rush because needed to fly the following day (of course, with another airline)Why not to provide the client the possibility to receive the money assessed as the compensation value?I do not need 2 suitcases at all.",
    "date": "June 04, 2025",
    "rating": "1"
  },
  {
    "title": "I am a swiss senator",
    "text": "I am a swiss senator.  I must say that the service has decrease significantly in the last year. Multiple flights delayed, difficult with cabine luggage, price are up. I am gold on other airlines and the experience is very different   . I will vote with my feet.",
    "date": "June 07, 2025",
    "rating": "1"
  },
  {
    "title": "Absolutely unacceptable treatment – SWISS ignores passenger rights",
    "text": "Absolutely unacceptable treatment – SWISS ignores passenger rightsI had one of the most disappointing experiences with SWISS, an airline I once trusted as part of the Star Alliance and a supposedly premium European carrier.During a recent flight, I was obliged to place my handbag in the overhead cabin due to my seat being in an emergency exit row. Upon landing, I discovered that my bag had been damaged by a leaking substance inside the compartment—an incident confirmed in writing by the cabin crew, who witnessed the leak themselves.Despite clear evidence and crew acknowledgment, SWISS refused to take any responsibility, hiding behind vague internal policies. As a so-called “compensation,” they offered me a €100 voucher—not usable unless I buy another ticket with them, which I certainly won’t. This is not compensation. It’s a marketing trap.What is most shocking, however, is the airline’s complete disregard for passenger rights as outlined in European legislation. While Switzerland often aligns itself with EU regulations in the aviation sector, SWISS’s behavior clearly violates the spirit and intent of EU Regulation (EC) No 261/2004 and consumer protection principles. It’s unacceptable that an airline based in a country that wishes to align with the EU chooses to ignore fundamental rights when it suits them.To make matters worse, my checked-in suitcase was also damaged during the same journey, with no resolution or proper response.Fly at your own risk.",
    "date": "June 02, 2025",
    "rating": "1"
  },
  {
    "title": "Their website is atrocious",
    "text": "Their website is atrocious. Spend hours trying to spend $3500 For a business fair to europe but the website kept crashing or stalling.Finally I got through and went to the payment page. My bank asked for a credit card verification which I acknowledged and I went to the Swiss website to complete the transaction and got the sorry.Something went wrong message from swiss airlines website.Now the charge is pending. In a few hours I've been dealing with this.The fare has gone up get this $1000 or 30 plus percent. Probably because they were seeing me active on the site and decided to get another big chunk of money out of me. Not very good business practices if that's what's happening. The brand is in my mind fallen to new lows.",
    "date": "June 04, 2025",
    "rating": "1"
  },
  {
    "title": "Review of Swiss Airways – A Deeply Disappointing Experience from Start to Finish",
    "text": "I have rarely experienced such atrocious customer service as I did with Swiss Airways. One would expect that an airline marketing itself as “Swiss precision” could at least manage to keep to a schedule and treat paying customers with a minimum of respect – but apparently not.My flight was significantly delayed, and even though I, as the customer, did everything right – showed up on time, followed all procedures, remained patient – I was met with arrogance, indifference, and a total lack of accountability from their side. When it is clearly their fault, you expect at least an apology and some effort to make things right. Instead, I was greeted with cold shrugs, vague excuses, and staff who seemed more interested in passing the problem on than solving it.There was no clear information, no compensation unless you fought tooth and nail for it, and absolutely no willingness to admit their own responsibility. The most absurd part? When you try to ask reasonable questions or seek assistance, you’re treated as a nuisance. It honestly felt like they forgot that I am the customer – and they are the ones who messed up.I travel a lot and have flown with many airlines – including budget ones – but this experience with Swiss Airways was among the worst. Their arrogant attitude and incompetent handling of the situation make them completely unfit as a choice if you value even the slightest bit of reliability or respect.Never again.Swiss Airways gets one star – and that’s only because zero isn’t an option.",
    "date": "June 02, 2025",
    "rating": "1"
  },
  {
    "title": "Staff member at Paris Charles deGaulle…",
    "text": "Staff member at Paris Charles deGaulle was obnoxious when we were dropping off our bags. A colleague of hers was pleasant and a gentleman but she was really an obnoxious individual that would put you off Swiss Air Lines. The way she treated customers was disgusting.",
    "date": "May 15, 2025",
    "rating": "1"
  },
  {
    "title": "A Swiss Air dilemma: Loyal frequent flyer customer is charged more than a new customer!",
    "text": "I bought the recommended ticket from Swiss Air called Business Green. This allows for Rebooking “Allowed plus fare difference”. When rebooking Swiss Air wanted a surcharge of 209 CHF.The original ticket cost 1,143.40 CHF (+209 CHF) and a new Business Green ticket would cost 715,55 CHF.Conclusion:A new customer will be able to fly cheaper than a loyal frequent flyer customer who has already bought a ticket.Warran Buffet: Image is made in drops but wasted in buckets!",
    "date": "May 26, 2025",
    "rating": "1"
  },
  {
    "title": "The crew is nice but awful experience",
    "text": "The crew is nice. Food too. BUT the customer service is the worst ever. My luggage was not at the airport when we arrived (still in ZH). We gave our first and second hotel adress for a delivery. They delivered it at the wrong adress 6 days later. Thanks god we had the airtag in it and could find it (we had to drove back to Detroit to pick it up). I had to buy clothes and few other thing and a luggage. Swiss made us paid for the extra luggage and doesnt want to reimburse for what we had to buy. Mafika Mbuyi, the representant, is arrogant and rude. Worst company ever.",
    "date": "April 26, 2025",
    "rating": "2"
  },
  {
    "title": "Unjustified Flight Change and Extra Costs",
    "text": "I had a flight from Bari to Berlin via Switzerland. The second leg was rescheduled to the next day without a clear reason. I was told the original flight didn’t exist, but it did operate.I had to pay for a hotel and miss a workday. Customer service was unhelpful, hard to reach, and gave conflicting information. When I asked for a hotel refund, they first blamed me, then claimed I was notified 14 days earlier.",
    "date": "May 29, 2025",
    "rating": "1"
  },
  {
    "title": "📄 Formal Complaint",
    "text": "📄 Formal Complaint – Urgent Double Charge & Unresolved Refund RequestTo: Swiss International Air LinesDear Swiss Air Team,I am writing to file a formal and urgent complaint regarding a duplicate charge for a ticket change I made on May 17, 2025 via your website. Despite repeated contact attempts and having submitted full evidence, I have not received any resolution, and I urgently need this situation resolved.Here’s what happened:On May 17, I attempted to change my flight through your website using my Lloyds Bank card. The website indicated that the transaction had failed, and no amount was deducted at that time. Thinking it hadn’t gone through, I quickly tried again using my Monzo card, and this time the payment was accepted immediately, with the £546.08 debited from Monzo on the same day (May 17).However, to my surprise, two days later, on May 19, Swiss Air also debited the Lloyds card for the same amount (£546.08) — even though:\t•\tThe transaction had been previously marked as failed on your website.\t•\tThe booking was already completed and paid for using Monzo.\t•\tI had already contacted Lloyds Bank, who confirmed the amount was pending and would only be taken if Swiss Air processed it.This clearly resulted in a double payment for one single booking, which should not have happened.To resolve this, I have:✔ Contacted both Lloyds and Monzo✔ Sent you copies of both bank statements, showing the two charges✔ Tried contacting you via chat and phoneHowever:\t•\tOn the chat, I received no practical help.\t•\tOver the phone, the customer service agent was rude, unhelpful, and accused me of lying, even though I was calmly explaining the issue and offering full evidence. I was treated with disrespect, and my situation was completely ignored.I submitted all documentation and explained the situation clearly. Despite this, more than two weeks have passed, and I still have not received my refund or any clear response. Your website classifies duplicate charges as urgent, but your team has done absolutely nothing to resolve this.I urgently need this £546.08 refunded immediately, or I will have no choice but to escalate this case by:\t•\tFiling chargeback disputes with my banks\t•\tReporting the issue to the Civil Aviation Authority (CAA) or other consumer protection bodies\t•\tPosting detailed public reviews of this experiencePlease treat this as urgent and issue a refund within 48 hours.Sincerely,",
    "date": "May 17, 2025",
    "rating": "1"
  },
  {
    "title": "My luggage is lost and Baggage Support is dire",
    "text": "Hello. I was  a passenger on Swiss Airlines on a flight LX348 from Geneva to London Heathrow. My check-in luggage did not arrive and it appears to be lost. I reported this at LHR on arrival. I have also contacted your handling agents based in Cairo. They have been exceedingly unhelpful and have done nothing but give contradictory information depending on which agent I speak with. This is an utterly shameful state of affairs. I wish to escalate the matter to senior management. There is no clear escalation or complaints option on the website. I have rarely experienced anything as dire as this. No trace of my luggage. And nobody to offer a sensible response. Will contact CEO and Board of Management",
    "date": "May 26, 2025",
    "rating": "1"
  },
  {
    "title": "Very bad experience checking with Swiss…",
    "text": "Very bad experience checking with Swiss airlines at Montreal YUL airport. A Swiss employee acts as a police officer to prevent people going to the normal check-in counter and going instead on the automatic station to print the bag tag.  However printing tag for luggage is only possible on 4 stations! People are queuing for these stations which are not user friendly, slow and need ultimately assistance from the airport employee. Technological solution are only good when they work well. Here we feel like using technologies from the 90s!",
    "date": "May 23, 2025",
    "rating": "1"
  },
  {
    "title": "Most unethical, corrupt, lying airline in the world!!!!!",
    "text": "All the reviews below are so true!!I have been struggling for more than 3 years to rebook or get a refund....+3 years!!!!A nightmare of numerous emails, phone calls, either you get no reply, or they tell you to phone the Customer service team that never answers, or they put the phone down in your ear on purpose!!Now days I get these AI automated emails back, they got even more devious over the last 3 years.We could not get Visas less than a month prior to departure due to Covid and I informed Swiss airlines, and they AGREED to rebook after first having to get an Embassy letter stating the closure due to Covid, which I got and supplied to them.I have been trying to rebook these Business Class flights, which cost us an arm and leg, as they did not want to refund us, which is fine.But it was impossible to get it rebooked by them saying you cannot rebook by email you must phone, and after 1000 phone calls of either no answer or the call being \"dropped\" by them, and they never tried to phone me back and sitting for hours again to try to get through.Short of the story, after more than 3 YEARS now they decided the time has lapsed conveniently for them to rebook and it was now referred to the refund department, feedback to be given 5-7 days from today.....hello, we are not stupid, do they not realise that, they have been and are still just buying time for themselves for another new excuse!!!If it was my fault, I would admit it and accept it, but that is what makes me furious, it is THEIR fault, and they are basically STEALING my hard-earned money that I cannot afford to loose as we saved for years.I am not going to leave this matter, I will pursue more and more avenues possible and will gladly join anybody with the same frustrations, where is the Consumer Act now to help us against these unethical big companies?",
    "date": "May 23, 2025",
    "rating": "1"
  },
  {
    "title": "Canceled flight without paying compensation",
    "text": "They disregard rules completely. They canceled my flight due to winds in Zurich and will not pay compensation under Regulation EC261/2004. Several flights was departuring and arrived at this airport that day and the winds was not a problem. They just completley disregard this regulation and make their own rules. Will never fly with them again.",
    "date": "May 09, 2025",
    "rating": "1"
  },
  {
    "title": "Conditions of transporting to extermination camp.",
    "text": "Flight LX 065 Miami-Zurich on May 14, 2025. Booking code Y3WG55. 9 hours overnight flight.  The chair for which I paid additional fee was broken. It was impossible to recline it. The flight attendant told me that Swiss Air takes such things seriously and when the plane arrives in Zurich someone will look at this problem and probably will fix it. That was an outstanding insult! What would I do during 9 hours flight?!  I was not offered any place substitution. Nothing. To tell you that it was absolute nightmare to fly to Zurich is a huge understatement. I am 69 years old with years long back problems. The conditions of my flight made me feel like I am transported to the extermination camp of World War II. Shame on Swiss Air and their owner Lufthansa Air. Stay away from those crooks that know only one thing; to steal your money! Absolute disgrace!",
    "date": "May 14, 2025",
    "rating": "1"
  },
  {
    "title": "Swiss Air stole my money!",
    "text": "Swiss Air overbooked my flight and rebooked me to another flight.All my friends and family are kept on the flight but I am having to fly on a different journey which is 3 hours longer and when I looked the price up online is a lot cheaper than I had originally paid.The woman on the phone basically just said that’s just tough luck. Absolutely horrendous way to treat someone. I never thought Swiss Air would rob me and steal my money!",
    "date": "May 21, 2025",
    "rating": "1"
  },
  {
    "title": "I wish I had read these reviews",
    "text": "I wish I had read these reviews. Will never fly Swiss Air.",
    "date": "May 20, 2025",
    "rating": "1"
  },
  {
    "title": "I’m genuinely disappointed with my experience with Swiss air",
    "text": "I’m genuinely disappointed with my recent experiences with Swiss Air. Over the past few months, nearly every flight I’ve taken with Swiss has been significantly delayed—some by hours, without any clear explanation or proactive communication.The service on board has also taken a hit:Cabin crew often seem indifferent and unhelpful.Food quality has declined drastically (if it’s even served at all on shorter flights).Basic amenities like charging ports or functioning entertainment systems are hit or miss.Rebooking assistance during delays is chaotic and painfully slow, leaving passengers stranded or misinformed.Swiss Air used to be known for reliability and professionalism. Unfortunately, it now feels like just another airline that overpromises and underdelivers. For an airline representing a country known for precision and quality, this is unacceptable.I hope Swiss takes this seriously and makes meaningful improvements. Otherwise, I’ll be forced to reconsider my loyalty.",
    "date": "May 20, 2025",
    "rating": "1"
  },
  {
    "title": "MIA-ZRH LX65 Swiss B777 Economy Class – Disappointing Experience",
    "text": "I recently flew in the Economy Class of a Swiss Boeing 777, and unfortunately, it was one of the worst flight experiences I’ve had so far. The seat space is extremely tight — there is barely any legroom, and the rows feel uncomfortably close together, making the long-haul experience very unpleasant.Another surprising downside was the tray table, which was smaller than the food tray itself. This made eating or working during the flight unnecessarily difficult. Overall, the comfort level was well below what I expected from a national carrier like SWISS.Given the reputation of Swiss hospitality and precision, I was genuinely disappointed by the cramped design and lack of passenger comfort on this aircraft. I hope the airline seriously reconsiders the layout and comfort standards for long-haul travelers.",
    "date": "May 17, 2025",
    "rating": "1"
  },
  {
    "title": "Swiss is worst than rayanair- the only…",
    "text": "Swiss is worst than rayanair- the only difference is that they are 10 times more expensive. They also weight your luggage at the gate and on board a bottle of water and a piece of chocolate",
    "date": "May 19, 2025",
    "rating": "1"
  },
  {
    "title": "Ridiculous airline that fakes being…",
    "text": "Ridiculous airline that fakes being « better quality ». Often late and off schedule. Misérables service, all extras paying. They won’t even allow a family with a baby to seat together. Swiss is always late and desagreable. Bad cabin service.",
    "date": "May 13, 2025",
    "rating": "1"
  },
  {
    "title": "Still waiting for an answer after 6 months",
    "text": "They diverted us to Dublin without explanation. I arrived to my home in Athens more than 24 hours after I should have. I am still waiting for my compensation 6 months later and no one from their customer service answers any of the feedback forms. Simply unprofessional and irresponsible.",
    "date": "December 09, 2024",
    "rating": "1"
  },
  {
    "title": "Airlines from Hell😡",
    "text": "Terrible service from the beginning to the end…to no use anymore. The costumer service doesn’t exist, they know nothing are very confusing, they respond the call from Egypt . I need to change my flight for medical reasons contact them if would be possible to have the fees removed. I called 4 times to inform that I was not able to flight on the 09/5 at 1830. , I send an email with the my medical letter saying I was not able to flight. THEY DID NOTHING I AM STILL WAITING FOR THEIR REPLY AND THEY DIDNT CANCEL MY FLIGHT AND THEY ARE NOW SAYING IT WAS A “NO SHOW” and that I lost my flight… which is absolutely disgusting once I CALLED SEVERAL TIMES AND SEND AN EMAIL 5hrs before my departing time TO NOT USE THIS COMPANY ANYMORE",
    "date": "May 09, 2025",
    "rating": "1"
  },
  {
    "title": "A very antique aircraft at premium…",
    "text": "A very antique aircraft at premium price for business class . Maybe Swiss thought that paying for 1990’s cabins are right. Economy Class screen in business class which today is even bigger in many economy class airlines. I really feel sorry for the people that pay for an upgrade or for the ticket itself. It’s a rip off. Don’t do it.Flight LX19 from EWR to ZRH on 9/05/2025 at an A330-300",
    "date": "May 05, 2025",
    "rating": "1"
  },
  {
    "title": "👎👎👎👎",
    "text": "We arrived for check-in an hour and a half before the flight, only two counters were serving and the line was full. They knew I was pregnant and still there was no priority. As a result, as soon as our turn came, they announced to us that the flight had been cancelled and that we had to book new tickets. Unacceptable!! First time we have encountered something so bad and irritating",
    "date": "April 21, 2025",
    "rating": "1"
  },
  {
    "title": "Theft and false advertisement",
    "text": "Paid to upgrade my flight to business due to a back injury, had everything confirmed both in writing and over the phone when they called to take my payment, had receipt confirmation and then they issued my tickets saying I hadn't paid for business.I called back and even though I had this in writing they said there's nothing I can do about it other than see if it can be sorted at the airport. I got to the airport and they said there's nothing they can do other than get me to pay for it again and then request a refund. I was even denied onto my flight back because they had no knowledge of any transaction being made so I did not have a ticket on the flight, causing an even higher payment for the upgrade. This was also confirmed again that I can request a refund for the additional payment as I had receipts confirming I had already paid for the business upgrade.It's now been 9 months of going back and forth trying to get a refund and I keep getting responses like \"there was only a 5 minute delay with your flight\" or \"you have already used your ticket so can't get a refund\".No one has acknowledged the fact that I have been charged twice for an upgrade with an addition $3800 being paid for something I'd alresdy purchased and being told if I pay again I can claim a refund.",
    "date": "September 01, 2024",
    "rating": "1"
  },
  {
    "title": "Great experience",
    "text": "Our journey was made very comfortable by the flight crew Lina and Freja. Thank you very much for all you have done to make our flight enjoyable and relaxing.I would definitely fly with Swiss Air again.",
    "date": "May 02, 2025",
    "rating": "5"
  },
  {
    "title": "Unacceptable service and refusal to pay rightful compensation",
    "text": "I booked my ticket with SWISS for flight LX 1019 (April 26, 2025) more than three weeks in advance. At the gate, I was asked to wait, and only after all other passengers had boarded was I informed that the flight was overbooked and I would not be allowed to board.A SWISS staff member assured me at the airport that I would be entitled to €600 in compensation and rebooked me on a later flight. However, despite multiple follow-ups and that verbal promise, SWISS now refuses to pay, falsely citing “extraordinary circumstances” that are not related to overbooking at all.Their customer service has been impersonal, dismissive, and completely unwilling to reconsider the claim. They have now closed the case with no fair explanation.This is not how you treat paying customers. I will be sharing my experience across review platforms and considering legal action. I highly recommend flying with another airline if you value transparency and fair treatment.",
    "date": "April 26, 2025",
    "rating": "1"
  },
  {
    "title": "If I could I would have given Swiss 0…",
    "text": "If I could I would have given Swiss 0 stars. I made my booking and all and had reciept and all. When I were about to check-in my luggage, they tell me I have not paid for check-in luggage. Which I proceed to show them I have paid for. They force me and my friends to pay a additional 70 CHF each. Which they told us they would reimburse us later if I could send all our details.fast forward to when I send them my details, they respond with that my ticket has been checked and that \"Your refund request has successfully been submitted\" which was OVER A YEAR AGO. I have emailed the multiple times after that, in regads to our refund but they have gone completely radio silent on me and me friends. Who also have been trying to get their refunds seperatly.One of the worst airlines of all time. Never have I ever experienced anything like this and if I ever have had any problems they have always sorted the problem on the spot or later on. Huge disappointment, and actually insane how they decline our tickets which said that I had paid for luggage. Scam airline. If you ever think of traveling with them, DON'T",
    "date": "July 10, 2024",
    "rating": "1"
  },
  {
    "title": "Avoid Swiss Air .",
    "text": "BIG JOKE this arilne is !!!Twice in one day my flights were delayed, first fly delayed 35 minut making me missed my connecting flight in Zurich and then  waiting at the airport for 5h for next flight that was delayed by 20 minut.",
    "date": "April 30, 2025",
    "rating": "1"
  },
  {
    "title": "They send your baggage without information, so it gets lost",
    "text": "The woman (Nuria I think to remember), did not tag one of our suitcases, she sent it without any information of us neither the destiny. She had the documentation paper in the hand and the suitcase already gone!!! And at first, two times she tried to blame us saying that we didn’t put it in the bandage. It obviously got lost. Thanks to a kind man we got help because this woman had already sent us away without the baggage claim paper. Anyways the airline told us they had solve the problem but that was not true. They told us it was one of our blue suitcases and that it had already been found and sent correctly, but arriving to the final destination, we knew it was all lies because the one missing was a black one. Now we don’t have any idea where it is, and it does not have any type of information.",
    "date": "April 29, 2025",
    "rating": "1"
  },
  {
    "title": "Helpline",
    "text": "I have been flying to South Africa every year since 1981.We wanted to postpone our departure from 25.3.2025 to 19.3.2025 by phone on 12.2.2025 for family reasons.With the Swiss helpline number, we landed in India, Singapore and the USA, among other places. They didn't understand us or just didn't want to.At Cape Town Airport, they also did not feel responsible as well as the Lufthansa helpline in Germany and referred us to Switzerland.It was claimed that we had cancelled the flight.To date, no evidence has been presented by swiss.Luckily, we found an alternative with the Emirates.After all the bad experiences with Swiss, Edelweiss, Condor and Lufthansa, we will avoid them.",
    "date": "February 12, 2025",
    "rating": "1"
  },
  {
    "title": "Swiss staff cannot be trusted",
    "text": "My flight from Delhi to Zurich was delayed, so in my hurry to get out of the plane I forgot my tablet in the seat pocket. This is a 1500 EUR tablet!I found out at security check, but no way to get back to the planeAnyway, did not catch my connecting flight, had to stand in line for ages to get rebooked, horrible services.I got home to Copenhagen, my bagage was lost, got it two days later.Reported the tablet lost, could see the tablet in my Find app, it was close to Lost & Found.But they claim they did not have the tablet. Only Swiss staff had acces, somebody stole it within crew or cleaning staff !!I will avoid Swiss at any cost, they are impossible to get hold of, their staff cannot be trusted, service is horrible.",
    "date": "March 01, 2025",
    "rating": "1"
  },
  {
    "title": "Arrived 90 minutes late from Sao Paulo…",
    "text": "Arrived 90 minutes late from Sao Paulo (LX 93). so missed their connection to London City.   Spent 8 hours in Zurich airport as they are such a small badly organised airline unable to get us home.  We were dumped on BA and arrived  8 hours late in Heathrow.    Refused us compensation for this.   Also they have the worst dirty toilets ever experienced on a long haul flight.   AVOID.",
    "date": "April 16, 2025",
    "rating": "1"
  },
  {
    "title": "Very positive experience with Swiss Airlines",
    "text": "I would like to place on Record the unprecedented and 5 star treatment we received on-board flight LX0425 from Birmingham to Zurich.My son who was also a passenger had a sudden nose bleed which caused him much distress.The flight attendants were extremely attentive, responsive and displayed alot of care and compassion.They brought him ice to help stop the blood along with plenty of tissue and offered their first Aid tips to help curtail the flow of blood.Thankfully he stopped bleeding after a while.In addition to this, they were also very accommodating when I requested to pray as being a Muslim I had to offer my prayer on-board.These 3 ladies really deserve a huge amount of credit and all the compliments and praise they truly deserve.I managed to get 2 names but all 3 were first Class.Well done Jessica, Eva and flight attendant #3.Thank you very much Swiss.",
    "date": "April 21, 2025",
    "rating": "5"
  },
  {
    "title": "Extremely Disappointing Service",
    "text": "Extremely Disappointing ServiceI’ve flown with Swiss Air on several occasions recently—flights that were operated by AirBaltic—and unfortunately, the experience has been consistently poor.Across four separate flights, the service has been shockingly bad. The cabin crew are consistently rude, unfriendly, and lack basic courtesy. They don’t greet passengers, they’re dismissive when spoken to, and at times, their tone feels outright hostile. It's clear that customer care is not a priority.There’s no warmth, no professionalism, and no sense of hospitality. It feels like passengers are just being “processed,” not served. Even small things like offering water or explaining delays are ignored. If you ask questions, expect to be met with impatience or indifference.This is absolutely not the level of service one would expect when booking through Swiss, a company that markets itself as a premium airline. It’s misleading and disappointing.I would strongly recommend avoiding flights operated by AirBaltic under the Swiss name. Unless the service improves dramatically, I will not be flying with them again.",
    "date": "April 13, 2025",
    "rating": "1"
  },
  {
    "title": "Bad ground service experience",
    "text": "Generally quite a good experience, but for today. I almost missed my flight because 1) there was no baggage check-in kiosk for Swiss nor Lufthansa (shared flight) and 2) the printing of the luggage label did not work from the app. As a result, I had to queue and almost lost my flight. When I asked the ground service what I should do, given that the luggage delivery deadline was soon coming, I was told by them that I should have arrived earlier... But should stay in queue.",
    "date": "April 19, 2025",
    "rating": "2"
  },
  {
    "title": "The absolute worst airline",
    "text": "The absolute worst airline. Flight was cancelled and they refuse to refund the flight OR the baggage! It doesnt make any sense.",
    "date": "March 21, 2025",
    "rating": "1"
  },
  {
    "title": "Non-responsible airline",
    "text": "They rebooked our flight and leaded more than 6 hours late to the scheduled airport. We should have compensation in this circumstance according to Regulation (EC) No 261/2004. However, they kept saying that it was only 3 hours late and refused to take action. A non-responsible airline which formed by liars management.",
    "date": "March 18, 2025",
    "rating": "1"
  },
  {
    "title": "Swiss air is the most uncomfortable…",
    "text": "Swiss air is the most uncomfortable airline to fly with; their seats are the smallest in the world !!!! They also stopped us from boarding our connecting flight by 4 minutes , even though our flight was delayed from  the flight of origin and the people right in front of us were allowed to board!!!!Our baggage was left at the wrong airport, and yet we got no offer of compensation or even an apology .Do not fly this airline!!!! Choose any other flight route so you can avoid the worst experience of your life !!",
    "date": "April 02, 2025",
    "rating": "1"
  },
  {
    "title": "I had my flight cancelled due to the…",
    "text": "I had my flight cancelled due to the fire near Heathrow,So I asked the Swiss air online chat if I could have a refund and was told yes a full refund that was 19 days ago. I was promised it would be refunded between 7-10 days, but after numerous emails I still haven't received it! When booking your flights you pay them immediately, so why don't they do the same for refunds?",
    "date": "March 21, 2025",
    "rating": "1"
  },
  {
    "title": "No customer service",
    "text": "No customer service unfortunately I saw the reviews on upgrades to late seems its normal practice from Swiss air that the upgrade does not go through but money goes off from clients account and no one at Swiss air to send email so money can be released back into account.",
    "date": "March 26, 2025",
    "rating": "1"
  },
  {
    "title": "HORRIBLE",
    "text": "HORRIBLE. Flight cancelled 6 times on the way here and 4 times (for now could increase more!) on the way back. No email from Swiss cancelling the flight, I turn up at the airport with a confirmed ticket and they tell me flight is cancelled or booking does not exist and sell my ticket to a different airline",
    "date": "April 06, 2025",
    "rating": "1"
  },
  {
    "title": "An absolute disgrace",
    "text": "An absolute disgrace! Even in some developing countries, this wouldn’t happen — and yet here we are, in Switzerland. Asking passengers to show up at 4 a.m. when the baggage belts don’t start running until 4:30? That’s nothing but pure contempt. The check-in counters were open, yes, but with no way to drop off luggage, hundreds of people were left waiting — cold, confused, and frustrated. Where is the coordination with Geneva Airport? This chaos reflects terribly on the quality of service. The paralyzing influence of French unions is obvious — and it needs to stop. We don’t want this creeping into Switzerland. Treating passengers this way is disgraceful and completely unacceptable.",
    "date": "April 06, 2025",
    "rating": "1"
  },
  {
    "title": "Musty fuzzy nasty old seats that gave…",
    "text": "Musty fuzzy nasty old seats that gave me near-anaphylaxis pretty much the whole trip. The guy at the gate tried to tell me that I was not going to be able to take my medical supplies with me because it weighed over the amount... But I needed them on the flight and I had previously been told by every airline that obviously if I need something to breathe it has to come with me. Snarky little nasty guy. I would have died if I hadn't brought my medical supplies with me obviously. The airline does absolutely nothing to help if you contact customer service.  What kind of a modern plane has fuzzy Dusty Brown Tweed for seats??!! It looked like a 1970s carpet. Absolutely never flying with them again. Booked through Air Canada and was completely unable to change my flight or do anything because each company kept telling me the other one was going to do the modifications etc. Absolutely miserable flight. And it was one of the really long flights as well. I could barely breathe for most of the trip even with everything I took.",
    "date": "November 10, 2024",
    "rating": "1"
  },
  {
    "title": "Very poor customer support",
    "text": "Very poor customer support. Very impolite and didn t help at all with my issue.",
    "date": "April 03, 2025",
    "rating": "1"
  },
  {
    "title": "This is the worst airline I have ever…",
    "text": "This is the worst airline I have ever taken.my luggage and numerous people have purposely been left behind I have not received my luggage it’s now been two days with no luggage no one should ever use this airline",
    "date": "March 29, 2025",
    "rating": "1"
  },
  {
    "title": "What a shame",
    "text": "What a shame, Swiss Air is not any better than Ryan air or Easyjet. Their new airplane seating layout is absolutely horrendous! I’m a tall person, the space between the seats is ridiculous, yet they charge 3 times more compared to equivalent airlines. Swiss air used to be on top of their game, now they are beneath Ryan air, never again!!! They just lost 6 loyal clients because of their new airplane seating layout, what a shame…",
    "date": "March 30, 2025",
    "rating": "1"
  },
  {
    "title": "Worst company",
    "text": "Worst company. I called multiple times to make sure my dog was able to fly with me for both ways. They assured it was fine and even sent me the paperwork to fill in advance. When I arrived at the airport they notified me that the return flight could not accommodate my dog in the cabin. They refused to change the day of the flight or to reimburse my return ticket. I had to book from another airline to make sure my dog could come back with me. Horrible service. Absolutely do not recommend.",
    "date": "March 24, 2025",
    "rating": "1"
  },
  {
    "title": "If I could rate this 0 stars, I would",
    "text": "My baggage was delayed for two days and finally arrived on the third day in absolutely terrible condition. It was scratched all over (not just one or two scratches—it's completely covered), two wheels were missing, and it seemed like someone had intentionally tried to remove the logo.Swiss's partner handling the case told me I should find a repair shop, handle the fixes myself, and they might review the invoice later for reimbursement (though who knows if that's even true). The suitcase was nearly new when I traveled, and now it’s practically ruined. I'm on holiday with no other suitcase.I tried contacting Swiss Support, but they were no help at all. They just gave me canned responses, offering no real solution. To make matters worse, one of their agents (Elisha) literally closed the chat on me when I was pressing for a resolution. Worst airline I've ever traveled and terrible customer service. AVOID IF YOU CAN !",
    "date": "March 25, 2025",
    "rating": "1"
  },
  {
    "title": "REFUND REFUSAL",
    "text": "REFUND REFUSALI had booked a flight with SWISS (Booking Reference: LPJD54, Ticket Number: 7242339920255) for travel from Johannesburg to Zurich and onward to Tirana, with return flights scheduled between February 10 and February 17, 2025. Unfortunately, my visa application for Albania was rejected, making it impossible for me to proceed with my travel plans. I promptly submitted all necessary documentation, including the visa rejection letter, to request a refund as outlined in SWISS's fare conditions.Timeline of Events:1. February 6, 2025: I contacted SWISS regarding my refund request but received only an acknowledgment that my case was forwarded to the relevant department.2. February 8, 2025: After following up, I requested direct contact information for senior management to escalate the matter due to lack of progress.3. February 11, 2025: Your representative confirmed that my refund request had been sent for approval but provided no timeline or further clarity on resolution steps.Issues Faced:   Prolonged Delays: Despite submitting all required documents promptly, including proof of visa rejection, there has been no resolution after more than a month of waiting.Inadequate Communication: Responses from your customer service team have been vague and unhelpful, leaving me uncertain about the status of my refund or when I can expect closure on this matter.Policy Clarity: According to your fare conditions, refunds are permitted before departure in cases of visa rejection with embassy statement evidence. My case clearly falls within these guidelines, yet the process remains stalled.Impact on Me as a Customer:The lack of urgency and transparency in resolving this issue has caused significant inconvenience and frustration. As a loyal customer who trusted SWISS for its reputed service quality, this experience has been deeply disappointing and does not align with the high standards expected from your airline.I need my full refund",
    "date": "February 11, 2025",
    "rating": "1"
  }
]